#Translated with MozillaTranslator version 5.03
#Sat Mar 12 19:36:01 CET 2005
searchFor=Naj\u00EDt na %S text "%S"
nothingAvailable=(Nic nen\u00ED dostupn\u00E9)
droponhomemsg=Chcete nastavit tento dokument jako novou domovskou st\u00E1nku?
jserror=Na str\u00E1nce se vyskytla chyba. Dvojit\u00FDm poklep\u00E1n\u00EDm zobraz\u00EDte detaily.
droponhomebutton=P\u0159et\u00E1hn\u011Bte odkaz nebo soubor pro nastaven\u00ED domovsk\u00E9 str\u00E1nky
intl.charsetmenu.browser.unicode=UTF-8, UTF-16, UTF-16LE, UTF-16BE, UTF-32LE, UTF-32BE, UTF-7
wallpaperConfirmButton=Nastavit pozad\u00ED
intl.charset.default=ISO-8859-2
openFile=Otev\u0159\u00EDt soubor
general.useragent.locale=cs-CZ
tabs.closeWarning=V tomto okn\u011B je otev\u0159eno %S panel\u016F. Chcete zav\u0159\u00EDt okno a v\u0161echny v n\u011Bm otev\u0159en\u00E9 panely?
intl.accept_languages=cs, en-us, en
nv_stopped=Zastaveno
intl.charset.detector=
wallpaperConfirmMsg=Chcete nastavit tento obr\u00E1zek jako pozad\u00ED va\u0161eho desktopu?
intl.menuitems.alwaysappendaccesskeys=
tabs.historyItem=Skupina panel\u016F
droponhomeokbutton=Nastavit domovskou str\u00E1nku
intl.charsetmenu.mailedit=ISO-8859-2, ISO-8859-1, ISO-8859-15, ISO-8859-6, armscii-8, geostd8, ISO-8859-13, ISO-8859-14, GB2312, GB18030, Big5, KOI8-R, windows-1251, KOI8-U, ISO-8859-7, ISO-8859-8-I, ISO-2022-JP, EUC-KR, ISO-8859-10, ISO-8859-3, TIS-620, ISO-8859-9, UTF-8, VISCII
nv_timeout=\u010Cas vypr\u0161el
nv_done=Hotovo
switchJVMTitle=V\u00FDb\u011Br verze jazyka Java
linkHREFLabel=Um\u00EDst\u011Bn\u00ED\:
showskinsdescription=pravda
linkTargetLabel=Odkaz otev\u0159\u00EDt v\:
intl.charsetmenu.browser.more5=ISO-8859-6, windows-1256, IBM864, x-mac-arabic, x-mac-farsi, ISO-8859-8-I, windows-1255, ISO-8859-8, IBM862, x-mac-hebrew
intl.charsetmenu.browser.static=iso-8859-2, UTF-8
intl.charsetmenu.browser.more4=armscii-8, GEOSTD8, TIS-620, ISO-8859-11, windows-874, IBM857, ISO-8859-9, x-mac-turkish, windows-1254, x-viet-tcvn5712, VISCII, x-viet-vps, windows-1258, x-mac-devanagari, x-mac-gujarati, x-mac-gurmukhi
intl.charsetmenu.browser.more3=GB2312, x-gbk, gb18030, HZ-GB-2312, ISO-2022-CN, Big5, Big5-HKSCS, x-euc-tw, EUC-JP, ISO-2022-JP, Shift_JIS, EUC-KR, x-windows-949, x-johab, ISO-2022-KR
intl.charsetmenu.browser.more2=ISO-8859-4, ISO-8859-13, windows-1257, IBM852, ISO-8859-2, x-mac-ce, windows-1250, x-mac-croatian, IBM855, ISO-8859-5, ISO-IR-111, KOI8-R, x-mac-cyrillic, windows-1251, IBM866, KOI8-U, x-mac-ukrainian, ISO-8859-16, x-mac-romanian
intl.charsetmenu.browser.more1=ISO-8859-2, ISO-8859-15, IBM850, x-mac-roman, windows-1252, ISO-8859-14, ISO-8859-7, x-mac-greek, windows-1253, x-mac-icelandic, ISO-8859-10, ISO-8859-3
wallet.Server=http\://www.mozilla.org/wallet/tables/
tabs.closeWarningPromptMe=Varovat v p\u0159\u00EDpad\u011B, \u017Ee jsou zav\u00EDr\u00E1ny v\u00EDcen\u00E1sobn\u00E9 panely
switchJVMFailed=Pokus o v\u00FDb\u011Br t\u00E9to verze jazyka Java selhal
intl.collationOption=
uploadFile=Nahr\u00E1t soubor
tabs.closeWarningTitle=Potvrdit zav\u0159en\u00ED
tabs.closeButton=Zav\u0159\u00EDt v\u0161echny panely
tabs.closeTab=Zav\u0159\u00EDt panel
droponhometitle=Nastavit domovskou str\u00E1nku
wallet.Samples=http\://www.mozilla.org/wallet/samples/
font.language.group=x-central-euro
switchskins=Zm\u011Bna vzhledu se projev\u00ED a\u017E po restartu aplikace %S.
switchskinstitle=Pou\u017E\u00EDt vzhled
tabs.close=Zav\u0159\u00EDt
noPopupControl=Nelze ovl\u00E1dat pop-up okna z tohoto serveru
wallpaperConfirmTitle=Nastaven\u00ED pozad\u00ED
oldTheme=Vybrali jste vzhled, kter\u00FD bylo navr\u017Een pro p\u0159edchoz\u00ED verzi aplikace %brand% a je tak se sou\u010Dasnou verz\u00ED nekompatibiln\u00ED. Zkuste si pros\u00EDm naj\u00EDt aktualizovanou verzi pomoc\u00ED %brand% Theme Park. Vzhled lze odinstalovat klepnut\u00EDm na tla\u010D\u00EDtko "OK"
oldthemetitle=Varov\u00E1n\u00ED\: nekompatibiln\u00ED vzhled
