#
# ***** BEGIN LICENSE BLOCK *****
# Version: MPL 1.1/GPL 2.0/LGPL 2.1
#
# The contents of this file are subject to the Mozilla Public License Version
# 1.1 (the "License"); you may not use this file except in compliance with
# the License. You may obtain a copy of the License at
# http://www.mozilla.org/MPL/
#
# Software distributed under the License is distributed on an "AS IS" basis,
# WITHOUT WARRANTY OF ANY KIND, either express or implied. See the License
# for the specific language governing rights and limitations under the
# License.
#
# The Original Code is mozilla.org code.
#
# The Initial Developer of the Original Code is
# Netscape Communications Corporation.
# Portions created by the Initial Developer are Copyright (C) 1998
# the Initial Developer. All Rights Reserved.
#
# Contributor(s): 
# - Mikael Hedberg <hedberg@novasphere.net>
# - Hasse Wallanger <hasse@jasajudeju.se>
#
# Alternatively, the contents of this file may be used under the terms of
# either the GNU General Public License Version 2 or later (the "GPL"), or
# the GNU Lesser General Public License Version 2.1 or later (the "LGPL"),
# in which case the provisions of the GPL or the LGPL are applicable instead
# of those above. If you wish to allow use of your version of this file only
# under the terms of either the GPL or the LGPL, and not to allow others to
# use your version of this file under the terms of the MPL, indicate your
# decision by deleting the provisions above and replace them with the notice
# and other provisions required by the GPL or the LGPL. If you do not delete
# the provisions above, a recipient may use your version of this file under
# the terms of any one of the MPL, the GPL or the LGPL.
#
# ***** END LICENSE BLOCK *****

SignedBy=Autenticerat av %S
CertPassPrompt=Skriv in ditt l\u00F6senord f\u00F6r Privata s\u00E4kerhetshanterarens enhet f\u00F6r privata nycklar.

#These are for dialogs
#Download Cert dialog
newCAMessage1=Vill du lita på ”%S” för följande syften?
unnamedCA=Certifikatutf\u00E4rdare (namnl\u00F6s)

#For editing cert trust
editTrustWindowTitle=Redigera certifikattillit
editTrustCA=Certifikatet ”%S” representerar en certifikatutfärdare.
editTrustSSL=Certifikatet ”%S” gavs ut av:
editTrustEmail=Certifikatet ”%S” gavs ut av:
issuerNotTrusted=Eftersom du inte litar p\u00E5 den certifikatutf\u00E4rdare som utf\u00E4rdat detta certifikat, litar du inte heller p\u00E5 \u00E4ktheten i detta certifikat, om inte annat anges h\u00E4r.
issuerTrusted=Eftersom du litar p\u00E5 den certifikatutf\u00E4rdare som utf\u00E4rdat detta certifikat, litar du \u00E4ven p\u00E5 \u00E4ktheten i detta certifikat, om inte annat anges h\u00E4r.
issuerNotKnown=Eftersom du inte k\u00E4nner till den certifikatutf\u00E4rdare som utf\u00E4rdat detta certifikat, litar du inte p\u00E5 \u00E4ktheten i detta certifikat, om inte annat anges h\u00E4r.
issuerCertNotFound=Certifikat f\u00F6r denna certifikatutf\u00E4rdare hittades inte

#For Deleting Certificates
deleteSslCertFlag=deleteSslFlag
deleteSslCertConfirm=\u00C4r du s\u00E4ker p\u00E5 att du vill ta bort dessa webbplatscertifikat?
deleteSslCertImpact=Om du tar bort ett webbplatscertifikat, kommer du att tillfr\u00E5gas om att acceptera det igen n\u00E4sta g\u00E5ng du bes\u00F6ker webbplatsen.
deleteSslCertTitle=Ta bort webbplatscertifikat

deleteUserCertFlag=deleteUserFlag
deleteUserCertConfirm=\u00C4r du s\u00E4ker p\u00E5 att du vill ta bort dessa certifikat?
deleteUserCertImpact=Om du tar bort ett av dina egna certifikat kan du inte l\u00E4ngre anv\u00E4nda det f\u00F6r att identifiera dig med det.
deleteUserCertTitle=Ta bort certifikat

deleteCaCertFlag=deleteCaFlag
deleteCaCertConfirm=\u00C4r du s\u00E4ker p\u00E5 att du vill ta bort dessa CA-certifikat?
deleteCaCertImpact=Om du tar bort ett certifikatutf\u00E4rdare(CA)-certifikat, kommer Mozilla inte l\u00E4ngre att lita p\u00E5 certifikat som givits ut av denna CA.
deleteCaCertTitle=Ta bort CA-certifikat

deleteEmailCertFlag=deleteEmailFlag
deleteEmailCertConfirm=\u00C4r du s\u00E4ker p\u00E5 att du vill ta bort dessa personers e-postcertifikat?
deleteEmailCertImpact=Om du tar bort ett e-postcertifikat, kommer du inte l\u00E4ngre att kunna skicka krypterade e-postmeddelanden till dessa mottagare.
deleteEmailCertTitle=Ta bort e-postcertifikat


#PKCS#12 file dialogs
chooseP12RestoreFileDialog=Filnamn att \u00E5terskapa fr\u00E5n
chooseP12BackupFileDialog=Filnamn att s\u00E4kerhetskopiera till
file_browse_PKCS12_spec=PKCS12-filer

#Mismatch Domain Dialg
mismatchDomainMsg1=Du har försökt etablera en anslutning till ”%S”. Men säkerhetscertifikatet som presenterats hör till ”%S”. Det är möjligt, även om det är osannolikt, att någon försöker avlyssna eller påverka din kommunikation med webbplatsen.
mismatchDomainMsg2=Om du misstänker att certifikatet inte tillhör ”%S”, avbryt anslutningen och meddela platsens administratör.

#Server Cert expired
serverCertExpiredMsg1=”%S” är en plats som använder säkerhetscertifikat till att kryptera data under överföring, men dess certifikat förföll %S.
serverCertExpiredTitle=Servercertifikat har f\u00F6rfallit
serverCertNotYetValedMsg1=”%S” är en plats som använder säkerhetscertifikat till att kryptera data under överföring, men dess certifikat börjar inte gälla förrän %S.
serverCertNotYetValidTitle=Servercertifikat \u00E4nnu inte giltigt
serverCertExpiredMsg2=Du b\u00F6r kontrollera att din dators systemklocka (f\u00F6r n\u00E4rvarande %S) \u00E4r r\u00E4tt inst\u00E4lld.

#Preferences
resetPreferences=Anv\u00E4nd denna knapp f\u00F6r att \u00E5terst\u00E4lla %Ss s\u00E4kerhetsinst\u00E4llningar till de ursprungliga v\u00E4rdena.

#Cert verification
certVerified=Detta certifikat har utf\u00E4rdats f\u00F6r f\u00F6ljande syften:
certNotVerified_CertRevoked=Kan inte verifiera detta certifikat eftersom det har dragits in.
certNotVerified_CertExpired=Kan inte verifiera detta certifikat eftersom det har f\u00F6rfallit.
certNotVerified_CertNotTrusted=Kan inte verifiera detta certifikat eftersom det saknar f\u00F6rtroende.
certNotVerified_IssuerNotTrusted=Kan inte verifiera detta certifikat eftersom utf\u00E4rdaren inte \u00E4r betrodd.
certNotVerified_IssuerUnknown=Kan inte verifiera detta certifikat eftersom utf\u00E4rdaren \u00E4r ok\u00E4nd.
certNotVerified_CAInvalid=Kan inte verifiera detta certifikat eftersom CA-certifikatet \u00E4r ogiltigt.
certNotVerified_Unknown=Kan inte verifiera detta certifikat av ok\u00E4nd anledning.

#Client auth
clientAuthMessage1=Organisation: ”%S”
clientAuthMessage2=Utfärdat under: ”%S”

#Page Info
pageInfo_SiteNotVerified=Webbplatsens identitet \u00E4r ej bekr\u00E4ftad
pageInfo_WebSiteVerified=Webbplatsens identitet \u00E4r bekr\u00E4ftad
pageInfo_Identity_Verified=Webbplatsen %S st\u00F6der \u00E4kthetsbevisning f\u00F6r sidan som visas. Identiteten hos denna webbplats har verifierats av %S, en Certifikatutf\u00E4rdare du litar p\u00E5 f\u00F6r detta syfte.
pageInfo_ViewCertificate=Visa certifikatet som verifierar denna webbplats identitet.
pageInfo_NoEncryption=Anslutningen \u00E4r ej krypterad
pageInfo_Privacy_None1=Webbplatsen %S st\u00F6der inte kryptering av sidan som visas.
pageInfo_Privacy_None2=Information som skickas \u00F6ver Internet utan kryptering kan under \u00F6verf\u00F6ringen l\u00E4sas av obeh\u00F6riga personer. 
pageInfo_Privacy_None3=Sidan som visas \u00E4r inte krypterad.
pageInfo_StrongEncryption=Anslutningen \u00E4r krypterad: H\u00F6ggradig kryptering (%S %S bit)
pageInfo_Privacy_Strong1=Sidan som visas krypterades innan den skickades \u00F6ver Internet.
pageInfo_Privacy_Strong2=Kryptering g\u00F6r det mycket sv\u00E5rt f\u00F6r obeh\u00F6riga personer att l\u00E4sa information som skickas mellan datorer. Det \u00E4r d\u00E4rf\u00F6r mycket osannolikt att n\u00E5gon l\u00E4ste denna information n\u00E4r den skickades \u00F6ver n\u00E4tverket.
pageInfo_WeakEncryption=Anslutningen \u00E4r krypterad: L\u00E5ggradig kryptering (%S %S bit)
pageInfo_Privacy_Weak1=Webbplatsen %S anv\u00E4nder l\u00E5ggradig kryptering f\u00F6r sidan som visas.
pageInfo_Privacy_Weak2=L\u00E5ggradig kryptering kan medf\u00F6ra att obeh\u00F6riga personer kan l\u00E4sa informationen.
pageInfo_MixedContent=Anslutningen \u00E4r delvis krypterad
pageInfo_Privacy_Mixed1=Delar av sidan som visas krypterades inte innan den skickades \u00F6ver Internet.

#Cert Viewer
certDetails=Certifikatvisaren:
notPresent=<Ej del av certifikat>
unknownIssuer=<Ok\u00E4nd utf\u00E4rdare>

escrowFinalMessage=Du bör endast klicka på OK om du litar på att ”%S” skyddar din privata krypteringsnyckel.

#Token Manager
password_not_set=(ej valt)
failed_pw_change=Kan ej \u00E4ndra huvudl\u00F6senordet.
incorrect_pw=Du skrev inte in det nuvarande huvudl\u00F6senordet r\u00E4tt. F\u00F6rs\u00F6k igen.
pw_change_ok=Huvudl\u00F6senordet har \u00E4ndrats.
pw_erased_ok=Varning! Du har tagit bort ditt huvudl\u00F6senord.
pw_not_wanted=Varning! Du har valt att inte anv\u00E4nda ett huvudl\u00F6senord.
pw_empty_warning=Dina lagrade webb- och e-postl\u00F6senord, formul\u00E4rdata och privata nycklar kommer inte att skyddas.
pw_change2empty_in_fips_mode=Du \u00E4r f\u00F6r n\u00E4rvarande i FIPS-l\u00E4ge. FIPS-l\u00E4ge kr\u00E4ver ett giltigt huvudl\u00F6senord.
login_failed=Inloggning misslyckades
loadPK11TokenDialog=V\u00E4lj en PKCS#11-enhet att anv\u00E4nda
devinfo_modname=Modul
devinfo_modpath=S\u00F6kv\u00E4g
devinfo_label=Etikett
devinfo_manID=Tillverkare
devinfo_serialnum=Serienummer
devinfo_hwversion=HW-version
devinfo_fwversion=FW-version
devinfo_status=Status
devinfo_desc=Beskrivning
devinfo_stat_disabled=Inaktiverad
devinfo_stat_notpresent=Ej tillg\u00E4nglig
devinfo_stat_uninitialized=Ej initierad
devinfo_stat_notloggedin=Ej inloggad
devinfo_stat_loggedin=Inloggad
devinfo_stat_ready=Klar
enable_fips=Aktivera FIPS
disable_fips=Inaktivera FIPS
fips_nonempty_password_required=FIPS-l\u00E4ge kr\u00E4ver ett giltigt huvudl\u00F6senord f\u00F6r varje s\u00E4kerhetsenhet. Ange ett l\u00F6senord innan du aktiverar FIPS-l\u00E4ge.

# CRL next update.
crlNextUpdateMsg1=%S kan inte etablera en krypterad anslutning till ”%S”.
crlNextUpdateMsg2=Listan över indragna certifikat (Certificate Revocation List, CRL) från ”%S” behöver uppdateras.
NoUpdateFailure=Ingen
lastFetchUrlLabel=URL h\u00E4mtades ursprungligen fr\u00E5n
advertisedUrlLabel=URL utannonserad av certifieringsorganet
CrlUpdatePrefsSetConfirmation = Inst\u00E4llningarna f\u00F6r automatisk uppdatering aktiveras n\u00E4r du startar om Mozilla.
crlAutoUpdateDayCntError=Antal dagar till n\u00E4sta uppdatering m\u00E5ste vara ett tal st\u00F6rre \u00E4n noll.
crlAutoUpdtaeFreqCntError=Uppdateringsfrekvens m\u00E5ste vara ett tal st\u00F6rre \u00E4n noll.
disabledStatement=Automatisk uppdatering \u00E4r inte aktiverad f\u00F6r denna CRL.
enabledStatement=Automatisk uppdatering \u00E4r aktiverad f\u00F6r denna CRL.
crlAutoupdateQuestion1=Vill du aktivera automatisk uppdatering?
crlAutoupdateQuestion2=Vill du visa inst\u00E4llningarna f\u00F6r automatisk uppdatering?
undefinedValStr=<Ej definierad>
undefinedURL=En URL f\u00F6r automatisk uppdatering \u00E4r inte definierad.
yesButton=Ja
noButton=Nej
resetPasswordConfirmationTitle=Radera huvudl\u00F6senordet
resetPasswordConfirmationMessage=Ditt l\u00F6senord har raderats.
crlAutoupdateEnabled=Aktiverad
crlAutoupdateNotEnabled=Ej aktiverad
crlAutoupdateOk=OK
crlAutoupdateFailed=Misslyckad
crlImportNewCRLTitle=Importera lista \u00F6ver indragna certifikat (CRL)
crlImportNewCRLLabel=Importera CRL:en fr\u00E5n:

#Import certificate(s) file dialog
importEmailCertPrompt=V\u00E4lj en fil som inneh\u00E5ller det e-postcertifikat du vill importera
importCACertsPrompt=V\u00E4lj en fil som inneh\u00E5ller det rotcertifikat du vill importera
importWebSiteCertPrompt=V\u00E4lj en fil som inneh\u00E5ller det webbplatscertifikat du vill importera
file_browse_Certificate_spec=Certifikatfiler

# Form Signing confirmation prompt
formSigningIntro=Platsen ”%S” har begärt att du signerar följande textmeddelande:
