<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.1//EN" "http://www.w3.org/TR/xhtml11/DTD/xhtml11.dtd"[
    <!ENTITY % brandDTD SYSTEM "chrome://branding/locale/brand.dtd" >
    %brandDTD;
]
>
<!--
Contributors:
  R.J. Keller <rlk@trfenv.com> (original author)
  Jeff Walden <jwalden+code@mit.edu>
  Steffen Wilberg <steffen.wilberg@web.de>
-->

<html xmlns="http://www.w3.org/1999/xhtml">
<head>
  <title>Ako pou&#382;&#237;va&#357; pomocn&#237;ka</title>
  <link rel="stylesheet" type="text/css" href="chrome://help/skin/helpFileLayout.css"/>
</head>

<body>

<h1 id="help_window_top">Ako pou&#382;&#237;va&#357; pomocn&#237;ka</h1>

<div class="contentsBox">V tejto kapitole:
  <ul>
    <li><a href="#finding_the_topic_you_want">Vyh&#318;adanie t&#233;my</a></li>
    <li><a href="#search_tips">Tipy na vyh&#318;ad&#225;vanie</a></li>
  </ul>
</div>

<h2 id="finding_the_topic_you_want">Vyh&#318;adanie t&#233;my</h2>

<p>Ak chcete zobrazi&#357; inform&#225;cie pomocn&#237;ka v tomto okne, kliknite na t&#233;mu v postrannom paneli
  <em>Obsah</em>. Kliknut&#237;m na znak <span class="noMac">plus</span>
  <span class="mac">triangle</span> ved&#318;a n&#225;zvu t&#233;my sa zobrazia dostupn&#233; podt&#233;my.</p>

<p>Ak si chcete nejak&#250; t&#233;mu vyh&#318;ada&#357;, nap&#237;&#353;te slovo alebo fr&#225;zu do panela <em>H&#318;ada&#357;</em> a zobrazia sa n&#225;jden&#233; t&#233;my. Kliknut&#237;m na t&#233;mu si ju m&#244;&#382;ete pre&#269;&#237;ta&#357;. Ak nie s&#250; po h&#318;adan&#237; zobrazen&#233; &#382;iadne t&#233;my, sk&#250;ste zada&#357; menej slov alebo in&#250; kombin&#225;ciu slov. V&#253;sledky h&#318;adania bud&#250; zobrazen&#233; v paneli <em>H&#318;ada&#357;</em>. Ak chcete op&#228;&#357; zobrazi&#357; obsah pomocn&#237;ka, kliknite na &#269;erven&#233; tla&#269;idlo
  v pravom hornom rohu panela <em>H&#318;ada&#357;</em>, vyma&#382;te text z po&#318;a <em>H&#318;ada&#357;</em>, alebo stla&#269;te kl&#225;ves
  <kbd>Esc</kbd>.</p>

<p>Ak chcete vidie&#357; inform&#225;cie vz&#357;ahuj&#250;ce sa k t&#233;me, ktor&#250; pr&#225;ve &#269;&#237;tate, m&#244;&#382;ete klikn&#250;&#357; na ktor&#253;ko&#318;vek odkaz v texte presne tak isto, ako to rob&#237;te v prehliada&#269;i. M&#244;&#382;ete sa takisto vr&#225;ti&#357; nasp&#228;&#357; na t&#233;my, ktor&#233; ste u&#382; &#269;&#237;tali, pou&#382;it&#237;m tla&#269;idiel Nasp&#228;&#357; a Dopredu.</p>

<h2 id="search_tips">Tipy na vyh&#318;ad&#225;vanie</h2>

<p>Ak ste nena&#353;li, &#269;o ste h&#318;adali, m&#225;me pre v&#225;s nieko&#318;ko u&#382;ito&#269;n&#253;ch tipov:</p>

<ul>
  <li>Uistite sa, &#382;e h&#318;ad&#225;te nie&#269;o, &#269;o sa vz&#357;ahuje k &brandShortName;u, toto nie je preh&#318;ad&#225;va&#269; internetu.</li>
  <li>Sna&#382;te sa roz&#353;&#237;ri&#357; va&#353;e h&#318;adanie - nezad&#225;vajte pr&#237;li&#353; &#353;pecifick&#233; fr&#225;zy; h&#318;adan&#233; slov&#225; m&#244;&#382;u by&#357; v texte zadan&#233; inak.</li>
  <li>Nebu&#271;te pr&#237;li&#353; roz&#353;&#237;rny. Napr&#237;klad, h&#318;adanie be&#382;n&#233;ho slova ako 
    &quot;strana&quot; v&#225;m pravdepodobne vr&#225;ti viac v&#253;sledkov ako ste &#269;akali.</li>
</ul>

<div class="contentsBox"><em>09. j&#250;la 2005</em></div>
<p>Copyright &copy; 2003-2006 Spolupracovn&#237;ci projektu Mozilla Help Viewer.</p>

</body>
</html>
