# ***** BEGIN LICENSE BLOCK *****
# Version: MPL 1.1/GPL 2.0/LGPL 2.1
#
# The contents of this file are subject to the Mozilla Public License Version
# 1.1 (the "License"); you may not use this file except in compliance with
# the License. You may obtain a copy of the License at
# http://www.mozilla.org/MPL/
#
# Software distributed under the License is distributed on an "AS IS" basis,
# WITHOUT WARRANTY OF ANY KIND, either express or implied. See the License
# for the specific language governing rights and limitations under the
# License.
#
# The Original Code is mozilla.org code.
#
# The Initial Developer of the Original Code is
# Netscape Communications Corporation.
# Portions created by the Initial Developer are Copyright (C) 1998
# the Initial Developer. All Rights Reserved.
#
# Contributor(s):
#
# Alternatively, the contents of this file may be used under the terms of
# either of the GNU General Public License Version 2 or later (the "GPL"),
# or the GNU Lesser General Public License Version 2.1 or later (the "LGPL"),
# in which case the provisions of the GPL or the LGPL are applicable instead
# of those above. If you wish to allow use of your version of this file only
# under the terms of either the GPL or the LGPL, and not to allow others to
# use your version of this file under the terms of the MPL, indicate your
# decision by deleting the provisions above and replace them with the notice
# and other provisions required by the GPL or the LGPL. If you do not delete
# the provisions above, a recipient may use your version of this file under
# the terms of any one of the MPL, the GPL or the LGPL.
#
# ***** END LICENSE BLOCK *****

malformedURI=URL p\u0142a\u0107iwy njeje a njeda so \u010Dita\u0107.
fileNotFound=%S njeeksistuje abo njehod\u017Ae\u0161e so wo\u010Dini\u0107. Pro\u0161u p\u0159epruwuj\u0107e \u0161\u0107e\u017Eku a mjeno dataje a spytaj\u0107e to znowa.
dnsNotFound=%S njeda so namaka\u0107. P\u0159epruwuj\u0107e mjeno a wospjetuj\u0107e akciju.
protocolNotFound=%S zregistrowany protokol njeje.
connectionFailure=Zwisk bu p\u0159i pospy\u0107e %S kontaktowa\u0107 zapow\u011Bd\u017Aeny.
netInterrupt=Zwisk k %S je so njenad\u017Aicy sk\u00F3n\u010Di\u0142. N\u011Bkotre daty m\u00F3\u017Ea p\u0159enjesene by\u0107.
netTimeout=P\u0159ekro\u010Denje doby zwjazujo z %S.
redirectLoop=Limit za p\u0159erjadowanje za tut\u00F3n URL p\u0159ekro\u010Deny. Njeje m\u00F3\u017Eno po\u017Eadanu stronu \u010Dita\u0107. To m\u00F3\u017Ee p\u0159ez placki, kotre\u017E su blokowane, zawinowane by\u0107.
repost=Strona, kotru\u017E spyta\u0107e za\u010Dita\u0107, je so z POST-datow za\u0142o\u017Ei\u0142a, kotre\u017E su w pufrowaku wuhasnjene. Hdy\u017E daty wospjet s\u0107ele\u0107e, so k\u00F3\u017Eda akcija, kotru\u017E je formular p\u0159ewjed\u0142, (ka\u017E pytanje abo Online-nakup), hi\u0161\u0107e raz p\u0159ewjed\u017Ae. Zo by\u0161\u0107e daty wospjet p\u00F3s\u0142a\u0142, klik\u0144\u0107e na W porjadku. Hewak klik\u0144\u0107e na P\u0159etorhny\u0107.
repostConfirm=Strona, kotru\u017E chce\u0107e wobhlada\u0107, POST-daty wobsahuje. Jeli tute daty wospjet s\u0107ele\u0107e, so k\u00F3\u017Eda akcija, kotru\u017E je formular p\u0159ewjed\u0142 (ka\u017E pytanje abo Online-nakup), hi\u0161\u0107e raz p\u0159ewjed\u017Ae. Zo by\u0161\u0107e daty wospjet p\u00F3s\u0142a\u0142, klik\u0144\u0107e na W porjadku. Hewak klik\u0144\u0107e na P\u0159etorhny\u0107.
unknownSocketType=Tut\u00F3n dokument njeda so pokaza\u0107, chibazo instaluje\u0107e Personal Security Manager (PSM). S\u0107eh\u0144\u0107e a instaluj\u0107e PSM a spytaj\u0107e znowa abo staj\u0107e ze swojim systemowym administratorom.
netReset=Dokument \u017Eane daty njewobsahuje.
netOffline=Tut\u00F3n dokument njeda so pokaza\u0107, do\u0142ho\u017E s\u0107e offline. Zo by\u0161\u0107e online \u0161o\u0142, znjem\u00F3\u017E\u0144\u0107e Offline d\u017A\u011B\u0142a\u0107 z poskitka Dataja.
isprinting=Dokument njeda so zm\u011Bni\u0107, mjeztym zo \u0107i\u0161\u0107e\u0107e abo s\u0107e w \u0107i\u0161\u0107erskim p\u0159ehled\u017Ae.
deniedPortAccess=P\u0159istup do podatowejo portoweho \u010Dis\u0142a bu z p\u0159i\u010Dinow w\u011Bstoty znjem\u00F3\u017Enjeny.
proxyResolveFailure=Proksy-serwer, kotry\u017E s\u0107e konfigurowa\u0142, njehod\u017Ae\u0161e so namaka\u0107. Pro\u0161u p\u0159epruwuj\u0107e swoje proksy-nastajenja a spytaj\u0107e hi\u0161\u0107e raz.
proxyConnectFailure=Zwisk bu zapow\u011Bd\u017Aeny hdy\u017E spyta, zo by so kontakt z proksy-serwerom, kotry\u017E s\u0107e konfigurowa\u0142, namaka\u0142. Pro\u0161u p\u0159epruwuj\u0107e swoje proksy-nastajenja a spytaj\u0107e hi\u0161\u0107e raz.
externalProtocolTitle=Wonkowne protokolowe napra\u0161owanje
externalProtocolPrompt=Wonkowna aplikacija dyrbi so startowa\u0107, zo by z %1$S wobchad\u017Aa\u0142o: wotkazy.\n\n\nPo\u017Eadany wotkaz:\n\n%2$S\n\nAplikacija: %3$S Jeli njejs\u0107e tute napra\u0161owanje wo\u010Dakowa\u0142, m\u00F3\u017Ee to pospyt by\u0107, brach w tym druhim programje zwu\u017Eitkowa\u0107. P\u0159etorh\u0144\u0107e tute napra\u0161owanje, chibazo s\u0107e w\u011Bsty, zo z\u0142ow\u00F3lne njeje.\n
#LOCALIZATION NOTE (externalProtocolUnknown): The following string is shown if the application name can't be determined
externalProtocolUnknown=<Njeznaty>
externalProtocolChkMsg=M\u00F3j wub\u011Br za w\u0161\u011B wotkazy tutoho typa sej spomjatkowa\u0107.
externalProtocolLaunchBtn=Aplikaciju startowa\u0107
