#
# ***** BEGIN LICENSE BLOCK *****
# Version: MPL 1.1/GPL 2.0/LGPL 2.1
#
# The contents of this file are subject to the Mozilla Public License Version
# 1.1 (the "License"); you may not use this file except in compliance with
# the License. You may obtain a copy of the License at
# http://www.mozilla.org/MPL/
#
# Software distributed under the License is distributed on an "AS IS" basis,
# WITHOUT WARRANTY OF ANY KIND, either express or implied. See the License
# for the specific language governing rights and limitations under the
# License.
#
# The Original Code is mozilla.org code.
#
# The Initial Developer of the Original Code is
# Netscape Communications Corporation.
# Portions created by the Initial Developer are Copyright (C) 1998
# the Initial Developer. All Rights Reserved.
#
# Contributor(s):
#
# Alternatively, the contents of this file may be used under the terms of
# either the GNU General Public License Version 2 or later (the "GPL"), or
# the GNU Lesser General Public License Version 2.1 or later (the "LGPL"),
# in which case the provisions of the GPL or the LGPL are applicable instead
# of those above. If you wish to allow use of your version of this file only
# under the terms of either the GPL or the LGPL, and not to allow others to
# use your version of this file under the terms of the MPL, indicate your
# decision by deleting the provisions above and replace them with the notice
# and other provisions required by the GPL or the LGPL. If you do not delete
# the provisions above, a recipient may use your version of this file under
# the terms of any one of the MPL, the GPL or the LGPL.
#
# ***** END LICENSE BLOCK *****

SignedBy=A\u016Dtentikigita de %S
CertPassPrompt=Bonvolu enigi la personan sekurecan pasvorton por la sekureca aparato de privataj \u015Dlosiloj PSM.

#These are for dialogs
#Download Cert dialog
newCAMessage1=\u0108u vi volas fidi "%S" por jenaj celoj?
unnamedCA=Atestila a\u016Dtoritato (sen nomo)

#For editing cert trust
editTrustWindowTitle=Modifi atestilan fidon
editTrustCA=La atestilo "%S" reprezentas atestilan a\u016Dtoritaton.
editTrustSSL=La atestilo "%S" estas eldonita de:
editTrustEmail=La atestilo "%S" estas eldonita de:
issuerNotTrusted=\u0108ar vi ne fidas la atestilan a\u016Dtoritaton, kiu eldonis \u0109i tiun atestilon, vi anka\u016D ne fidas la a\u016Dtentikecon de \u0109i tiu atestilo, esepte se vi indikas ion alian \u0109i tie.
issuerTrusted=\u0108ar vi fidas la atestilan a\u016Dtoritaton, kiu eldonis \u0109i tiun atestilon, vi anka\u016D fidas la a\u016Dtentikecon de \u0109i tiu atestilo, escepte se vi indikas ion alian \u0109i tie.
issuerNotKnown=\u0108ar vi ne konas la atestilan a\u016Dtoritaton, kiu eldonis \u0109i tiun atestilon, vi anka\u016D ne fidas la a\u016Dtentikecon de \u0109i tiu atestilo, escepte se vi indikas ion alian \u0109i tie.
issuerCertNotFound=Atestilo por \u0109i tiu atestila a\u016Dtoritato ne povis esti trovata

#For Deleting Certificates
deleteSslCertFlag=deleteSslFlag
deleteSslCertConfirm=\u0108u vi vere volas forvi\u015Di \u0109i tiujn retejajn atestilojn?
deleteSslCertImpact=Se vi forvi\u015Das retejan atestilon, vi estos pridemandita, \u0109u vi denove volas akcepti \u011Din la sekvontan fojon, kiam vi vizitos la retejon.
deleteSslCertTitle=Forvi\u015Di retejajn atestilojn

deleteUserCertFlag=deleteUserFlag
deleteUserCertConfirm=\u0108u vi vere volas forvi\u015Di \u0109i tiujn atestilojn?
deleteUserCertImpact=Se vi forvi\u015Das unu el viaj propraj atestiloj, vi ne plu povas uzi \u011Din por identigi vin mem.
deleteUserCertTitle=Forvi\u015Di viajn atestilojn

deleteCaCertFlag=deleteCaFlag
deleteCaCertConfirm=\u0108u vi vere volas forvi\u015Di \u0109i tiujn atestilojn de CA?
deleteCaCertImpact=Se vi forvi\u015Das atestilon de atestila a\u016Dtoritato (CA), via foliumilo ne plu konfidos iun ajn atestilon eldonita de \u0109i tiu CA.
deleteCaCertTitle=Forvi\u015Di atestilojn de CA

deleteEmailCertFlag=deleteEmailFlag
deleteEmailCertConfirm=\u0108u vi vere volas forvi\u015Di \u0109i tiujn la atestilojn de \u0109i tiuj homoj?
deleteEmailCertImpact=Se vi forvi\u015Das retpo\u015Dtan atestilon, vi ne plu povos sendi \u0109ifritan retpo\u015Dton al \u0109i tiuj homoj.
deleteEmailCertTitle=Forvi\u015Di retpo\u015Dtajn atestilojn


#PKCS#12 file dialogs
chooseP12RestoreFileDialog=Dosiera nomo por resta\u016Drado
chooseP12BackupFileDialog=Dosiera nomo por sekurigo
file_browse_PKCS12_spec=Dosieroj PKCS12

#Mismatch Domain Dialg
mismatchDomainMsg1=Vi provis krei konekton al "%S". Tamen, la prezentita sekureca atestilo apartenas al "%S". Estas eble, kvankam ne ver\u015Dajne, ke iu provas penetri en vian komunikadon kun \u0109i tiu  retejo.
mismatchDomainMsg2=Se vi suspektas, ke la montrata atestilo ne apartenas al "%S", bonvolu nuligi la konekton kaj sciigu la retejan administranton.

#Server Cert expired
serverCertExpiredMsg1="%S" estas retejo kiu uzas sekurecan atestilon por \u0109ifri datumojn dum la transigo, sed \u011Dia atestilo malvalidi\u011Dis la %S.
serverCertExpiredTitle=Servila atestilo malvalidi\u011Dis
serverCertNotYetValedMsg1="%S" estas retejo, kiu uzas sekurecan atestilon por \u0109ifri datumojn dum la transigo, sed \u011Dia atestilo ne estos valida nur \u011Dis %S.
serverCertNotYetValidTitle=Servila atestilo ankora\u016D ne valida
serverCertExpiredMsg2=Vi kontrolu por esti certa, ke la horo en via komputilo (nuntempe al %S starigita) estas \u011Dusta.

#Preferences
resetPreferences=Uzu \u0109i tiun butonon por restarigi la sekurecajn agordojn de %S al siaj originalajn valoroj.

#Cert verification
certVerified=\u0108i tiu atestilo estas verigita por jenaj uzoj:
certNotVerified_CertRevoked=Ne eblis verigi \u0109i tiun atestilon, \u0109ar \u011Di estas revokita.
certNotVerified_CertExpired=Ne eblis verigi \u0109i tiun atestilon, \u0109ar \u011Di malvalidi\u011Dis.
certNotVerified_CertNotTrusted=Could not verify this certificate because it is not trusted.
certNotVerified_IssuerNotTrusted=Ne eblis verigi \u0109i tiun atestilon, \u0109ar la eldoninto ne estas fidinda.
certNotVerified_IssuerUnknown=Ne eblis verigi \u0109i tiun atestilon, \u0109ar la eldoninto estas nekonata.
certNotVerified_CAInvalid=Ne eblis verigi \u0109i tiuni atestilon, \u0109ar la atestilo de la CA ne estas valida.
certNotVerified_Unknown=Ne eblis verigi \u0109i tiun atestilon pro nekonataj kialoj.

#Client auth
clientAuthMessage1=Organizo: "%S"
clientAuthMessage2=Eldonita sub "%S"

#Page Info
pageInfo_SiteNotVerified=La reteja identeco ne estas verigita
pageInfo_WebSiteVerified=La idento de la retejo estas verigita
pageInfo_Identity_Verified=La  retejo %S subtenas a\u016Dtentikigon por la pa\u011Do, kiun vi rigardas. La identeco de \u0109i tiu retejo estas verigita de %S, atestila a\u016Dtoritato, kiun vi tiucele fidas.
pageInfo_ViewCertificate=Rigardi la sekurecan atestilon, kiu verigas la identecon de \u0109i tiu retejo.
pageInfo_NoEncryption=Konekto ne \u0109ifrita
pageInfo_Privacy_None1=La  retejo %S ne subtenas \u0109ifradon por la pa\u011Do, kiun vi \u0135us rigardas.
pageInfo_Privacy_None2=Informoj ne\u0109ifrite senditaj tra la interreto, povas esti rigardataj de aliaj homoj dum \u011Dia transito.
pageInfo_Privacy_None3=La pa\u011Do, kiun vi rigardas, ne estas \u0109ifrita.
pageInfo_StrongEncryption=\u0108ifrita konekto: Altgrada \u0109ifrado (%S %S bita)
pageInfo_Privacy_Strong1=La pa\u011Do, kiun vi rigardas, estas \u0109ifrita, anta\u016D ol \u011Di estas sendita tra la interreto.
pageInfo_Privacy_Strong2=La \u0109ifrado ege malfaciligas al nerajtigitaj homoj la rigardadon de informoj voja\u011Dantaj inter komputiloj. Tial estas tre never\u015Dajne, ke iu povus legi \u0109i tiun pa\u011Don dum \u011Dia transito tra la reto.
pageInfo_WeakEncryption=\u0108ifrita konekto: Malaltgrada \u0109ifrado (%S %S bita)
pageInfo_Privacy_Weak1=La retejo %S uzas malaltgradan \u0109ifradon por la pa\u011Do, kiun vi \u0135us rigardas.
pageInfo_Privacy_Weak2=Malaltgrada \u0109ifrado povus permesi al nerajtigitaj homoj rigardi \u0109i tiujn informojn.
pageInfo_MixedContent=Konekto parte \u0109ifrita
pageInfo_Privacy_Mixed1=Partoj de la pa\u011Do, kiun vi \u0135us rigardas, ne estis \u0109ifrataj anta\u016D ol ili estis transigataj tra la interreto.

#Cert Viewer
certDetails=Atestila rigardanto:
notPresent=<Ne parto de atestilo>
unknownIssuer=<Nekonata eldoninto>

escrowFinalMessage=Vi alklaku Akcepti nur se vi fidas "%S" por protekti vian \u0109ifran privatan \u015Dlosilon.

#Token Manager
password_not_set=(ne difinita)
failed_pw_change=Maleble \u015Dan\u011Di \u0109efpasvorton
incorrect_pw=Vi ne enigis la \u011Dustan aktualan \u0109efpasvorton. Bonvolu provi denove.
pw_change_ok=\u0108efpasvorto sukcese \u015Dan\u011Dita.
pw_erased_ok=Averto! Vi forvi\u015Dis vian \u0109efpasvorton.
pw_not_wanted=Averto! Vi decidis ne uzi \u0109efpasvorton.
pw_empty_warning=Viaj konservitaj retejaj kaj retpo\u015Dtaj pasvortoj, formularaj datumoj kaj privataj \u015Dlosiloj ne estos protektataj.
pw_change2empty_in_fips_mode=Vi estas nun en re\u011Dimo FIPS. FIPS postulas \u0109efpasvorton.
login_failed=Ensalutado malsukcesis
loadPK11TokenDialog=Elekti la \u015Dargotan aparaton PKCS\#11
devinfo_modname=Modulo
devinfo_modpath=Vojo
devinfo_label=Etikedo
devinfo_manID=Produktanto
devinfo_serialnum=Seria numero
devinfo_hwversion=Hardvara versio
devinfo_fwversion=Firmprograma versio
devinfo_status=Stato
devinfo_desc=Priskribo
devinfo_stat_disabled=Malebligita
devinfo_stat_notpresent=Ne ekzistanta
devinfo_stat_uninitialized=Ne pravalorizata
devinfo_stat_notloggedin=Ne ensalutita
devinfo_stat_loggedin=Ensalutita
devinfo_stat_ready=Preta
enable_fips=Ebligi FIPS
disable_fips=Malebligi FIPS
fips_nonempty_password_required=La re\u011Dimo FIPS postulas, ke vi difinis \u0109efpasvorton por \u0109iu sekureca aparato. Bonvolu difini la pasvorton, anta\u016D ol vi ebligas la re\u011Dimon FIPS.

# CRL next update.
crlNextUpdateMsg1=%S ne povas krei \u0109ifritan konekton al "%S".
crlNextUpdateMsg2=La Certificate Revocation List (CRL) el "%S" devas esti \u011Disdatigata.
NoUpdateFailure=Neniu
lastFetchUrlLabel=URL origine havigita el
advertisedUrlLabel=URL anoncita per CA
CrlUpdatePrefsSetConfirmation=La agordoj de a\u016Dtomata \u011Disdatigo efikos post restartigo de la foliumilo.
crlAutoUpdateDayCntError=Nombro de tagoj anta\u016D sekvonta \u011Disdatigo devas esti pli granda ol nul.
crlAutoUpdtaeFreqCntError=Ofteco de \u011Disdatigo devas esti nombro pli granda ol nul.
disabledStatement=La a\u016Dtomata \u011Disdatigo ne estas ebligita por \u0109i tiu CRL.
enabledStatement=La a\u016Dtomata \u011Disdatigo estas ebligita por \u0109i tiu CRL.
crlAutoupdateQuestion1=\u0108u vi \u015Datus ebligi la a\u016Dtomatan \u011Disdatigon?
crlAutoupdateQuestion2=\u0108u vi \u015Datus rigardi la a\u016Dtomatajn gi\u015Ddatigajn agordojn?
undefinedValStr=<Nedifinita>
undefinedURL=La URL por a\u016Dtomata \u011Disdatigo ne estas difinita.
yesButton=Jes
noButton=Ne
resetPasswordConfirmationTitle=Restarigi \u0109efpasvorton
resetPasswordConfirmationMessage=Via pasvorto estas restarigita.
crlAutoupdateEnabled=Ebligita
crlAutoupdateNotEnabled=Ne ebligita
crlAutoupdateOk=Akcepti
crlAutoupdateFailed=Malsukcesis
crlImportNewCRLTitle=Revoka listo de importa atestilo
crlImportNewCRLLabel=Importi CRL el:

#Import certificate(s) file dialog
importEmailCertPrompt=Elekti dosieron, kiu enhavas ies importotan retpo\u015Dtan atestilon
importCACertsPrompt=Elekti dosieron, kiu enhavas la importotajn atestilo(j)n de atestila a\u016Dtoritato
importWebSiteCertPrompt=Elekti dosieron, kiu enhavas importotan retejan atestilon
file_browse_Certificate_spec=Atestilaj dosieroj

# Form Signing confirmation prompt
formSigningIntro=La retejo '%S' postulis, ke vi subskribu jenan tekstmesa\u011Don:
