# ***** BEGIN LICENSE BLOCK *****
# Version: MPL 1.1/GPL 2.0/LGPL 2.1
#
# The contents of this file are subject to the Mozilla Public License Version
# 1.1 (the "License"); you may not use this file except in compliance with
# the License. You may obtain a copy of the License at
# http://www.mozilla.org/MPL/
#
# Software distributed under the License is distributed on an "AS IS" basis,
# WITHOUT WARRANTY OF ANY KIND, either express or implied. See the License
# for the specific language governing rights and limitations under the
# License.
#
# The Original Code is mozilla.org code.
#
# The Initial Developer of the Original Code is
# Netscape Communications Corporation.
# Portions created by the Initial Developer are Copyright (C) 1998
# the Initial Developer. All Rights Reserved.
#
# Contributor(s):
#   Roland Mainz <roland.mainz@informatik.med.uni-giessen.de>
#   Zbigniew Braniecki <gandalf@aviary.pl> (Polish l10n)
#   Marek Stepien <marcoos@aviary.pl> (Polish l10n)
#   Piotr Bartecki <pbartecki@mozillapl.org> (Polish l10n)
#   Marek Wawoczny <GmbH@mozillapl.org> (Polish l10n)
#
# Alternatively, the contents of this file may be used under the terms of
# either of the GNU General Public License Version 2 or later (the "GPL"),
# or the GNU Lesser General Public License Version 2.1 or later (the "LGPL"),
# in which case the provisions of the GPL or the LGPL are applicable instead
# of those above. If you wish to allow use of your version of this file only
# under the terms of either the GPL or the LGPL, and not to allow others to
# use your version of this file under the terms of the MPL, indicate your
# decision by deleting the provisions above and replace them with the notice
# and other provisions required by the GPL or the LGPL. If you do not delete
# the provisions above, a recipient may use your version of this file under
# the terms of any one of the MPL, the GPL or the LGPL.
#
# ***** END LICENSE BLOCK *****

pagenumber=%1$d
pageofpages=%1$d \u0645\u0646 %2$d
fontname=serif
fontsize=10
noPrintFilename.title=\u0627\u0633\u0645 \u0627\u0644\u0645\u0644\u0641\u0651 \u0645\u0641\u0642\u0648\u062F
noPrintFilename.alert=\u0627\u0646\u062A\u0642\u064A\u062A "\u0637\u0628\u0627\u0639\u0629 \u0625\u0644\u0649 \u0645\u0644\u0641\u0651"\u060C \u0648 \u0627\u0633\u0645 \u0627\u0644\u0645\u0644\u0641\u0651 \u0641\u0627\u0631\u063A!
fileConfirm.exists=%S \u0645\u0648\u062C\u0648\u062F\u064C \u0645\u0633\u0628\u0642\u0627\u064B.\n\u0647\u0644 \u062A\u0631\u064A\u062F \u0627\u0633\u062A\u0628\u062F\u0627\u0644\u0647\u061F
print_error_dialog_title=\u062E\u0637\u0623 \u0637\u0627\u0628\u0639\u0629
printpreview_error_dialog_title=\u062E\u0637\u0623 \u0645\u0639\u0627\u064A\u0646\u0629 \u0627\u0644\u0637\u0651\u0628\u0627\u0639\u0629
NS_ERROR_GFX_PRINTER_CMD_NOT_FOUND=\u062D\u062F\u062B\u062A \u0645\u0634\u0643\u0644\u0629 \u0641\u064A \u0627\u0644\u0637\u0651\u0628\u0627\u0639\u0629. \u0644\u0627 \u062A\u062F\u0639\u0645 \u0627\u0644\u0637\u0651\u0627\u0628\u0639\u0629 \u0623\u0645\u0631 \u0637\u0628\u0627\u0639\u0629.
NS_ERROR_GFX_PRINTER_CMD_FAILURE=\u062D\u062F\u062B\u062A \u0645\u0634\u0643\u0644\u0629 \u0641\u064A \u0627\u0644\u0637\u0651\u0628\u0627\u0639\u0629. \u0641\u0634\u0644\u062A \u062A\u0639\u0644\u064A\u0645\u0629 \u0623\u064F\u0631\u0633\u0644\u062A \u0625\u0644\u0649 \u0627\u0644\u0637\u0651\u0627\u0628\u0639\u0629.
NS_ERROR_GFX_PRINTER_NO_PRINTER_AVAILABLE=\u062D\u062F\u062B\u062A \u0645\u0634\u0643\u0644\u0629 \u0641\u064A \u0627\u0644\u0637\u0651\u0628\u0627\u0639\u0629. \u0644\u0645 \u064A\u0645\u0643\u0646 \u0625\u064A\u062C\u0627\u062F \u0637\u0627\u0628\u0639\u0629.
NS_ERROR_GFX_PRINTER_NAME_NOT_FOUND=\u062D\u062F\u062B\u062A \u0645\u0634\u0643\u0644\u0629 \u0641\u064A \u0627\u0644\u0637\u0651\u0628\u0627\u0639\u0629. \u0644\u0645 \u064A\u0645\u0643\u0646 \u0625\u064A\u062C\u0627\u062F \u0627\u0644\u0637\u0651\u0627\u0628\u0639\u0629.
NS_ERROR_GFX_PRINTER_ACCESS_DENIED=\u062D\u062F\u062B\u062A \u0645\u0634\u0643\u0644\u0629 \u0641\u064A \u0627\u0644\u0637\u0651\u0628\u0627\u0639\u0629. \u0631\u0641\u0636 \u0627\u0644\u0648\u0635\u0648\u0644 \u0625\u0644\u0649 \u0627\u0644\u0637\u0651\u0627\u0628\u0639\u0629.
NS_ERROR_GFX_PRINTER_INVALID_ATTRIBUTE=\u062D\u062F\u062B\u062A \u0645\u0634\u0643\u0644\u0629 \u0641\u064A \u0627\u0644\u0637\u0651\u0628\u0627\u0639\u0629. \u062A\u0645\u0651\u062A \u0645\u062D\u0627\u0648\u0644\u0629 \u0627\u0644\u0648\u0635\u0648\u0644 \u0644\u062E\u0627\u0635\u0651\u0629 \u0637\u0627\u0628\u0639\u0629 \u063A\u064A\u0631 \u0635\u0627\u0644\u062D\u0629.
NS_ERROR_GFX_PRINTER_PRINTER_NOT_READY=\u062D\u062F\u062B\u062A \u0645\u0634\u0643\u0644\u0629 \u0641\u064A \u0627\u0644\u0637\u0651\u0628\u0627\u0639\u0629. \u0627\u0644\u0637\u0651\u0627\u0628\u0639\u0629 \u063A\u064A\u0631 \u062C\u0627\u0647\u0632\u0629.
NS_ERROR_GFX_PRINTER_OUT_OF_PAPER=\u062D\u062F\u062B\u062A \u0645\u0634\u0643\u0644\u0629 \u0641\u064A \u0627\u0644\u0637\u0651\u0628\u0627\u0639\u0629. \u0627\u0646\u062A\u0647\u0649 \u0648\u0631\u0642 \u0627\u0644\u0637\u0651\u0627\u0628\u0639\u0629.
NS_ERROR_GFX_PRINTER_PRINTER_IO_ERROR=\u062D\u062F\u062B\u062A \u0645\u0634\u0643\u0644\u0629 \u0641\u064A \u0627\u0644\u0637\u0651\u0628\u0627\u0639\u0629. \u062E\u0637\u0623 \u062F\u062E\u0644/\u062E\u0631\u062C \u0641\u064A \u0627\u0644\u0637\u0651\u0627\u0628\u0639\u0629.
NS_ERROR_GFX_PRINTER_COULD_NOT_OPEN_FILE=\u062D\u062F\u062B\u062A \u0645\u0634\u0643\u0644\u0629 \u0641\u064A \u0627\u0644\u0637\u0651\u0628\u0627\u0639\u0629. \u0644\u0645 \u064A\u0645\u0643\u0646 \u0641\u062A\u062D \u0645\u0644\u0641\u0651 \u0627\u0644\u062E\u0631\u062C.
NS_ERROR_GFX_PRINTER_FILE_IO_ERROR=\u062D\u062F\u062B \u062E\u0637\u0623 \u0641\u064A \u0643\u062A\u0627\u0628\u0629 \u0645\u0644\u0641\u0651 \u062E\u0631\u062C \u0627\u0644\u0637\u0651\u0628\u0627\u0639\u0629.
NS_ERROR_GFX_PRINTER_PRINTPREVIEW=\u064A\u062C\u0628 \u0623\u0646 \u062A\u0648\u062C\u062F \u0637\u0627\u0628\u0639\u0629 \u0648\u0627\u062D\u062F\u0629 \u0639\u0644\u0649 \u0627\u0644\u0623\u0642\u0644\u0651 \u0644\u0639\u0631\u0636 \u0645\u0639\u0627\u064A\u0646\u0629 \u0627\u0644\u0637\u0651\u0628\u0627\u0639\u0629.
NS_ERROR_UNEXPECTED=\u062D\u062F\u062B\u062A \u0645\u0634\u0643\u0644\u0629 \u063A\u064A\u0631 \u0645\u062A\u0648\u0642\u0651\u0639\u0629 \u0641\u064A \u0627\u0644\u0637\u0651\u0628\u0627\u0639\u0629.
NS_ERROR_OUT_OF_MEMORY=\u062D\u062F\u062B\u062A \u0645\u0634\u0643\u0644\u0629 \u0641\u064A \u0627\u0644\u0637\u0651\u0628\u0627\u0639\u0629. \u0644\u0627 \u062A\u0648\u062C\u062F \u0630\u0627\u0643\u0631\u0629 \u062D\u0631\u0651\u0629 \u0643\u0627\u0641\u064A\u0629 \u0644\u0644\u0637\u0651\u0628\u0627\u0639\u0629.
NS_ERROR_NOT_IMPLEMENTED=\u0628\u0639\u0636 \u0648\u0638\u064A\u0641\u064A\u0651\u0629 \u0627\u0644\u0637\u0628\u0627\u0639\u0629 \u063A\u064A\u0631 \u0645\u0646\u0641\u0651\u0630.
NS_ERROR_NOT_AVAILABLE=\u063A\u064A\u0631 \u0645\u062A\u0648\u0641\u0651\u0631
NS_ERROR_ABORT=\u0623\u064F\u062D\u0628\u0637 \u0623\u0648 \u0623\u064F\u0644\u063A\u064A \u0639\u0645\u0644 \u0627\u0644\u0637\u0651\u0628\u0627\u0639\u0629.
NS_ERROR_FAILURE=\u062D\u062F\u062B \u062E\u0637\u0623 \u063A\u064A\u0631 \u0645\u0639\u0631\u0648\u0641 \u0623\u062B\u0646\u0627\u0621 \u0627\u0644\u0637\u0651\u0628\u0627\u0639\u0629.
NS_ERROR_GFX_PRINTER_STARTDOC=\u0641\u0634\u0644\u062A \u0627\u0644\u0637\u0651\u0628\u0627\u0639\u0629 \u0639\u0646\u062F \u0628\u062F\u0621 \u0627\u0644\u0645\u0633\u062A\u0646\u062F.
NS_ERROR_GFX_PRINTER_ENDDOC=\u0641\u0634\u0644\u062A \u0627\u0644\u0637\u0651\u0628\u0627\u0639\u0629 \u0639\u0646\u062F \u0625\u0643\u0645\u0627\u0644 \u0627\u0644\u0645\u0633\u062A\u0646\u062F.
NS_ERROR_GFX_PRINTER_STARTPAGE=\u0641\u0634\u0644\u062A \u0627\u0644\u0637\u0651\u0628\u0627\u0639\u0629 \u0639\u0646\u062F \u0628\u062F\u0621 \u0627\u0644\u0635\u0651\u0641\u062D\u0629.
NS_ERROR_GFX_PRINTER_ENDPAGE=\u0641\u0634\u0644\u062A \u0627\u0644\u0637\u0651\u0628\u0627\u0639\u0629 \u0639\u0646\u062F \u0625\u0646\u0647\u0627\u0621 \u0627\u0644\u0635\u0651\u0641\u062D\u0629.
NS_ERROR_GFX_PRINTER_PRINT_WHILE_PREVIEW=\u0644\u0627 \u064A\u0645\u0643\u0646\u0643 \u0623\u0646 \u062A\u0637\u0628\u0639 \u0623\u062B\u0646\u0627\u0621 \u0645\u0639\u0627\u064A\u0646\u0629 \u0627\u0644\u0637\u0651\u0628\u0627\u0639\u0629.
NS_ERROR_GFX_PRINTER_PAPER_SIZE_NOT_SUPPORTED=\u062D\u062F\u062B\u062A \u0645\u0634\u0643\u0644\u0629 \u0641\u064A \u0627\u0644\u0637\u0651\u0628\u0627\u0639\u0629 \u0644\u0623\u0646 \u062D\u062C\u0645 \u0627\u0644\u0648\u0631\u0642 \u0627\u0644\u0630\u064A \u062D\u062F\u0651\u062F\u062A\u0647 \u063A\u064A\u0631 \u0645\u062F\u0639\u0648\u0645 \u0645\u0646 \u0637\u0627\u0628\u0639\u062A\u0643.
NS_ERROR_GFX_PRINTER_ORIENTATION_NOT_SUPPORTED=\u062D\u062F\u062B\u062A \u0645\u0634\u0643\u0644\u0629 \u0641\u064A \u0627\u0644\u0637\u0651\u0628\u0627\u0639\u0629 \u0644\u0623\u0646 \u0627\u062A\u0651\u062C\u0627\u0647 \u0627\u0644\u0648\u0631\u0642 \u0627\u0644\u0630\u064A \u062D\u062F\u0651\u062F\u062A\u0647 \u063A\u064A\u0631 \u0645\u062F\u0639\u0648\u0645 \u0645\u0646 \u0637\u0627\u0628\u0639\u062A\u0643.
NS_ERROR_GFX_PRINTER_COLORSPACE_NOT_SUPPORTED=\u062D\u062F\u062B\u062A \u0645\u0634\u0643\u0644\u0629 \u0641\u064A \u0627\u0644\u0637\u0651\u0628\u0627\u0639\u0629 \u0644\u0623\u0646 \u0639\u0645\u0644 \u0627\u0644\u0637\u0651\u0628\u0627\u0639\u0629 \u064A\u062A\u0637\u0644\u0651\u0628 \u0625\u0645\u0643\u0627\u0646\u064A\u0651\u0627\u062A \u0644\u0648\u0646\u064A\u0651\u0629 \u063A\u064A\u0631 \u0645\u062F\u0639\u0648\u0645\u0629 \u0645\u0646 \u0642\u0628\u0644 \u0637\u0627\u0628\u0639\u062A\u0643.
NS_ERROR_GFX_PRINTER_TOO_MANY_COPIES=\u062D\u062F\u062B\u062A \u0645\u0634\u0643\u0644\u0629 \u0641\u064A \u0627\u0644\u0637\u0651\u0628\u0627\u0639\u0629 \u0644\u0623\u0646\u0643 \u0637\u0644\u0628\u062A \u0639\u062F\u062F\u0627\u064B \u0643\u0628\u064A\u0631\u0627\u064B \u062C\u062F\u0651\u0627\u064B \u0645\u0646 \u0627\u0644\u0646\u0633\u062E.
NS_ERROR_GFX_PRINTER_DRIVER_CONFIGURATION_ERROR=\u062D\u062F\u062B\u062A \u0645\u0634\u0643\u0644\u0629 \u0641\u064A \u0627\u0644\u0637\u0651\u0628\u0627\u0639\u0629. \u0628\u0631\u0646\u0627\u0645\u062C \u0642\u064A\u0627\u062F\u0629 \u0627\u0644\u0637\u0651\u0627\u0628\u0639\u0629 \u063A\u064A\u0631 \u0645\u0639\u062F\u0651 \u0628\u0634\u0643\u0644 \u062C\u064A\u0651\u062F.
NS_ERROR_GFX_PRINTER_XPRINT_BROKEN_XPRT=\u0648\u062C\u062F \u0625\u0635\u062F\u0627\u0631 \u0645\u0639\u0637\u0651\u0644 \u0645\u0646 \u0646\u0627\u062F\u0644 X \u0644\u0644\u0637\u0651\u0628\u0627\u0639\u0629 (Xprt). \u0642\u062F \u0644\u0627 \u064A\u0639\u0645\u0644 \u0646\u0627\u062F\u0644 (Xprt) \u0647\u0630\u0627 \u0628\u0634\u0643\u0644 \u0635\u062D\u064A\u062D. \u0627\u0644\u0631\u0651\u062C\u0627\u0621 \u0627\u0644\u0627\u062A\u0651\u0635\u0627\u0644 \u0628\u0645\u0635\u062F\u0631 \u0627\u0644\u0646\u0651\u0627\u062F\u0644 \u0644\u0625\u0635\u062F\u0627\u0631 \u0645\u0635\u062D\u0651\u062D.
NS_ERROR_GFX_PRINTER_DOC_IS_BUSY_PP=\u0644\u0627 \u064A\u0633\u062A\u0637\u0639 \u0627\u0644\u0645\u062A\u0635\u0641\u0651\u062D \u0645\u0639\u0627\u064A\u0646\u0629 \u0627\u0644\u0637\u0651\u0628\u0627\u0639\u0629 \u0627\u0644\u0622\u0646.\n\u0627\u0644\u0631\u0651\u062C\u0627\u0621 \u0627\u0644\u0645\u062D\u0627\u0648\u0644\u0629 \u0645\u0631\u0651\u0629 \u062B\u0627\u0646\u064A\u0629 \u0639\u0646\u062F \u0627\u0646\u062A\u0647\u0627\u0621 \u062A\u062D\u0645\u064A\u0644 \u0627\u0644\u0635\u0651\u0641\u062D\u0629.
NS_ERROR_GFX_PRINTER_DOC_WAS_DESTORYED=\u0627\u0633\u062A\u0628\u062F\u0644\u062A \u0627\u0644\u0635\u0651\u0641\u062D\u0629 \u0623\u062B\u0646\u0627\u0621 \u0645\u062D\u0627\u0648\u0644\u062A\u0643 \u0637\u0628\u0627\u0639\u062A\u0647\u0627.\n\u0627\u0644\u0631\u0651\u062C\u0627\u0621 \u0627\u0644\u0645\u062D\u0627\u0648\u0644\u0629 \u0645\u0631\u0651\u0629 \u0623\u062E\u0631\u0649.
NS_ERROR_GFX_NO_PRINTDIALOG_IN_TOOLKIT=\u0625\u0645\u0651\u0627 \u0623\u0646 \u0627\u0644\u062D\u0648\u0627\u0631\u0627\u062A \u0627\u0644\u0642\u0627\u0628\u0644\u0629 \u0644\u0644\u0625\u0644\u062D\u0627\u0642 \u063A\u064A\u0631 \u0645\u062B\u0628\u0651\u062A\u0629 \u0628\u0634\u0643\u0644 \u062C\u064A\u0651\u062F\n\u0623\u0648 \u0623\u0646\u0651 \u0639\u062F\u0651\u0629 GFX \u0644\u0627 \u062A\u062F\u0639\u0645 \u0627\u0644\u062D\u0648\u0627\u0631\u0627\u062A \u0627\u0644\u0623\u0635\u0644\u064A\u0651\u0629 \u0628\u0639\u062F \u0627\u0644\u0622\u0646
NS_ERROR_GFX_NO_PRINTROMPTSERVICE=\u062E\u062F\u0645\u0629 \u0637\u0644\u0628 \u0627\u0644\u0637\u0651\u0628\u0627\u0639\u0629 \u0645\u0641\u0642\u0648\u062F\u0629.
NS_ERROR_GFX_PRINTER_NO_XUL=\u0644\u0645 \u0646\u062A\u0645\u0643\u0651\u0646 \u0645\u0646 \u0637\u0628\u0627\u0639\u0629 \u0623\u0648 \u0645\u0639\u0627\u064A\u0646\u0629 \u0647\u0630\u0647 \u0627\u0644\u0635\u0651\u0641\u062D\u0629 \u0644\u0644\u0637\u0651\u0628\u0627\u0639\u0629.
NS_ERROR_GFX_PRINTER_XPRINT_NO_XPRINT_SERVERS_FOUND=\u062D\u062F\u062B\u062A \u0645\u0634\u0643\u0644\u0629 \u0641\u064A \u0627\u0644\u0637\u0651\u0628\u0627\u0639\u0629. \u0644\u0645 \u064A\u0645\u0643\u0646 \u0625\u064A\u062C\u0627\u062F \u0623\u064A \u0646\u0648\u0627\u062F\u0644 Xprint.\n\u0625\u0641\u062D\u0635 \u0644\u0644\u062A\u0623\u0643\u0651\u062F \u0623\u0646\u0651 \u0645\u062A\u062D\u0648\u0651\u0644 \u0627\u0644\u0628\u064A\u0626\u0629 XPSERVERLIST \u064A\u062D\u062A\u0648\u064A \u0646\u0648\u0627\u062F\u0644 Xprint \u0635\u0627\u0644\u062D\u0629.\n\u0644\u0644\u0645\u0632\u064A\u062F \u0645\u0646 \u0627\u0644\u0645\u0639\u0644\u0648\u0645\u0627\u062A \u0625\u0646\u0638\u0631 http://xprint.mozdev.org/ \u0623\u0648 http://www.mozilla.org/projects/xprint/
NS_ERROR_GFX_PRINTER_PLEX_NOT_SUPPORTED=\u062D\u062F\u062B\u062A \u0645\u0634\u0643\u0644\u0629 \u0641\u064A \u0627\u0644\u0637\u0651\u0628\u0627\u0639\u0629 \u0644\u0623\u0646\u0651 \u0648\u0636\u0639 \u0628\u0644\u064A\u0643\u0633 \u0627\u0644\u0630\u064A \u062D\u062F\u0651\u062F\u062A\u0647 \u063A\u064A\u0631 \u0645\u062F\u0639\u0648\u0645 \u0645\u0646 \u0637\u0627\u0628\u0639\u062A\u0643.
NS_ERROR_GFX_PRINTER_DOC_IS_BUSY=\u0644\u0627 \u064A\u0633\u062A\u0637\u064A\u0639 \u0627\u0644\u0645\u062A\u0635\u0641\u0651\u062D \u0623\u0646 \u064A\u0637\u0628\u0639 \u0627\u0644\u0645\u0633\u062A\u0646\u062F \u0623\u062B\u0646\u0627\u0621 \u062A\u062D\u0645\u064A\u0644\u0647.
NS_ERROR_GFX_PRINTING_NOT_IMPLEMENTED=\u0627\u0644\u0637\u0651\u0628\u0627\u0639\u0629 \u063A\u064A\u0631 \u0645\u0646\u0641\u0651\u0630\u0629.
NS_ERROR_GFX_COULD_NOT_LOAD_PRINT_MODULE=\u0644\u0627 \u064A\u0645\u0643\u0646 \u062A\u062D\u0645\u064A\u0644 \u0648\u062D\u062F\u0629 \u0627\u0644\u0637\u0651\u0628\u0627\u0639\u0629 \u0627\u0644\u0645\u0637\u0644\u0648\u0628\u0629.
NS_ERROR_GFX_PRINTER_RESOLUTION_NOT_SUPPORTED=\u0647\u0646\u0627\u0643 \u0645\u0634\u0643\u0644\u0629 \u0641\u064A \u0627\u0644\u0637\u0651\u0628\u0627\u0639\u0629 \u0644\u0623\u0646 \u0648\u0636\u0639 \u0627\u0644\u062F\u0651\u0642\u0651\u0629 \u0623\u0648 \u0627\u0644\u062C\u0651\u0648\u062F\u0629 \u0627\u0644\u0645\u062D\u062F\u062F \u063A\u064A\u0631 \u0645\u062F\u0639\u0648\u0645 \u0645\u0646 \u0627\u0644\u0637\u0651\u0627\u0628\u0639\u0629.
noprinter=\u0644\u0627 \u062A\u062A\u0648\u0641\u0651\u0631 \u0637\u0627\u0628\u0639\u0627\u062A.
PrintToFile=\u0627\u0644\u0637\u0651\u0628\u0627\u0639\u0629 \u0625\u0644\u0649 \u0645\u0644\u0641
