# ***** BEGIN LICENSE BLOCK *****
# Version: MPL 1.1/GPL 2.0/LGPL 2.1
#
# The contents of this file are subject to the Mozilla Public License Version
# 1.1 (the "License"); you may not use this file except in compliance with
# the License. You may obtain a copy of the License at
# http://www.mozilla.org/MPL/
#
# Software distributed under the License is distributed on an "AS IS" basis,
# WITHOUT WARRANTY OF ANY KIND, either express or implied. See the License
# for the specific language governing rights and limitations under the
# License.
#
# The Original Code is mozilla.org code.
#
# The Initial Developer of the Original Code is
# Netscape Communications Corporation.
# Portions created by the Initial Developer are Copyright (C) 1998
# the Initial Developer. All Rights Reserved.
#
# Contributor(s):
#
# Alternatively, the contents of this file may be used under the terms of
# either of the GNU General Public License Version 2 or later (the "GPL"),
# or the GNU Lesser General Public License Version 2.1 or later (the "LGPL"),
# in which case the provisions of the GPL or the LGPL are applicable instead
# of those above. If you wish to allow use of your version of this file only
# under the terms of either the GPL or the LGPL, and not to allow others to
# use your version of this file under the terms of the MPL, indicate your
# decision by deleting the provisions above and replace them with the notice
# and other provisions required by the GPL or the LGPL. If you do not delete
# the provisions above, a recipient may use your version of this file under
# the terms of any one of the MPL, the GPL or the LGPL.
#
# ***** END LICENSE BLOCK *****

malformedURI=URL ne estas valida kaj ne povas esti \u015Dargata.
fileNotFound=La dosiero %S ne estas trovita. Bonvolu kontroli la lokon kaj provu denove.
dnsNotFound=%S ne estas trovita.  Bonvolu kontroli la nomon kaj provu denove.
protocolNotFound=%S ne estas registrita protokolo.
connectionFailure=La konekto estas rifuzita dum provo kontakti %S.
netInterrupt=La konekto al %S estas subite interrompita. Kelkaj datumoj eble estas transigitaj.
netTimeout=El\u0109erpi\u011Dis la tempo por la operacio dum la provo kontakti %S.
redirectLoop=Limito de \u0109irka\u016Dkonduko por \u0109i tiu URL transpasita. Ne estas eble \u015Dargi petitan pa\u011Don. Tio estas eble ka\u016Dzita per kuketoj, kiuj estis blokataj.
repost=La pa\u011Do, kiun vi volas rigardi enhavas POSTDATA, kiu malvalidi\u011Dis en la ka\u015Dmemoro. Se vi resendas la datumojn, la originala ago de la formularo (ekzemple ser\u0109ado a\u016D a\u0109etado perreta) estos refarita. Por resendi la datumojn alklaku Akcepti,. Alikaze alklaku Nuligi.
repostConfirm=La pa\u011Do, kiun vi volas rigardi enhavas POSTDATA. Se vi resendas la datumojn, la originala ago de la formularo (ekzemple ser\u0109ado a\u016D a\u0109etado perreta) estos refarita. Por resendi la datumojn alklaku Akcepti, por ne sendi \u011Din, alklaku Nuligi.
unknownSocketType=\u0108i tiu dokumento ne estas vidigebla, escepte se vi instalas la "Personal Security Manager" (PSM). El\u015Dutu kaj instalu PSM kaj provu ankora\u016Dfoje a\u016D kontaktu vian sistemadministranton.
netReset=La dokumento ne enhavas datumojn.
netOffline=\u0108i tiu dokumento ne estas vidigebla, dum vi estas sen konekto. Por konekti malebligu Labori senkonekte el la menuo Dosiero.
isprinting=La dokumento ne estas \u015Dan\u011Debla dum printado a\u016D en la  printa  anta\u016Drigardo.
deniedPortAccess=Atingo al la donita pordnumero estas malebligita pro sekurecaj kialoj.
proxyResolveFailure=La prokura servilo, kiun vi konfiguris, ne povis esti trovata. Bonvolu kontroli viajn prokurajn agordojn kaj provu denove.
proxyConnectFailure=La konekto estas rifuzita, kiam vi provis kontakti la prokuran servilon, kiun vi konfiguris. Bonvolu kontroli viajn prokurajn agordojn kaj provu ankora\u016Dfoje.
externalProtocolTitle=Peto pri ekstera protokolo
externalProtocolPrompt=Ekstera aplika\u0135o devas esti startigata por pritrakti %1$S: ligilojn.\n\n\nPetita ligilo:\n\n%2$S\n\nAplika\u0135o: %3$S\n\n\Se vi ne atendis tiun peton, tio povas esti provo profiti el malperfekta\u0135o en tiu alia programo. Nuligu \u0109i tiun peton, escepte se vi estas certa, ke \u011Di ne estas malica.\n
#LOCALIZATION NOTE (externalProtocolUnknown): The following string is shown if the application name can't be determined
externalProtocolUnknown=<Nekonata>
externalProtocolChkMsg=Rememori elekton por \u0109iuj ligiloj de \u0109i tiu tipo.
externalProtocolLaunchBtn=Startigi aplika\u0135on
