<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.1//EN" "http://www.w3.org/TR/xhtml11/DTD/xhtml11.dtd"[
    <!ENTITY % brandDTD SYSTEM "chrome://global/locale/brand.dtd" >
    %brandDTD;
]>

<!-- Original text: Mozilla Help Viewer Documentation Project,
     Nvu relevance changes: Nvu Help Viewer Documentation Project,
Contributor(s):
  KDS Sahambi <ksahambi@yahoo.com>
-->

<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="fr">
<head>
        <title>Glossaire</title>
        <link rel="stylesheet" type="text/css" href="help-fr.css"/>
</head>

<body id="noMarginBody">

<p>Ce glossaire est fourni uniquement pour votre information, et ne doit en aucun cas &ecirc;tre
 consid&eacute;r&eacute; comme une description exhaustive ou de r&eacute;f&eacute;rence pour les termes d&eacute;finis
  ci-dessous, ni en ce qui concerne la s&eacute;curit&eacute; des technologies d&eacute;crites.</p>
<hr/>

<h1 id="glossary">Glossaire</h1>

<dl>

<dt id="Internet_protocol_address">adresse <acronym title="Internet Protocol">IP</acronym>.</dt>
    <dd>L'adresse d'un ordinateur sur un r&eacute;seau 
     <a href="#Transmission_Control_Protocol_Internet_Protocol" class="glossary">TCP/IP</a>. 
     Chaque ordinateur a une seule et unique adresse IP. Un 
     <a href="#client" class="glossary">client</a> peut avoir une adresse IP 
     permanente ou bien elle peut lui &ecirc;tre assign&eacute;e dynamiquement 
     chaque fois qu'il se connecte au r&eacute;seau. Les adresses IP sont 
     compos&eacute;es de 4 nombres entre 0 et 255 s&eacute;par&eacute;s par des
     points. Par exemple comme ceci&nbsp;: 204.171.64.2 .</dd>
    
<dt id="cryptographic_algorithm">algorithme de cryptographie</dt>
<dd>Un ensemble de r&egrave;gles ou directives utilis&eacute;es pour 
 g&eacute;n&eacute;rer des op&eacute;rations de chiffrement comme le 
 <a href="#encryption" class="glossary">chiffrement</a> ou le 
 <a href="#decryption" class="glossary">d&eacute;chiffrement</a>. 
 Parfois appel&eacute; <em>code</em>.</dd>

<dt id="authentication">authentification</dt>
<dd>L'utilisation d'un mot de passe, certificat, num&eacute;ro d'identification personnel
  (<acronym title="Personal Identification Number">PIN</acronym>) ou toute autre information pour certifier une identit&eacute; sur un r&eacute;seau 
  informatique.</dd>
  
<dt id="password-based_authentication">authentification &agrave; mot de passe</dt>
<dd>Identification priv&eacute;e au moyen d'un nom et d'un mot de passe. Voir 
  aussi <a href="#authentication" class="glossary">authentification</a>.</dd>

<dt id="Status_Bar">Barre d'&eacute;tat</dt>
<dd>La barre d'outils situ&eacute;e en bas de la fen&ecirc;tre de votre navigateur. 
  Elle inclut les ic&ocirc;nes de notification &agrave; gauche (popups, feuilles
  de style, informations de s&eacute;curit&eacute;) et &agrave; droite (mises &agrave; 
  jour).</dd>

<dt id="navigation_toolbar">Barre d'outils de navigation</dt>
<dd>La barre d'outils situ&eacute;e vers le haut de votre navigateur qui contient les boutons Suivant et Pr&eacute;c&eacute;dent.</dd>

<dt id="cache">cache</dt>
<dd>Une collection de pages Web enregistr&eacute;es sur le disque dur de votre ordinateur ou dans la m&eacute;moire vive (RAM). Votre navigateur accumule ces copies lorsque vous surfez sur Internet. Quand vous cliquez sur un lien ou tapez une <a href="#Uniform_Resource_Locator" class="glossary">URL</a> pour aller sur une page Web qui se trouve d&eacute;j&agrave; dans le cache, votre navigateur compare la copie mise en cache et l'original. Si rien n'a chang&eacute;, votre navigateur utilise la copie mise en cache plut&ocirc;t que de rechercher l'original, r&eacute;duisant ainsi le temps de t&eacute;l&eacute;chargement.</dd>

<dt id="certificate">certificat</dt>
<dd>&Eacute;quivalent d'une carte d'identit&eacute;. Un certificat sp&eacute;cifie le nom d'un individu, d'une soci&eacute;t&eacute;, ou d'une autre entit&eacute; et certifie qu'une cl&eacute; publique, qui est incluse dans le certificat, appartient bien &agrave; cette entit&eacute;. Quand vous signez num&eacute;riquement un message ou une autre donn&eacute;e, la signature num&eacute;rique pour ce message est cr&eacute;&eacute;e &agrave; l'aide de la cl&eacute; priv&eacute;e correspondant &agrave; la cl&eacute; publique de votre certificat. Un certificat provient et est sign&eacute; num&eacute;riquement par une autorit&eacute; de certification (AC). La validit&eacute; d'un certificat peut &ecirc;tre v&eacute;rifi&eacute;e en regardant la <a href="#digital_signature" class="glossary">signature num&eacute;rique</a> de l'AC. Aussi appel&eacute; identit&eacute; num&eacute;rique, passeport digital, certificat de cl&eacute; publique, certificat X.509, et certificat de s&eacute;curit&eacute;.</dd>

<dt id="object-signing_certificate">certificat de signature d'objet</dt>
<dd>Un certificat dont la cl&eacute; priv&eacute;e correspondante est utilis&eacute;e pour signer les objets tel que des fichiers. Voir aussi <a href="#object_signing" class="glossary">objet sign&eacute;</a>.</dd>

<dt id="encryption">chiffrement</dt>
<dd>Processus pour chiffrer des informations dans le but de masquer son sens. Par exemple, les connexions chiffr&eacute;es entre des ordinateurs rendent la t&acirc;che tr&egrave;s dure &agrave; une tierce personne qui voudrait d&eacute;chiffrer ou <em>d&eacute;coder</em> l'information qui circule. Une information chiffr&eacute;e ne peut &ecirc;tre d&eacute;chiffr&eacute;e que si quelqu'un poss&egrave;de la bonne cl&eacute;.</dd>

<dt id="private_key">clef priv&eacute;e</dt>
<dd>Une des cl&eacute;s de la paire utilis&eacute;e dans la cryptographie &agrave; cl&eacute; publique. La cl&eacute; priv&eacute;e est gard&eacute;e secr&egrave;te et utilis&eacute;e pour d&eacute;chiffrer les donn&eacute;es qui ont &eacute;t&eacute; chiffr&eacute;e avec la cl&eacute; publique correspondante.</dd>

<dt id="client">client</dt>
<dd>Logiciel (le navigateur en est un) qui envoie des requ&ecirc;tes et re&ccedil;oit des informations vers/depuis un <a href="#server" class="glossary">serveur</a>, qui est en g&eacute;n&eacute;ral en fonction sur un autre ordinateur. Un ordinateur sur lequel un logiciel client tourne est aussi appel&eacute; client.</dd>

<dt id="cipher">code</dt>
<dd>Voir <a href="#cryptographic_algorithm">algorithme de cryptographie</a>.</dd>

<dt id="implicit_consent">consentement implicite</dt>
<dd>Aussi connu sous le nom de consentement automatique ou <q>opt-out</q>. D&eacute;finit les configurations priv&eacute;es qui devraient permettre aux sites Web de r&eacute;cup&eacute;rer des informations sur vous (par exemple au moyen de cookies ou de formulaires en ligne) &agrave; moins que vous choisissiez explicitement de ne pas donner votre consentement en l'indiquant sur une page du site Web pr&eacute;vue &agrave; cette effet. Votre consentement ne devrait pas &ecirc;tre requis quand l'information est bien r&eacute;cup&eacute;r&eacute;e.</dd>

<dt id="cryptography">cryptographie</dt>
<dd>L'art et la mani&egrave;re de coder (chiffrer) et d&eacute;coder (d&eacute;chiffrer) l'information. Par exemple, les techniques de cryptographie sont utilis&eacute;es pour coder et d&eacute;coder des informations qui circulent entre un site Web commercial et votre navigateur.</dd>

<dt id="css"><acronym title="Cascading Style Sheets - Feuilles de style en cascade">CSS</acronym></dt>
<dd>Les CSS sont un moyen simple d'ajouter des styles, par exemple des polices, des couleurs, etc &eacute; un document Web. Les CSS permettent un contr&ocirc;le complet et total sur l'apparence d'un document hypertext.</dd>

<dt id="decryption">d&eacute;chiffrement</dt>
<dd>Le processus pour d&eacute;chiffrer des donn&eacute;es qui ont &eacute;t&eacute; chiffr&eacute;es. Voir aussi <a href="#encryption" class="glossary">chiffrement</a>.</dd>

<dt id="eavesdropping">espionnage</dt>
<dd>Interception d'informations envoy&eacute;es &agrave; travers un r&eacute;seau par une entit&eacute; pour laquelle l'information n'&eacute;tait pas destin&eacute;e.</dd>

<dt id="FIPS_PUBS_140-1">FIPS PUBS 140-1</dt>
<dd>Le Standard F&eacute;d&eacute;ral de Publications d'Informations (Federal Information Processing Standards Publications) est un standard du gouvernement am&eacute;ricain pour la mise en &oelig;uvre de modules de cryptographie - c'est un mat&eacute;riel ou un logiciel qui chiffre et d&eacute;chiffre des donn&eacute;es ou ex&eacute;cute d'autres op&eacute;rations de chiffrement (comme cr&eacute;er ou v&eacute;rifier des signatures num&eacute;riques). Beaucoup de produits vendus au gouvernement am&eacute;ricain doivent se soumettre &agrave; l'un ou plusieurs standards FIPS.</dd>

<dt id="File_Transfer_Protocol"><acronym title="File Transfer Protocol - Protocole de Transfert de Fichier">FTP</acronym>.</dt>
<dd>Un protocol qui permet &agrave; un utilisateur de transf&eacute;rer des fichiers d'un ordinateur &agrave; un autre via un r&eacute;seau. Un ordinateur distant, le serveur FTP, accepte des connexions depuis d'autres ordinateurs appel&eacute;s clients. Une fois la connexion &eacute;tablie, les clients peuvent prendre ou d&eacute;poser des fichiers sur le serveur en fonctions de leurs droits d'acc&egrave;s. Cependant, un des d&eacute;fauts du FTP est de transmettre les mots de passes en clair, contrairement au <a href="#secure_file_transfert_protocol">sFTP</a>. Le Gestionnaire de sites de &brandShortName; utilise le protocole FTP pour publier les pages Web.</dd>

<dt id="Form_Manager">Gestionnaire de formulaires</dt>
<dd>La partie de votre navigateur qui vous permet de sauver les donn&eacute;es personnelles que vous entrez dans les formulaires en ligne, comme vos nom, adresse, num&eacute;ro de t&eacute;l&eacute;phone, etc. Ainsi, lorsqu'un site Web a un formulaire, le Gestionnaire de formulaires le remplit automatiquement.</dd>

<dt id="Password_Manager">Gestionnaire de mots de passe</dt>
<dd>La partie de votre navigateur qui vous aide &agrave; retenir certains ou tous vos noms d'utilisateur et mots de passe en les enregistrant sur votre disque dur, et qui les entre &agrave; nouveau automatiquement quand vous revisitez ces sites.</dd>

<dt id="site_manager">Gestionnaire de sites</dt>
<dd>La partie de &brandShortName; qui s'occupe de d&eacute;poser et de t&eacute;l&eacute;charger les documents Web cr&eacute; avec &brandShortName;. Le Gestionnaire de sites utilise le protocole 
<a href="#file_transfer_protocol">FTP</a> pour transf&eacute;rer les documents Web depuis et vers le
<a href="#web_server">serveur Web</a>.</dd>

<dt id="Hypertext_Markup_Language"><acronym title="Hypertext Markup Language">HTML</acronym>.</dt>
    <dd>Le format de document utilis&eacute; pour les pages Web. Le standard HTML d&eacute;finit les balises, ou les codes utilis&eacute;s pour d&eacute;finir la disposition des textes, polices, styles, images, et tous les autres &eacute;l&eacute;ments qui font une belle page Web.</dd>

<dt id="digital_ID">Identit&eacute; num&eacute;rique</dt>
<dd>Voir <a href="#certificate">certificat</a>.</dd>

<dt id="IMAP_glossary"><acronym title="Internet Message Access Protocol - Protocole d'Acc&egrave;s pour les Messages Internet">IMAP</acronym>.</dt>
    <dd>Un standard de serveur de courrier qui vous permet de conserver vos messages et toutes les modifications sur le serveur plut&ocirc;t que sur votre ordinateur. Utiliser l'IMAP plut&ocirc;t que le <a href="#POP_glossary" class="glossary">POP</a> prend moins de place sur le disque et vous permet d'acc&eacute;der &agrave; tout le contenu de votre bo&icirc;te aux lettres, y compris les dossiers courriers envoy&eacute;s, brouillons, etc. depuis n'importe quel endroit. Utiliser un serveur IMAP avec un modem est en g&eacute;n&eacute;ral plus rapide que d'utiliser un serveur POP, puisque vous ne commencez &agrave; t&eacute;l&eacute;charger que l'en-t&ecirc;te des messages. Les Fournisseurs d'Acc&egrave;s Internet (FAI) ne supportent pas tous l'IMAP.</dd>

<dt id="Internet">Internet</dt>
<dd>Un r&eacute;seau mondial de millions d'ordinateurs qui communiquent entre eux en utilisant des protocoles standards comme le <a href="#Transmission_Control_Protocol_Internet_Protocol" class="glossary">TCP/IP</a>. D&eacute;velopp&eacute; &agrave; l'origine pour l'arm&eacute;e am&eacute;ricaine en 1969, Internet s'est agrandi gr&acirc;ce &agrave; la recherche et l'&eacute;ducation, et vers la fin des ann&eacute;es 1990, ce sont des millions de gens qui utilisent Internet. Aujourd'hui Internet est utilis&eacute; pour le courrier &eacute;lectronique, pour naviguer sur le <a href="#World_Wide_Web" class="glossary">World Wide Web</a>, la messagerie instantan&eacute;e, les forums, et beaucoup d'autres choses.</dd>

<dt id="Java">Java</dt>
<dd>Un langage de programmation d&eacute;velopp&eacute; par Sun Microsystems. Un programme en Java peut tourner sur diff&eacute;rents types d'ordinateurs, &eacute;vitant ainsi aux programmeurs de devoir cr&eacute;er des versions s&eacute;par&eacute;es du programme pour chaque type d'ordinateur. Votre navigateur peut automatiquement t&eacute;l&eacute;charger et lancer des programmes Java (aussi appel&eacute;s applets).</dd>

<dt id="JavaScript">JavaScript</dt>
<dd>Un langage &eacute;crit utilis&eacute; couramment pour construire des pages Web. Les programmeurs utilisent le JavaScript pour cr&eacute;er des pages Web plus interactives; par exemple, pour afficher des formulaires et des boutons. Le JavaScript peut &ecirc;tre utilis&eacute; avec le Java, mais techniquement, c'est un langage s&eacute;par&eacute;s. Java n'est pas n&eacute;cessaire &agrave; JavaScript.</dd>

<dt id="XML">Langage <acronym title="Extensible Stylesheet Language Transformation">XML</acronym>.</dt>
<dd>Un standard libre pour d&eacute;crire des donn&eacute;es. Contrairement &agrave; HTML, XML permet au d&eacute;veloppeur d'une page Web de d&eacute;finir ses propres balises. Pour plus d'information, voir le document du W3C en ligne <a href="http://www.w3.org/XML/" hreflang="en" target="_blank">Extensible Markup Language (XML)</a>.</dd>

<dt id="XSLT">langage <acronym title="Extensible Stylesheet Language Transformation">XSLT</acronym>.</dt>
<dd>Langage de Transformation d'Extension de feuille de Style Un langage utilis&eacute; pour convertir un document XML en un autre document XML ou dans un autre format.</dd>

<dt id="LDAP_glossary"><acronym title="Lightweight Directory Access Protocol">LDAP</acronym>.</dt>
    <dd>Un protocole standard pour des services d'acc&egrave;s de r&eacute;pertoires, comme des carnets d'adresses, sur toutes sortes de plates-formes. Vous pouvez configurer votre navigateur pour qu'il acc&egrave;de &agrave; un r&eacute;pertoire LDAP depuis le carnet d'adresses. Vous pouvez aussi faire en sorte que Courrier et Forums de discussion utilise un r&eacute;pertoire LDAP pour compl&eacute;ter automatiquement les adresses &eacute;lectroniques.</dd>

<dt id="master_password">mot de passe principal</dt>
<dd>Un mot de passe utilis&eacute; pour prot&eacute;ger vos mots de passe
  enregistr&eacute;s et autres donn&eacute;es priv&eacute;es. Votre navigateur
  demandera votre mot de passe principal quand vous souhaitez acc&eacute;der
  &agrave; ces donn&eacute;es. Si vous avez plusieurs
  p&eacute;riph&eacute;riques de s&eacute;curit&eacute;, chacun d'eux
  n&eacute;cessitera un mot de passe principal s&eacute;par&eacute;.</dd>

<dt id="search_engine">moteur de recherche</dt>
<dd>Un programme du Web qui permet aux utilisateurs de chercher et retrouver des informations du World Wide Web. Le moteur de recherche peut chercher dans le contenu d'un document Web ou dans une liste de mots-cl&eacute;s, ou utiliser des annuaires qui regroupent les documents Web et leur index manuellement pour la recherche. Typiquement, l'utilisateur tape un mot ou une phrase, aussi appel&eacute; requ&ecirc;te, dans une bo&icirc;te de recherche, et le moteur de recherche affiche les liens des pages Web appropri&eacute;es.</dd>

<dt id="distinguished_name">nom distinct</dt>
<dd>(En anglais&nbsp;: distinguished name (DN) ) Un nom format&eacute; d'une fa&ccedil;on particuli&egrave;re qui identifie de mani&egrave;re unique l'objet d'un certificat.</dd>

<dt id="object_signing">objet sign&eacute;</dt>
<dd>Une technologie qui permet aux d&eacute;veloppeurs de logiciels de signer le code Java, les scripts JavaScript, ou quelque autre type de fichier, et permet aux utilisateurs d'identifier le signataire.</dd>
    
<dt id="web_page">page Web</dt>
<dd>Un simple document du World Wide Web qui est d&eacute;crit par une adresse unique ou une URL et qui peut contenir du texte, des liens hypertexte, ou des graphiques.</dd>

<dt id="PKCS_11"><acronym title="Public Key Cryptography Standard">PKCS</acronym> #11.</dt>
    <dd>Le standard de cryptographie &agrave; cl&eacute; publique qui r&eacute;git les p&eacute;riph&eacute;riques de s&eacute;curit&eacute; comme les cartes &agrave; puce.</dd>

<dt id="platform_for_privacy_preferences">plate-forme pour les pr&eacute;f&eacute;rences de confidentialit&eacute; <acronym title="Platform for Privacy Preferences">P3P</acronym>.</dt>
    <dd>(En anglais&nbsp;: Platform for Privacy Preferences (P3P) ) Un standard publi&eacute; par le Consortium du World Wide Web (W3C) cr&eacute;&eacute; pour aider les utilisateurs &agrave; avoir plus de contr&ocirc;le sur les informations personnelles des sites Web qu'ils visitent. Pour plus d'informations sur le standard en lui-m&ecirc;me, voir le document en ligne (en anglais) <a href="http://www.w3.org/P3P/" hreflang="en" target="_blank">P3P Public Overview</a>.</dd>

<dt id="plug-in">plugin.</dt>
    <dd>Un type d'<a href="#helper_application" class="glossary">utilitaire</a> qui ajoute des capacit&eacute;s &agrave; votre navigateur, comme lire des clips audio ou vid&eacute;o. Contrairement &agrave; d'autres utilitaires, un plugin s'installe dans le r&eacute;pertoire Plugins du r&eacute;pertoire d'installation du navigateur et peut &ecirc;tre ouvert directement par le navigateur. Par exemple, un plugin audio permet d'&eacute;couter de la musique d'une page Web ou d'un message &eacute;lectronique. Macromedia Flash Player et Java sont deux exemples de plugins.</dd>

<dt id="POP_glossary"><acronym title="Post Office Protocol - Protocole de Postage">POP</acronym>.</dt>
    <dd>Un protocole standard pour les serveurs de courrier qui vous oblige de t&eacute;l&eacute;charger les nouveaux messages sur votre ordinateur local &mdash; bien que vous puissiez laisser une copie des messages sur le serveur. Avec le POP, vous ne pouvez stocker vos messages, ainsi que les messages envoy&eacute;s, brouillons, et autres dossiers en tout genre, que sur votre ordinateur local. En revanche, l'<a href="#IMAP_glossary" class="glossary">IMAP</a> vous permet de conserver vos messages et toute modification sur le serveur, accessible depuis n'importe quel ordinateur. La plupart des Fournisseurs d'Acc&egrave;s Internet (FAI) supportent actuellement le POP.</dd>

<dt id="proxy">proxy</dt>
<dd>Un programme interm&eacute;diaire qui agit comme <a href="#server" class="glossary">serveur</a> et comme <a href="#client" class="glossary">client</a> dans le but d'envoyer des requ&ecirc;tes &agrave; la place d'autres clients.</dd>

<dt id="publish">Publication</dt>
<dd>L'op&eacute;ration de d&eacute;poser des documents Web sur un <a
href="#web_server">serveur Web</a> est appel&eacute; publication. Ce n'est qu'une fois que les documents Web ont &eacute;t&eacute; publi&eacute;s sur le <a href="#web_server">serveur Web</a>
que les autres personnes pourront voir ces documents en utilisant leurs <a
href="#client">clients</a>. Dans &brandShortName;, le <a
href="#site_manager">Gestionnaire de sites</a> vous permet de publier vos documents.</dd>

<dt id="server">serveur</dt>
<dd>Logiciel (comme les logiciels qui envoient les pages Web) qui re&ccedil;oit des requ&ecirc;tes et envoie des informations &agrave; un <a href="#client" class="glossary">client</a>, qui tourne en g&eacute;n&eacute;ral sur un autre ordinateur. Un ordinateur qui fait tourner un logiciel serveur est aussi appel&eacute; serveur lui-m&ecirc;me.</dd>

<dt id="web_server">Serveur Web</dt>
<dd>Un serveur Web est un ordinateur faisant fonctionner un logiciel serveur Web (par exemple <a
href="http://httpd.apache.org">Apache</a>). Il d&eacute;livre des documents Web vari&eacute;s vers
un <a href="#client">client</a>. C'est le logiciel serveur Web qui a la responsabilit&eacute;
de nous envoyer les donn&eacute;es requises pour que l'on puisse voir
le <a href="#web_site">site Web demand&eacute;</a> dans un navigateur Web.</dd>

<dt id="secure_shell_file_transfer_protocol"><acronym title="Secure Shell File Transfer Protocol">sFTP</acronym></dt>
<dd>Le sFTP est similaire au <a
href="#file_transfer_protocol">FTP</a> &agrave; la diff&eacute;rence que les sessions sont chiffr&eacute;es pour le rendre plus s&ucirc;r.</dd>

<dt id="digital_signature">signature num&eacute;rique</dt>
<dd>Un code cr&eacute;&eacute; &agrave; partir des donn&eacute;es &agrave; signer et de la cl&eacute; priv&eacute;e du signataire. Ce code est unique est d&eacute;pend de chaque donn&eacute;e. La moindre modification du message change la signature num&eacute;rique du message. Une validation de votre signature num&eacute;rique par le logiciel ad&eacute;quat fournit non seulement la preuve que vous avez bien accept&eacute; la transaction ou le message, mais aussi que la preuve que aucune donn&eacute;e n'a &eacute;t&eacute; modifi&eacute;e depuis que vous l'avez sign&eacute;. Une signature num&eacute;rique n'a aucun rapport avec une signature manuelle, bien qu'elles puissent parfois &ecirc;tre utilis&eacute;es &agrave; des fins identiques.</dd>

<dt id="web_site">site Web</dt>
<dd>Un groupe de pages Web de sujet commun, reli&eacute;es par des liens hypertexte et g&eacute;r&eacute;e par une compagnie, soci&eacute;t&eacute;, ou un individu. Un site Web peut contenir du texte, des graphiques, des fichiers audio et vid&eacute;o, et des liens vers d'autres sites Web.</dd>

<dt id="SSL">SSL</dt>
<dd>Voir <a href="#Secure_Sockets_Layer">Secure Sockets Layer (SSL)</a>.</dd>

<dt id="Secure_Sockets_Layer"><acronym title="Secure Sockets Layer - couche de socket s&eacute;curis&eacute;">SSL</acronym>.</dt>
    <dd>Un protocole qui permet des authentifications mutuelles entre un <a href="#client" class="glossary">client</a> et un <a href="#server" class="glossary">serveur</a> dans le but d'&eacute;tablir une connexion authentifi&eacute;e et chiffr&eacute;e. Le SSL marche avec TCP/IP, HTTP, LDAP, IMAP, NNTP, et d'autres protocoles de haut niveau. Le nouveau standard <acronym title="Internet Engineering Task Force">IETF</acronym> appel&eacute; <acronym title="Transport Layer Security - S&eacute;curit&eacute; de couche de transport">TLS</acronym> est bas&eacute; sur le SSL. Voir aussi <a href="#authentication" class="glossary">authentification</a>, <a href="#encryption" class="glossary">chiffrement</a>.</dd>

<dt id="TCP_IP">TCP</dt>
<dd>Voir <a href="#Transmission_Control_Protocol_Internet_Protocol">Transmission
  Control Protocol/Internet Protocol (TCP/IP)</a>.</dd>

<dt id="Transmission_Control_Protocol_Internet_Protocol"><acronym title="Transmission Control Protocol/Internet Protocol - Protocole de Contr&ocirc;le de Transmission/Protocole Internet">TCP/IP</acronym>.</dt>
    <dd>Un protocole Unix utilis&eacute; pour connecter des ordinateurs tournant sur les syst&egrave;mes d'exploitation vari&eacute;s. Le TCP/IP est un des protocoles Internet essentiel et est devenu un standard global.</dd>

<dt id="TLS">TLS</dt>
<dd>Voir <a href="#Secure_Sockets_Layer">Secure Sockets Layer (SSL)</a>.</dd>

<dt id="Uniform_Resource_Locator"><acronym title="Uniform Resource Locator - Rep&egrave;re de Ressource Uniforme">URL</acronym>.</dt>
    <dd>L'adresse standardis&eacute;e qui indique &agrave; votre navigateur comment localiser un fichier ou une autre donn&eacute;es sur le Web. Par exemple: <tt>http://www.mozilla.org.</tt> Vous pouvez entrer des URL dans la barre de location du navigateur pour atteindre des pages Web. Les URL sont aussi utilis&eacute;es dans les liens des pages Web o&ugrave; vous pouvez cliquer pour vous rendre sur une autre page Web. Aussi appel&eacute;e Adresse Internet ou Adresse Web.</dd>

<dt id="helper_application">utilitaire</dt>
<dd>Une application utilis&eacute;e pour ouvrir ou voir des fichiers t&eacute;l&eacute;charg&eacute;s par le navigateur. Un <a href="#plug-in" class="glossary">plugin</a> est un utilitaire particulier qui s'installe de lui-m&ecirc;me dans le r&eacute;pertoire Plugins du r&eacute;pertoire d'installation du navigateur et peut &ecirc;tre ouvert directement par le navigateur. Microsoft Word, Adobe Photoshop, et d'autres application externes sont consid&eacute;r&eacute;s comme des utilitaires mais ce ne sont pas des plugins, car ils ne s'installent pas dans le r&eacute;pertoire du navigateur, mais ils peuvent &ecirc;tre ouverts via la bo&icirc;te de dialogue de t&eacute;l&eacute;chargement.</dd>

<dt id="w3c">W3C</dt>
<dd>Le World Wide Web Consortium (W3C) est un <em>consortium</em> qui
publie des recommandations sur les standards du <a
href="world_wide_web">World Wide Web</a>. Selon le 
<strong>W3C</strong>, <q>The World Wide Web Consortium (W3C) develops
interoperable technologies (specifications, guidelines, software, and
tools) to lead the Web to its full potential</q>. Ces recommandations,
par exemple HTML 4.01, XHTML 1.1, CSS 2.1, etc sont souvent appel&eacute;es <em>Standards Web</em>.</dd>

<dt id="world_wide_web">World Wide Web</dt>
<dd>Aussi appel&eacute; Web (tout court). Une partie d'Internet qui est compos&eacute;e des pages Web stock&eacute;es sur les <a href="#server" class="glossary">serveurs</a> et affich&eacute;es par les <a href="#client" class="glossary">clients</a> appel&eacute;s navigateur.</dd>

</dl>

<p>
[&nbsp;<a href="#glossary">Retour au d&eacute;but du glossaire</a>&nbsp;]
</p>

<div class="copyrightBox"><em>14 ao&ucirc;t 2004</em></div>
<p>Copyright &copy; 2003-2004 Contributeurs du Projet Mozilla Help Viewer.</p>
    <!--begin frenchmozilla signature-->
  <p><em>Derni&egrave;re traduction&nbsp;: 6 septembre 2004 (bas&eacute;e sur la traduction de mozilla)</em></p>
  <p>Ce texte a &eacute;t&eacute; traduit et adapt&eacute; par une &eacute;quipe internationale de b&eacute;n&eacute;voles francophones.<br />
     Pour plus d'informations, visitez notre site&nbsp;: <a href="http://www.frenchmozilla.org" hreflang="fr" target="_blank">http://www.frenchmozilla.org</a>.</p>
    <!--end frenchmozilla signature-->
</body>
</html>
