<?xml version="1.0" encoding="UTF-8"?> <!DOCTYPE html PUBLIC
"-//W3C//DTD XHTML 1.1//EN"
"http://www.w3.org/TR/xhtml11/DTD/xhtml11.dtd"[
<!ENTITY % brandDTD SYSTEM "chrome://global/locale/brand.dtd" >
%brandDTD; ] >

<html xmlns="http://www.w3.org/1999/xhtml"> <head>
<title>Webseitenerstellung mit &brandShortName;</title>
<link rel="stylesheet" type="text/css" href="chrome://help/skin/helpFileLayout.css"/>
</head>

<body>

<h1 id="publishing_web_pages_with_nvu">Publizieren Ihrer Seite im Web</h1>

<p>Wenn Ihre Webseite nur auf Ihrer lokalen Festplatte liegt, kann Sie von
      niemandem au&#223;er Ihnen gelesen werden. &brandShortName; unterst&#252;tzt Sie beim
      Publizieren (ver&#246;ffentlichen) Ihrer Seite auf einem sogenannten
      Webserver.
</p>

<p>Wenn Sie Ihre Seite auf einem Webserver publizieren, kopiert &brandShortName;
      Ihre Seiten auf einen Computer, auf dem auch andere Ihre Seiten ansehen
      k&#246;nnen (sog. <q>Upload</q>). Um einen Webserver f&#252;r die Publikation
      Ihrer Seiten zu finde, fragen Sie Ihren Internet Service Provider oder
      Ihren Systemadministrator.
</p>

<div id="contentsBox">In diesem Abschnitt:
 <ul>
   <li><a href="#publishing_a_document">Ein Dokument publizieren</a></li>
   <li><a href="#publishing_settings">Publizierungs Einstellungen</a></li>
   <li><a href="#solving_common_publishing_problems">L&#246;sen allgemeiner
          Probleme beim Publizieren</a></li>
 </ul>
 </div>

<h2 id="publishing_a_document">Ein Dokument publizieren</h2>

<p>Um ein Dokument auf einem Webserver zu publizieren:</p>

<ol>
  <li>&#246;ffnen Sie das HTML-Dokument, das Sie publizieren wollen, oder legen
        Sie ein neues &brandShortName;-Dokument an.
  </li>

  <li>Wenn Sie bereit sind dieses Dokument zu publizieren, klicken Sie auf
        den <q>Publizieren</q>-Button in der Statusleiste. 
  <p>Wenn Sie dieses Dokument bereits einmal publiziert haben, sind die
          daf&#252;r notwendigen Einstellungen &brandShortName; bereits bekannt und
          beginnt sofort mit dem Publizieren. W&#228;hrend dieses Prozesses wird
          eine Status-Anzeige eingeblendet.
  </p>

  <ul>
    <li>Fall Sie noch keinen Publizierungsort f&#252;r dieses Dokument
            festgelegt haben, fordert Sie &brandShortName; im Tab
            <q>Einstellungen</q> im Dialog <q>Seite publizieren</q>
            auf, die notwendigen Einstellungen vorzunehmen, siehe auch <a href=
            "#publish_page_settings"><q>Seite publizieren -
            Einstellungen</q></a>. Wenn Sie alle geforderten Einstellungen
            gemacht haben klicken Sie auf <q>Publizieren</q>
    </li>

    <li>Falls Sie das Dokument noch nicht gespeichert haben, zeigt Ihnen
            &brandShortName; den Tab <q>Publizieren</q> des Dialogs
            <q>Seite publizieren</q>, damit Sie einen Dateinamen eingeben
            k&#246;nnen, siehe auch <a href="#publish_page_publish">Seite
            publizieren - Publizieren</a>. Nachdem Sie einen Dateinamen
            vergeben haben klicken Sie auf <q>Publizieren</q>
    </li>
  </ul>
  </li>
  
  <li>Um Ihre Seite anzusehen, klicken Sie auf den Vorschau Button in der
        Symbolleiste. Testen Sie die Links auf der Seite und stellen Sie
        sicher, da&#223; alle Bilder vorhanden sind.</li>

  <li>Bearbeiten Sie die Seite je nach Bedarf weiter. Wenn Sie fertig sind,
        klicken Sie auf den Button <q>Publizieren</q>.</li>
</ol>

<p>Wenn Sie das Dokument das erste mal publizieren, &#228;ndert &brandShortName; alle
      <tt>file:///</tt>-Links zu <tt>http://</tt>-Links um anzuzeigen, da&#223; Sie
      jetzt eine publizierte Seite bearbeiten. Wenn Sie das Dokument lokal
      abspeichern wollen, klicken Sie auf den <q>Speichern</q>-Button. Nun
      werden Sie nach einem Dateinamen und dem Speicherort des Dokuments
      gefragt.
</p>

<p class="returnToSection">[ <a
href="#publishing_a_document">Zur&#252;ck zum Beginn des
      Abschnitts</a> ]</p>

<h3 id="avoiding_broken_links_or_images">Tipps, um kaputte Links und fehlende Bilder zu vermeiden</h3>

<ul>
  <li>&#252;berpr&#252;fen Sie, ob die Dateinamen &brandShortName;-Dateien die Erweiterung
        <q>.html</q> besitzen &#252;berpr&#252;fen Sie, ob die Dateinamen der Bilder
        die Dateiendungen .JPG, .GIF, oder .PNG besitzen. Vermeiden Sie
        Leerzeichen sowie Sonderzeichen in den Dateinamen. Halten Sie
        Dateinamen kurz und verwenden Sie nur Kleinbuchstaben und Zahlen.
  </li>

  <li>Falls Ihre Bilder beim Betrachten Ihrer Webseite als kaputte Links
        erscheinen, &#246;ffnen Sie den Dialog <q>Bildeigenschaften</q> f&#252;r
        jedes Bild (Doppelklick) und &#252;berpr&#252;fen Sie, ob Sie den
        <q><tt>file:///</tt></q>-Teil der URL entfernt haben. Publizieren
        Sie die Seite nach der Korrektur noch einmal.
  </li>
</ul>

<p>F&#252;r mehr Tipps zur Fehlerbeseitigung, sehen Sie unter <a href=
      "#solving_common_publishing_problems"><q>L&#246;sen allgemeiner Probleme
      beim Publizieren</q></a> nach.
</p>

<p class="returnToSection">[ <a
href="#publishing_a_document">Zur&#252;ck zum Beginn des
      Abschnitts</a> ]</p>

<h3 id="updating_a_published_document">Ein publiziertes Dokument aktualisieren</h3>

<p>Um ein bereits publiziertes Dokument zu aktualisieren, folgen Sie diesen
      Anweisungen:</p>

<ol>
  <li>In einem &brandShortName;-Fenster &#246;ffnen Sie das <q>Datei</q>-Men&#252; und w&#228;hlen
        das gew&#252;nschte Dokument aus der <q>Zuletzt benutzen</q>-Liste.
   <p>Alternativ k&#246;nnen Sie auch in einem Browser-Fenster zur gew&#252;nschten
          Seite surfen, indem Sie die Adresse der Seite im Adress-Feld
          eingeben.
   </p></li>
  
  <li>W&#228;hlen Sie nun im <q>Datei</q>-Men&#252; den Punkt <q>Seite
        bearbeiten</q>.</li>

  <li>Bearbeiten Sie das Dokument nach Ihren Vorstellungen.</li>

  <li>Sobald Sie bereit sind die bearbeitete Seite mit Ihren Modifikationen
        upzudaten klicken Sie auf den <q>Publizieren</q>-Button in der
        Symbolleiste.
  </li>
</ol>

<p id="deleting_a_published_page_or_image"><strong>Tipp</strong>: Um eine Seite oder ein Bild das Sie publiziert
      haben umzubenennen oder zu löschen m&#252;ssen Sie ein FTP
      (<strong>F</strong>ile-<strong>T</strong>ransfer-<strong>P</strong>rotokoll)
      Programm benutzen. Falls Sie Unterverzeichnisse anlegen wollen, oder
      Dateien umbenennen, m&#252;ssen Sie ebenfalls ein FTP-Programm benutzen.
      Fragen Sie Ihren Internet-Provider, ob dieser ein spezielles FTP-Programm
      empfiehlt. Informationen &#252;ber FTP-Programme finden Sie &#252;blicherweise auf
      der <q>Hilfe und Support</q>-Sektion auf der Homepage Ihres
      Internet-Providers. FTP-Programme k&#246;nnen auch von Shareware-Seiten wie
      z.B. ZDNet heruntergeladen werden.</p>

<p class="returnToSection">[ <a
href="#publishing_a_document">Zur&#252;ck zum Beginn des
      Abschnitts</a> ]</p>

<h3 id="changing_the_filename_or_publishing_location">Dateinamen oder die Publizierungs-Seite &#228;ndern</h3>

<p>Um den Dateinamen eines Dokuments oder dessen Publikations-Seite zu
      &#228;ndern gehen Sie wie folgt vor:</p>

<ol>
  <li>In einem &brandShortName;-Fenster &#246;ffnen Sie das <q>Datei</q>-Men&#252; und w&#228;hlen
        das gew&#252;nschte Dokument aus der <q>Zuletzt benutzen</q>-Liste.
  <p>Alternativ k&#246;nnen Sie auch in einem Browser-Fenster zur gew&#252;nschten
          Seite surfen, indem Sie die Adresse der Seite im Adress-Feld
          eingeben.
  </p></li>
  
  <li>W&#228;hlen Sie nun im <q>Datei</q>-Men&#252; den Punkt <q>Seite
        bearbeiten</q>.</li>
  
  <li>Bearbeiten Sie das Dokument nach Ihren Vorstellungen.</li>

  <li>W&#228;hlen Sie nun im <q>Datei</q>-Men&#252; den Punkt <q>Publizieren
        als</q>. &brandShortName; wird nun das Publizierungs-Tab im
        Publizierungs-Dialog anzeigen.
  </li>

  <li>Geben Sie den neuen Seiten-Titel ein, wenn Sie diesen &#228;ndern m&#246;chten.</li>

  <li>Geben Sie den neuen Dateinamen ein, wenn Sie diesen &#228;ndern m&#246;chten.</li>

  <li>W&#228;hlen Sie den neuen Speicherort aus Liste der bekannten
        Publizierungs-Ziele. Ist das gew&#252;nschte Ziel nicht in der Liste,
        klicken Sie auf <q>Neue Seite</q>. Mehr Informationen dazu finden
        Sie unter <a href="#publish_page_settings">Publizieren -
        Einstellungen</a>.
  </li>

  <li>Klicken Sie auf den <q>Publizieren</q>-Button um das Dokument an
        der neuen Stelle zu speichern.</li>
</ol>

<p class="returnToSection">[ <a
href="#publishing_a_document">Zur&#252;ck zum Beginn des
      Abschnitts</a> ]</p>

<h3 id="creating_a_new_publishing_site">Eine neue Publizierungs-Site anlegen</h3>

<p>Wenn Sie &#246;fter Dokumente an eine oder mehrere Adressen publizieren,
      k&#246;nnen Sie die Publizierungseinstellungen von &brandShortName; speichern lassen,
      so da&#223; Sie diese nicht jedesmal neu eingeben m&#252;ssen, wenn Sie eine Seite
      publzieren wollen.
</p>

<p>Um einen neue Publizierungs-Seite einzutragen, gehen Sie ausgehend wie folgt vor:
</p>

<ol>
  <li>W&#228;hlen Sie im Men&#252; Bearbeiten den Punkt
        <q>Publikations-Einstellungen</q>. &brandShortName; zeigt Ihnen nun
        den <q>Publizierungs</q>/<q>Eigenschafts</q>-Dialog.
  </li>

  <li>Klicken Sie auf <q>Neue Seite</q>.</li>

  <li>Geben Sie den Seiten-Namen ein, den Sie dieser Adresse zuweisen
        m&#246;chten.

  <p>Wenn Sie z.B. auf der neuen Seite Dokumente bez&#252;glich eines Projekts
          mit dem Titel <q>Meteor</q> ver&#246;ffentlichen, empfiehlt es sich
          der Seite den Namen <q>Meteor</q> zu geben. Damit werden Sie
          durch den Seiten-Titel and den Zweck der dort ver&#246;ffentlichten
          Dokumente erinnert.</p> </li>

  <li>Bei <q>Publikations-Adresse</q> geben Sie die komplette Adresse,
        welche Sie von ihren Internet-Provider, System-Administrator oder
        Web-Hoster bekommen haben. Diese Adresse mu&#223; mit <tt>ftp://</tt> oder
        <tt>http://</tt> beginnen.

  <p>Die <q>Publikations-Adresse</q> bezeichnet den Platz, wo ihre
          Dokumente ver&#246;ffentlicht (hochgeladen) werden. Wenn Sie sich nicht
          sicher sind, fragen Sie ihren System-Administrator oder
          Internet-Provider.</p> </li>

  <li>Bei <q>HTTP-Adresse der Homepage</q> geben Sie die komplette
        Adresse, welche Sie eingeben wenn Sie Ihre Seite im
        Browser betrachten, ein. Verzichten Sie auf Dateinamen
        oder Unterverzeichnisse als Teil der Adresse.


  <p>Diese Adresse mu&#223; mit <tt>http://</tt> beginnen. In manchen F&#228;llen
          ist diese Adresse mit der <q>Publikations-Adresse</q> identisch.
          Wenn Sie sich nicht sicher sind, fragen Sie Ihren Internet-Provider
          oder System-Administrator oder lassen Sie das Feld leer.</p> </li>

  <li>Im Feld <q>Benutzername</q> geben Sie den Usernamen ein, den Sie von
        Ihrem Internet-Provider oder Webhoster bekommen haben.</li>

  <li>Im Feld <q>Passwort</q> geben Sie das Kennwort zu dem zuvor
        eingegebenen Benutzernamen ein.</li>

  <li>W&#228;hlen Sie <q>Passwort speichern</q> um das Passwort im
        Passwort-Manager zu speichern, so da&#223; Sie es nicht jedesmal neu
        eingeben m&#252;ssen, wenn Sie etwas zu dieser Adresse publizieren.</li>

  <li>Klicken Sie auf OK.</li>
</ol>

<p class="returnToSection">[ <a
href="#publishing_a_document">Zur&#252;ck zum Beginn des
      Abschnitts</a> ]</p>

<h3 id="changing_the_default_publishing_site">Die Standard-Publizierungs-Site &#228;ndern</h3>

<p>Wenn Sie mehr als eine Publizierungs-Adresse angelegt haben, aber
      haupts&#228;chlich eine Seite nutzen, k&#246;nnen Sie diese Seite als ihre
      <q>Haupt-Publikations</q>-Adresse ausw&#228;hlen. &brandShortName; wird diese
      Adresse dann f&#252;r alle Publikationen verwenden, es sei den Sie w&#228;hlen eine
      andere Adresse aus.
</p>

<p>Unabh&#228;ngig wie viele Seiten Sie verwenden, k&#246;nnen Sie immer zu anderen
      Adressen publizieren in dem Sie aus dem <q>Datei</q>-Men&#252; den Punkt
      <q>Publizieren als</q> verwenden. Mehr Informationen erhalten Sie
      unter <a href="#changing_the_filename_or_publishing_location">Dateinamen
      oder den Publizierungsort &#228;ndern</a>.
</p>

<p>Um die Standard-Publikations-Adresse zu &#228;ndern, folgen Sie diesen Punkten
      ausgehend vom &brandShortName;-Fenster:
</p>

<ol>
  <li>W&#228;hlen Sie aus dem Men&#252; "Bearbeiten" den Punkt
        <q>Publikations-Einstellungen</q>. &brandShortName; wird dann
        den <q>Puplikations-Einstellungen</q>-Dialog anzeigen.
    </li>

  <li>W&#228;hlen Sie die Seite, welche Ihre neue Standard-Adresse werden soll aus
        der Liste.

  <p>Wenn Sie nur eine Publikations-Adresse besitzen, wird automatisch
          diese als Standard-Publikations-Adresse gesetzt.</p> </li>

  <li>Klicken Sie auf <q>Als Standard ausw&#228;hlen</q>.</li>

<li>Klicken Sie auf OK um Ihre &#228;nderungen zu best&#228;tigen.</li> </ol>

<p class="returnToSection">[ <a
href="#publishing_a_document">Zur&#252;ck zum Beginn des
      Abschnitts</a> ]</p>

<h3 id="deleting_a_publishing_site">Eine Publizierungs-Site l&#246;schen</h3>

<p>L&#246;schen einer Publikations-Seite l&#246;scht alle dieser Publikations-Seite
      zugeordneten Einstellungen in &brandShortName;. Wenn Sie sp&#228;ter erneut etwas zu
      dieser Seite publizieren, m&#252;ssen Sie alle Einstellungen erneut eingeben.
</p>

<p>Um Seiten-Eigenschaften zu l&#246;schen, folgen Sie diesen Punkten ausgehend
      vom &brandShortName;-Fenster:
</p>

<ol>
  <li>W&#228;hlen Sie aus dem Men&#252; "Bearbeiten" den Punkt
        <q>Publikations-Einstellungen</q>. &brandShortName; wird dann
        den <q>Puplikations-Einstellungen</q>-Dialog anzeigen.
  </li>
  
  <li>W&#228;hlen Sie die Seite aus der Liste.</li>
  
  <li>Klicken Sie auf <q>Seite l&#246;schen</q>.
  <p>&brandShortName; l&#246;scht nur die Seiten-Einstellungen; die Seite selbst
          bleibt unber&#252;hrt.</p></li>

  <li>Klicken Sie auf OK um Ihre &#228;nderungen zu best&#228;tigen.</li>
</ol>

<p class="returnToSection">[ <a
href="#publishing_a_document">Zur&#252;ck zum Beginn des
      Abschnitts</a> ]</p>

<h2 id="publishing_settings">Publizierungseinstellungen</h2>

<p>In dieser Sektion werden die Publikations-Einstellungen von &brandShortName;
      beschrieben. Informationen zu den Generellen &brandShortName;-Einstellungen und
      den Einstellungen f&#252;r Neue Seiten finden Sie in der <a href=
      "composer_help.xhtml#composer_preferences"><q>&brandShortName;-Einstellungen</q></a> Sektion.
</p>

<h3 id="publish_page_publish">Seite Publizieren - Publizieren</h3>

<p>Das Publizieren-Tab im Dialog <q>Seite Publizieren</q> erm&#246;glicht es
      Ihnen den Publikations-Ort des aktuellen Dokuments einzutragen. Diese
      Einstellungen gelten nur f&#252;r das aktuelle Dokument.</p>

<p>Wenn Sie das Publizieren-Tab noch nicht ge&#246;ffnet haben, folgen Sie dieser
      Anleitung:</p>

<ol>
  <li>W&#228;hlen Sie aus dem <q>Datei</q>-Men&#252; den Punkt <q>Publizieren
        als</q>. Der Dialog <q>Seite Publizieren</q> wird angezeigt.</li>

  <li>Klicken Sie auf das Publizieren-Tab.</li>
</ol>

<ul> <li><strong>Seitenname:</strong> Liste aller eingetragenen
        Publikations-Seiten, um die Auswahl des Publikations-Ortes zu
        verienfachen. Um eine neue Publikations-Seite anzulegen klicken Sie auf
        <q>Neue Seite hinzuf&#252;gen</q></li>

<li><strong>Seitentitel:</strong> Titel der Seite wie er angezeigt wird,
        wenn Sie die Seite im Browser anzeigen. Der Seitentitel
        wird auch in der Lesezeichen-Liste angezeigt, wenn f&#252;r die Seite ein
        Lesezeichen angelegt wird.</li>

<li><strong>Dateiname:</strong> Geben Sie hier den Dateinamen des Dokuments
        ein. Setellen Sie sicher, da&#223; es die Endung <q>.html</q> oder
        <q>.htm</q> enth&#228;lt.</li>

<li style="list-style-type: none; list-style-position: outside;
    list-style-image: none;"> <p><strong>Warnung</strong>: Sollte das zu publizierende Dokument am
          Server bereits vorhanden sein wird es es automatisch mit der
          aktuelleren Version &#252;berschrieben. Es wird keine Nachfrage zum
          &#252;berschreiben angezeigt.</p> </li>

<li><strong>Unterverzeichnis f&#252;r diese Seite:</strong> Wenn Sie dieses Feld
        leer lassen wird &brandShortName; das Dokument in das angegebene
        Hauptverzeichnis publizieren. Wenn Sie das Dokument in ein
        Unterverzeichnis publizieren m&#246;chten, geben Sie den gew&#252;nschten
        Verzeichnisnamen ein oder w&#228;hlen Sie diesen aus der Liste. Die hier
        eingegebenen Verzeichnisnamen werden von &brandShortName; gespeichert, so da&#223;
        Sie bereits verwendete Verzeichnisnamen aus der Liste w&#228;hlen k&#246;nnen und
        diese nicht erneut eingeben m&#252;ssen. Beachten Sie bei Verzeichnisnamen
        Gro&#223;- und Kleinschreibung.
        </li>

<li style="list-style-type: none; list-style-position: outside;
    list-style-image: none;"> <p><strong>Anmerkung:</strong> Das Unterverzeichnis, welches Sie
          ausgew&#228;hlt haben, mu&#223; am Server bereits existieren.</p>
</li>

<li><strong>Bilder und sonstige Dateien einbinden</strong>: Wenn diese
        Option aktiv ist, werden beim Publizieren alle Dateien auf welche das
        aktuelle Dokument eine Referenz hat mit publiziert. Sie k&#246;nnen w&#228;hlen,
        ob Sie diese Dateien im selben Verzeichnis wie das Dokument oder in ein
        Unterverzeichnis publizieren m&#246;chten.</li>
</ul>

<p><strong>Tipp</strong>: Benutzen Sie ein separates FTP-Programm, wenn Sie
      Verzeichnisse erstellen, umbenennen oder l&#246;schen m&#246;chten oder nicht mehr
      ben&#246;tigte Dateien entfernen m&#246;chten. Fragen Sie Ihren Internet-Provider,
      ob dieser ein spezielles FTP-Programm empfiehlt. Informationen &#252;ber
      FTP-Programme finden Sie &#252;blicherweise auf der <q>Hilfe und
      Support</q>-Sektion auf der Homepage Ihres Internet-Providers.
      FTP-Programme k&#246;nnen auch von Shareware-Seiten wie z.B. ZDNet
      heruntergeladen werden.</p>

<p class="publishing_settings">[ <a
href="#">Zur&#252;ck zum Beginn des
      Abschnitts</a> ]</p>

<h3 id="publish_page_settings">Seite publizieren - Einstellungen</h3>

<p>Das Tab <q>Einstellungen</q> im Seite Publizieren-Dialog erm&#246;glicht
      es Ihnen Login-Informationen &#252;ber die Publikations-Seite und deren
      Publikations-Einstellungen einzugeben. Diese Einstellungen beziehen sich
      nur auf das aktuelle Dokument und andere Dokumente, die Sie auf dieser
      Seite publizieren m&#246;chten.</p>

<p>Wenn Sie das Einstellungen-Tab noch nicht ge&#246;ffnet haben, folgen Sie
      dieser Anleitung:</p>

<ol>
  <li>W&#228;hlen Sie aus dem <q>Datei</q>-Men&#252; den Punkt <q>Publizieren
        als</q>. Der Dialog <q>Seite Publizieren</q> wird angezeigt.</li>

  <li>Klicken Sie auf das Einstellungen - Tab.</li>
</ol>

<ul>
  <li><strong>Seitenname</strong>: Geben Sie den Seiten-Namen ein, den Sie
        dieser Adresse zuweisen m&#246;chten. Dieser Name soll sp&#228;ter dazu dienen
        diesen Publikations-Ort zu identifizieren.</li>

  <li id="host_name_for_publishingSDX"><strong>Publikations-Adresse</strong>: Bezeichnet die komplette
        Adresse, welche Sie von ihren Internet-Provider, System-Administrator
        oder Web-Hoster bekommen haben. Diese Adresse mu&#223; mit <tt>ftp://</tt>
        oder <tt>http://</tt> beginnen.</li>

  <li style="list-style-type: none; list-style-position: outside;
      list-style-image: none;">
    <p>Die <q>Publikations-Adresse</q> bezeichnet den Platz, wo ihre
          Dokumente ver&#246;ffentlicht (hochgeladen) werden. Wenn Sie sich nicht
          sicher sind, fragen Sie ihren System-Administrator oder
          Internet-Provider.
  </p></li>

  <li><strong>HTTP-Adresse der Homepage</strong>: Bezeichnet die komplette
        Adresse, welche Sie eingeben wenn Sie Ihre Seite im
        Browser betrachten. Verzichten Sie auf Dateinamen oder
        Unterverzeichnisse als Teil der Adresse.</li>

  <li style="list-style-type: none; list-style-position: outside;
      list-style-image: none;">
    <p>Diese Adresse mu&#223; mit <tt>http://</tt> beginnen. In manchen F&#228;llen
          ist diese Adresse mit der <q>Publikations-Adresse</q> identisch.
          Wenn Sie sich nicht sicher sind, fragen Sie Ihren Internet-Provider
          oder System-Administrator oder lassen Sie das Feld leer.</p></li>

  <li><strong>Benutzername</strong>: Bezeichnet den Benutzernamen, den Sie eingeben
        m&#252;ssen, wenn Sie sich bei dieser Publikations-Adresse anmelden.</li>

  <li><strong>Passwort</strong>: Bezeichnet das Passwort f&#252;r den oben
        genannten Benutzernamen.</li>

  <li><strong>Passwort speichern</strong>: W&#228;hlen Sie diese Option um das
        Passwort im Passwort-Manager zu speichern, so da&#223; Sie es nicht jedesmal
        neu eingeben m&#252;ssen, wenn Sie etwas zu dieser Adresse publizieren
        m&#246;chten.</li>
</ul>

<p class="returnToSection">[ <a
href="#publishing_settings">Zur&#252;ck zum Beginn des
      Abschnitts</a> ]</p>

<h3 id="publish_settings">Publikations-Einstellungen</h3>

<p>Der Publikations-Einstellungen Dialog erlaubt es Ihnen
      Publikations-Seiten zu erstellen, editieren und zu diese zu l&#246;schen.
      Weiters k&#246;nnen Sie aus diesen auch eine Standard-Publikations-Seite
      w&#228;hlen.</p>

<p>Wenn Sie den Publikations-Einstellungen Dialog noch nicht sehen, befolgen
      Sie diese Anweisungen:</p>

<ol>
  <li>W&#228;hlen Sie <q>Publikations-Einstellungen</q> aus dem "Bearbeiten"-Men&#252;. 
  &brandShortName; wird daraufhin den
        <q>Publikations-Einstellungen</q> - Dialog anzeigen.
  </li>
</ol>

<ul>
  <li><strong>Neue Seite</strong>: Erlaubt es Ihnen eine neue
        Publikations-Seite anzulegen. &brandShortName; wird den Namen der neuen
        Publikations-Seite zu der Liste der verf&#252;gbaren Seiten hinzuf&#252;gen.</li>

  <li><strong>Als Standard ausw&#228;hlen</strong>: Markiert die gew&#228;hlte
        Publikations-Seite zu Ihrer Haupt-Publikations-Seite. Dies ist
        normalerweise jene Adresse zu der Sie am meisten Dokumente publizieren.
        Alle Dokumente, welche Sie erstellen oder bearbeiten werden zu dieser
        Adresse publiziert, es sei den Sie w&#228;hlen eine alternative
        Publikationsseite im Publikations-Dialog.</li>

  <li style="list-style-type: none; list-style-position: outside;
      list-style-image: none;"> <p>Um eine alternative Publikations-Adresse zu w&#228;hlen, w&#228;hlen Sie aus
          dem <q>Datei</q>-Men&#252; den Punkt <q>Publizieren als</q>.</p>
  </li>

  <li><strong>Seite entfernen</strong>: Entfernt die ausgew&#228;hlte Seite und
        deren Einstellungen aus &brandShortName;.</li>

  <li><strong>Seitenname</strong>: Geben Sie den Seiten-Namen ein, den Sie
        dieser Adresse zuweisen m&#246;chten.</li>

  <li><strong>Publikations-Adresse</strong>: Bezeichnet die komplette
        Adresse, welche Sie von ihren Internet-Provider, System-Administrator
        oder Web-Hoster bekommen haben. Diese Adresse mu&#223; mit <tt>ftp://</tt>
        oder <tt>http://</tt> beginnen.</li>

  <li style="list-style-type: none; list-style-position: outside;
      list-style-image: none;"> <p>Die <q>Publikations-Adresse</q> bezeichnet den Platz, wo ihre
          Dokumente ver&#246;ffentlicht (hochgeladen) werden. Wenn Sie sich nicht
          sicher sind, fragen Sie ihren System-Administrator oder
          Internet-Provider.</p>
  </li>

  <li><strong>HTTP-Adresse der Homepage</strong>: Bezeichnet die komplette
        Adresse, welche Sie eingeben wenn Sie Ihre Seite im
        Browser betrachten. Verzichten Sie auf Dateinamen oder
        Unterverzeichnisse als Teil der Adresse.</li>

  <li style="list-style-type: none; list-style-position: outside;
      list-style-image: none;"> <p>Diese Adresse mu&#223; mit <tt>http://</tt> beginnen. In manchen F&#228;llen
          ist diese Adresse mit der <q>Publikations-Adresse</q> identisch.
          Wenn Sie sich nicht sicher sind, fragen Sie Ihren Internet-Provider
          oder System-Administrator oder lassen Sie das Feld leer.</p> </li>

  <li><strong>Benutzername</strong>: Bezeichnet den Benutzernamen, den Sie eingeben
        m&#252;ssen, wenn Sie sich bei dieser Publikations-Adresse anmelden.</li>

  <li><strong>Passwort</strong>: Bezeichnet das Passwort f&#252;r den oben
        genannten Benutzernamen.</li>

  <li><strong>Passwort speichern</strong>: W&#228;hlen Sie diese Option um das
        Passwort im Passwort-Manager zu speichern, so da&#223; Sie es nicht jedesmal
        neu eingeben m&#252;ssen, wenn Sie etwas zu dieser Adresse publizieren
        m&#246;chten.</li>
</ul>

<p>[ <a href="#publishing_settings">Zur&#252;ck zum Beginn des
      Abschnitts</a> ]</p>


<h2 id="solving_common_publishing_problems">L&#246;sen allgemeiner Probleme beim Publizieren</h2>

<p>Sollte das publizieren eines oder mehrer Dateien fehlschlagen, wird in
      der Publikations-Status-Anzeige eine Fehlermeldung angezeigt, welche
      Ihnen helfen kann, was der Fehler ist und wie Sie ihn geseitigen k&#246;nnen.
      Klicken Sie auf den Button <q>Fehlerbehebung</q> in der
      Publikations-Status-Anzeige um Hilfe beim Beheben Ihrer
      Publikations-Fehler zu erhalten.</p>

<p>Sollte es Ihnen trotz allem nicht gelingen eine Datei zu publizieren,
      speichern Sie die Datei auf Ihrer Festplatte, indem Sie aus dem
      <q>Datei</q>-Men&#252; den Punkt <q>Speichern</q> in &brandShortName; w&#228;hlen. Sie
      k&#246;nnen die Datei dann sp&#228;ter wieder &#246;ffnen und erneut versuchen, diese zu
      Publizieren. Um die gespeicherte Datei sp&#228;ter schnell wiederzufinden,
      &#246;ffnen Sie das <q>Datei</q>-Men&#252; von &brandShortName; und w&#228;hlen <q>Zuletzt
      bearbeitete Seiten</q>.
</p>

<h3 id="verifying_your_publishing_settings">&#252;berpr&#252;fen Ihrer Publikations-Einstellungen</h3>

<p>Um Ihre Publikations-Einstellungen zu &#252;berpr&#252;fen:</p>

<ol>
  <li>Schließen Sie die Publikations-Status-Anzeige, sofern diese offen ist.</li>

  <li>W&#228;hlen Sie im Men&#252; "Bearbeiten" den Punkt
        <q>Publikations-Einstellungen</q>.</li>

  <li>Es erscheint der Publikations-Einstellungs-Dialog. Stellen Sie dort
        sicher, da&#223; ihre Einstellungen f&#252;r diese Seite korrekt sind. Wenn Sie
        nicht sicher sind, &#252;berpr&#252;fen Sie es mit ihrem Internet-Provider oder
        Web-Hoster.</li>

  <li style="list-style-type: none; list-style-position: outside;
      list-style-image: none;"> <ul> <li><strong>Stellen Sie sicher, da&#223; Ihre Publikations-Einstellungen
            korrekt sind.</strong> M&#246;glicherweise haben Sie eine der
            Einstellungen falsch eingetippt.</li>

      <li><strong>Stellen Sie sicher, da&#223; die Publikations-Adresse korrekt
            ist.</strong> Internet-Provider oder Web-Hoster k&#246;nnen die
            Publikations-Adresse auch auf ServerName, Hostname oder Server/Host
            verweisen lassen. Sie benutzen oft Adressen wie
            <tt>ftp.myisp.at/username</tt>, wobei <tt>username</tt> Ihrem
            Usernamen entspricht.

      <p>Eine korrekte Publikations-Adresse mu&#223; entweder mit
              <tt>ftp://</tt> oder <tt>http://</tt> beginnen. Die korrekte
              Publikations-Adresse des oben erw&#228;hnten Beispiels w&#228;re demnach
              <tt>ftp://ftp.myisp.at/username</tt>.</p> </li>
      </ul>
  </li>
</ol>

<p class="returnToSection">[ <a
href="#solving_common_publishing_problems">Zur&#252;ck zum Beginn des
      Abschnitts</a> ]</p>

<h3 id="checking_your_filenames">&#252;berpr&#252;fen Ihrer Dateinamen</h3>

<p>&#252;berpr&#252;fen Sie alle Dateinamen, welche bei der Publikation fehlgeschlagen
      sind. Stellen Sie sicher, da&#223; folgende Punkte beachtet werden:</p>

<ul>
  <li>Benutzen Sie nur Nummern, Klein- oder Gro&#223;buchstaben. Es ist zwar
        erlaubt, Dateinamen mit Gro&#223;buchstaben zu erstellen, jedoch k&#246;nnen Sie
        potentielle Fehler beim sp&#228;teren wiederfinden der publizierten Datei
        vermeiden, wenn Sie nur kleinbuchstaben benutzen.

  <p>Wenn Sie Dateien auf einem Webserver ver&#246;ffentlichen, unterscheidet
          dieser meist zwischen Gro&#223;- und Kleinbuchstaben. Dies kann sp&#228;ter zum
          Problem f&#252;hren, da&#223; Sie sich nicht and Dateinamen mit nur
          Gro&#223;buchstaben oder einem Mix aus Gro&#223;- und Kleinbuchstaben erinnern
          k&#246;nnen.</p>

  <p>Wenn Sie z.B. versuchen, eine publizierte Datei im
          Browser zu besuchen, indem Sie die Adresse im
          Adress-Feld eingeben, m&#252;ssen Sie den Dateinamen exakt gleich
          eingeben, wie Sie ihn urspr&#252;nglich angelegt haben, in der selben
          Gro&#223;- und Kleinbuchstaben-Kombination.</p> </li>

  <li>Nutzen Sie keine Punkte oder Leerzeichen. Unterstriche ( _ ) und
        Bindestriche ( - ) sind in Ordnung. Auch auf Umlaute wie &#228;,&#246; oder
        &#223; sollten Sie verzichten.</li>

  <li>Stellen Sie sicher, da&#223; alle &brandShortName;-Dateien die Dateierweiterung
        .html oder .htm haben.
  </li>

  <li>Benutzen Sie nur Dateinamen mit maximal 32 Zeichen.</li>
</ul>

<p class="returnToSection">[ <a
href="#solving_common_publishing_problems">Zur&#252;ck zum Beginn des
      Abschnitts</a> ]</p>

<h3 id="fixing_publishing_errors">Beheben von Publikations-Fehlern</h3>

<p>Sollte das publizieren einer oder mehrer Dateien fehlschlagen, wird in
      der Publikations-Status-Anzeige eine Fehlermeldung angezeigt, welche
      Ihnen helfen kann, was der Fehler ist und wie Sie ihn beseitigen k&#246;nnen.
      Klicken Sie auf den Button <q>Fehlerbehebung</q> in der
      Publikations-Status-Anzeige um Hilfe beim Beheben Ihrer
      Publikations-Fehler zu erhalten.
</p>

<div class="errorMessage"> <p id="file_not_found"><strong>Fehlermeldungen:</strong></p>

<div class="contentsBox" style="background-color: #ebebeb;">
  <tt><var>Dateiname</var> nicht gefunden</tt>
  <p>or</p>
<tt><var>X</var> von <var>Y</var> Dateien
        konnten nicht publiziert werden</tt> </div>

<p><strong>Fehlerbeschreibung:</strong> Eine oder mehrer Bild-Dateien oder
        CSS-Dateien konnten nicht publiziert werden, da &brandShortName; diese
        nicht finden konnte. Typische Gr&#252;nde sind:</p>

<ul>
  <li>Der eingegebene Dateipfad ist falsch.</li>
  
  <li>Der Speicherplatz der Datei im Internet ist nicht erreichbar.</li>

  <li>Der Dateipfad hat sich ge&#228;ndert, die Datei wurde gel&#246;scht oder
          verschoben.</li>
</ul>

<p><strong>L&#246;sungsvorschl&#228;ge:</strong></p>

<ul>
  <li>&#252;berpr&#252;fen Sie die zu publizierende Seite nach ung&#252;ltigen
          Bilddateien. Ung&#252;ltige Bilddateien werden mit diesem Symbol <img src=
          "images/broken.gif" width="20" height="20" alt="" /> auf der Seite
          dargestellt. Um die Adresse der Datei zu korrigieren, doppelklicken
          Sie auf die ung&#252;ltige Bilddatei um den
          <q>Datei</q>/<q>Eigenschafts</q>-Dialog anzuzeigen. Dort k&#246;nnen
          Sie dann die Adresse der Bilddatei korrigieren.
  </li>

  <li>Entfernen Sie das ung&#252;ltige Bild von der Seite, indem Sie das
          ung&#252;ltige Bild ausw&#228;hlen (einmal draufklicken) und anschließend die
          "Entf"-Taste oder die "R&#252;ckstell"-Taste bet&#228;tigen.
  </li>

  <li>Wenn das Bild nicht verf&#252;gbar ist, weil der Server auf dem sich das
          Bild befindet, nicht erreichbar ist, versuchen Sie einige Zeit sp&#228;ter
          nochmal zu publizieren.</li>

  <li>Wenn es sich bei der fehlenden Datei um eine CSS-Datei handelt,
          &#252;berpr&#252;fen Sie, ob die Pfadangabe zu dieser CSS-Datei korrekt ist. Um
          die Pfadangabe zur CSS-Datei in &brandShortName; zu korrigieren, klicken Sie
          auf das <q>HTML-Quelltext</q>-Tab und bearbeiten die Pfadangabe im
          HTML-Quellcode. Sie sollten den HTML-Quellcode nur dann bearbeiten,
          wenn Sie mit den HTML-Tags vertraut sind.
  </li>
</ul> </div>

<div class="errorMessage"> <p id="subdir_not_found"><strong>Fehlermeldung:</strong></p>

<div class="contentsBox" style="background-color: #ebebeb;">
  <tt>Das Unterverzeichnis <var>Verzeichnisname</var> existiert nicht auf
        dieser Seite oder der Dateiname <var>Dateiname</var> ist bereits von
        einem Underverzeichnis verwendet</tt>
  <p>oder</p>
  <tt>Der Dateiname <var>Dateiname</var> wird bereits von einem
        Unterverzeichnis verwendet</tt> </div>

<p><strong>Fehlerbeschreibung:</strong> Sie haben ein Unterverzeichnis
        angegeben, das auf der Publikations-Seite nicht existiert. &brandShortName;
        kann nur in Verzeichnisse publizieren welche bereits existieren. Oder
        Sie haben einen Dateinamen angegeben, der identisch mit dem Namen eines
        bereits vorhandenen Unterverzeichnis.</p>

<p>Beispielsweise im <q>Publizieren</q>-Tab des <q>Seite
        publizieren</q>-Dialogs:</p>

<ul>
  <li>Wurde im Feld <q>Unterverzeichnis f&#252;r diese Seite</q> ein
          Unterverzeichnis angegeben, welches im Publikations-Verzeichnis nicht
          existiert.</li>

  <li>Wurde die Option <q>Bilder und sonstige Dateien einbinden</q>
          aktiviert und ein Verzeichnis angegeben wurde, das im
          Publikations-Verzeichnis nicht existiert.</li>

  <li>eine der Dateien, welche Sie publizieren m&#246;chten hat den selben Namen
          wie ein Unterverzeichnis im Publikations-Verzeichnis.</li>
</ul>

<p><strong>L&#246;sungsvorschl&#228;ge:</strong></p>

<ul>
  <li>Benutzen Sie ein separates FTP-Programm, wenn Sie Verzeichnisse
          erstellen, umbenennen oder l&#246;schen m&#246;chten. Fragen Sie Ihren
          Internet-Provider, ob dieser ein spezielles FTP-Programm empfiehlt.
          Informationen &#252;ber FTP-Programme finden Sie &#252;blicherweise auf der
          <q>Hilfe und Support</q>-Sektion auf der Homepage Ihres
          Internet-Providers. FTP-Programme k&#246;nnen auch von Shareware-Seiten
          wie z.B. ZDNet heruntergeladen werden.</li>

  <li>Benutzen Sie keine Verzeichnis-Namen mit den Endungen
          <q>.html</q> oder <q>.htm</q>. Nur ihre &brandShortName;-Dateien
          sollten die Endung <q>.html</q> oder <q>.htm</q> tragen.
  </li>

  <li>Beachten Sie die Schreibweise der Verzeichnisnamen. Sie m&#252;ssen exakt
          die selbe Schreibweise benutzen mit, welches Sie es erstellen haben.</li>
</ul>
</div>

<div class="errorMessage"> <p id="server_not_found"><strong>Fehlermeldung:</strong></p>

<div class="contentsBox" style="background-color: #ebebeb;">
  <tt>Der Server ist nicht erreichbar. &#252;berpr&#252;fen Sie Ihre
        Internetverbindung und versuchen Sie es nochmal.</tt> </div>

<p><strong>Fehlerbeschreibung:</strong> Dieser Fehler kann viele Ursachen
        haben. Zum Beispiel:</p>

<ul>
  <li>Ihre <q>Publikations-Seiten</q>-Einstellungen sind nicht
          korrekt.</li>

  <li>Ihre Internet-Verbindung wurde unterbrochen.</li>

  <li>Ihr Modem oder Ihr Ger&#228;t, welches Sie zum Verbinden ins
          Internet verwenden, funktioniert nicht korrekt.</li>

  <li>Der Webserver auf welchem Sie versuchen das Dokument zu publizieren
          versuchen ist momentan wegen technischer Probleme oder sonstigen
          unbekannten Ursachen nicht verf&#252;gbar.</li>

  <li>Ihr Internet-Provider oder Webhoster hat technische Probleme.</li>
</ul>

<p><strong>L&#246;sungsvorschl&#228;ge:</strong></p>

<ul>
  <li>Stellen Sie sicher, da&#223; Ihre Publikations-Einstellungen korrekt sind
          und diese korrekt eingetragen sind. Mehr Informationen finden finden
          Sie unter <a href="#verifying_your_publishing_settings">&#252;berpr&#252;fen
          Ihrer Publikations-Einstellungen</a>.
  </li>

  <li>Stellen Sie sicher, da&#223; Ihre Internet-Verbindung funktioniert, indem
          Sie eine Internet-Seite im Browser-Fenster laden.&#252;berpr&#252;fen Sie zum
          Beispiel, da&#223; Sie die Seite <tt>http://www.mozilla.org/</tt> anzeigen
          k&#246;nnen.</li>

  <li>Sollte Ihre Internet-Verbindung nicht funktionieren, &#252;berpr&#252;fen Sie,
          da&#223; alle Hardware, Telefon-Verbindungen, Modems und
          Netzwerk-Verbindungen voll funktionst&#252;chtig sind.</li>

  <li>Benutzen Sie ein Browser-Fenster um die Publikations-Seite
          aufzurufen. Sollten Sie in der Lage sein andere Seiten anzuzeigen,
          diese jedoch nicht, hat ihr Internet-Provider oder Webhoster
          technische Probleme.</li>

  <li>Versuchen Sie sp&#228;ter nochmal zu publizieren. Ihr Internet-Provider,
          Webhoster oder Webserver hat m&#246;glicherweise technische Probleme.</li>
</ul> </div>

<div class="errorMessage"> <p id="no_permission"><strong>Fehlermeldung:</strong></p>

<div class="contentsBox" style="background-color: #ebebeb;">
  <tt>Sie haben nicht die erforderlichen Rechte um in diesem Verzeichnis
        zu publizieren.</tt>
</div>

<p><strong>Fehlerbeschreibung:</strong> Sie versuchen in ein Verzeichnis
        zu publizieren, auf welches Sie keine Schreibrechte besitzen. Sie
        k&#246;nnen nur in Verzeichnisse publizieren, auf welche Sie von Ihrem
        Internet-Provider oder Webhoster die erforderlichen Rechte bekommen
        haben.</p>

<p><strong>L&#246;sungsvorschl&#228;ge:</strong></p>

<ul>
  <li>Stellen Sie sicher, da&#223; Sie den korrekten Benutzernamen und Passwort in
          dem <q>Publikations-Seiten</q>-Einstellungen, oder im
          <q>Publikations</q>-Tab des Publikations-Dialogs eingegeben
          haben.</li>

  <li>Kontaktieren Sie Ihren Internet-Provider oder Webhoster um
          herauszufinden wo Sie Ihre Dokumente publizieren k&#246;nnen.</li>

  <li>Finden Sie einen Webhoster, bei dem Sie Ihre Seiten publizieren
          k&#246;nnen. Im Browser-Fenster suchen Sie nach <q>web hosting</q>.</li>

  <li>Benutzen Sie <q>Netscape My Webpage</q> <a href=
          "http://mywebpage.netscape.com/" target=
          "_blank"><tt>http://mywebpage.netscape.com/</tt></a> um Ihre
          Webseiten zu hosten, Sie haben dort kostenlos 20 Megabyte zur
          Verf&#252;gung.</li>
</ul>
</div>

<div class="errorMessage"> <p id="offline_error"><strong>Fehlermeldung:</strong></p>

<div class="contentsBox" style="background-color: #ebebeb;">
  <tt>Sie befinden sich derzeit im Offline-Modus. Klicken Sie auf das
        Symbol in der rechten unteren Ecke in irgendeinem &brandShortName;-Fenster um in
        den Online-Modus zu wechseln.</tt> </div>

<p><strong>Fehlerbeschreibung:</strong> Sie versuchen ein Dokument zu
        publizieren, aber &brandShortName; befindet sich im
        <q>Offline</q>-Modus. Sie m&#252;ssen in dem <q>Online</q>-Modus
        wechseln um Ihr Dokument publizieren zu k&#246;nnen.</p>

<p>Vergewissern Sie sich, da&#223; Sie im <q>Online</q>-Modus sind, indem
        Sie das Online/Offline-Symbol in der rechten unteren Ecke jedes
        &brandShortName;-Fensters beachten. Wenn Sie sich im Offline-Modus befinden,
        sieht das das Symbol so aus<img src="images/offline.png" width="32"
        height="21" alt="" />.
</p>

<p><strong>L&#246;sungsvorschl&#228;ge:</strong></p>

<ul>
  <li>Klicken Sie auf das Online/Offline-Symbol um in den Online-Modus zu
          wechseln. Im Online-Modus sieht das Symbol so aus<img src=
          "images/online.png" width="32" height="20" alt="" />.</li>

  <li>Stellen Sie sicher, da&#223; Ihre Internet-Verbindung funktioniert, indem
          Sie eine Internet-Seite im Browser-Fenster laden. &#252;berpr&#252;fen Sie
          zum Beispiel, da&#223; Sie die Seite <tt>http://www.mozilla.org/</tt>
          anzeigen k&#246;nnen.</li>
</ul> </div>

<div class="errorMessage"> <p id="no_disk_space"><strong>Fehlermeldung:</strong></p>

<div class="contentsBox" style="background-color: #ebebeb;">
  <tt>Es ist nicht mehr gen&#252;gend Speicherplatz verf&#252;gbar um die Datei
<var>Dateiname</var> zu speichern.</tt> </div>

<p><strong>Fehlerbeschreibung:</strong> Am Webserver ist kein weiterer
        Speicherplatz frei, oder Sie haben die Ihnen zugeteilte
        Speicherkapazit&#228;t erreicht.</p>

<p><strong>L&#246;sungsvorschl&#228;ge:</strong></p>

<ul>
  <li>Benutzen Sie ein separates FTP-Programm um nicht mehr ben&#246;tigte
          Dateien vom Server zu l&#246;schen. Fragen Sie Ihren Internet-Provider, ob
          dieser ein spezielles FTP-Programm empfiehlt. Informationen &#252;ber
          FTP-Programme finden Sie &#252;blicherweise auf der <q>Hilfe und
          Support</q>-Sektion auf der Homepage Ihres Internet-Providers.
          FTP-Programme k&#246;nnen auch von Shareware-Seiten wie z.B. ZDNet
          heruntergeladen werden.</li>

  <li>Finden Sie heraus, wie viel Speicherplatz Ihnen von von Ihrem
          Internet-Provider oder Webhoster zugeteilt worden ist und wie Sie
          diesen vergr&#246;&#223;ern k&#246;nnen oder wechseln Sie zu einem anderen Anbieter,
          der Ihren Anspr&#252;chen gen&#252;gt.</li>

  <li>Sollte der Webserver Ihrer Firma oder Schule geh&#246;ren, kontaktieren
          Sie den Netzwerk-Administrator um herauszufinden, ob Sie Ihre Seite
          an einem anderen Ort speichern k&#246;nnen, welcher mehr Speicherplatz
          bietet, oder ob Sie zus&#228;tzlichen Speicherplatz bekommen k&#246;nnen.</li>
</ul> </div>

<div class="errorMessage"> <p id="name_too_long"><strong>Fehlermeldung:</strong></p>

<div class="contentsBox" style="background-color: #ebebeb;">
<tt>Der Dateiname oder der Verzeichnisname ist zu lang.</tt> </div>

<p><strong>Fehlerbeschreibung:</strong> Die derzeitige L&#228;nge des
        Dateinamen oder Verzeichnisnamen wird vom Webserver nicht unterst&#252;tzt.</p>

<p><strong>L&#246;sungsvorschl&#228;ge:</strong></p>

<ul>
  <li>Stellen Sie sicher, da&#223; der Dateiname oder der Verzeichnisname nicht
          l&#228;nger aus 32 Zeichen ist. Manche Betriebsystem unterst&#252;tzen keine
          Namen mit mehr als 32 Zeichen.</li>
</ul> </div>

<p class="returnToSection">[ <a
href="#solving_common_publishing_problems">Zur&#252;ck zum Beginn des
      Abschnitts</a> ]</p>



</body>
</html>
