<?xml version="1.0" encoding="UTF-8"?> <!DOCTYPE html PUBLIC
"-//W3C//DTD XHTML 1.1//EN"
"http://www.w3.org/TR/xhtml11/DTD/xhtml11.dtd"[
<!ENTITY % brandDTD SYSTEM "chrome://global/locale/brand.dtd" >
%brandDTD; ] >

<html xmlns="http://www.w3.org/1999/xhtml"> <head>
<title>Cr&eacute;er des pages Web avec &brandShortName;</title>
<link rel="stylesheet" type="text/css" href="help-fr.css" />
</head>

<body>
<script type="text/javascript">
var isDisplayed = true;

function togglePanel() {
  isDisplayed = !isDisplayed;
  var displayValue = isDisplayed ? "display: block" : "display: none";
  var bodyValue = isDisplayed ? "margin-left: 175px" : "margin-left:5px";

  document.getElementById("contentsBox").setAttribute("style", displayValue);
  document.getElementsByTagName("body").item(0).setAttribute("style", bodyValue);
}
</script>

<table width="100%" id="navTable">
<tr>
<td valign="bottom" width="20"><small><a href="#" onclick="togglePanel();" style="margin-top:10px;">Montrer/cacher</a></small></td>
<td width="72"><img src="chrome://editor/skin/icons/throbber-single.png" width="52" height="52" alt="&brandShortName;" align="left"/></td><td align="left"><span id="topText">Centre d'aide</span></td>
</tr>
</table>

<div id="contentsBox">Dans cette section&nbsp;:
  <a href="composer_help.xhtml#starting_a_new_page">Commencer une nouvelle page</a>

  <a href="formatting_webpages.xhtml">Mettre en forme des pages Web</a>

  <a href="css.xhtml">Utiliser des feuilles de style pour vos pages Web</a>

  <a href="tables.xhtml">Ajouter des tableaux &agrave; votre page Web</a>

  <a href="images.xhtml">Ajouter des images &agrave; votre page Web</a>

  <a href="toc.xhtml">Travailler avec une table des mati&egrave;res sur votre page Web</a>

  <a href="templates.xhtml">Travailler avec des mod&egrave;les</a>

  <a href="page_properties.xhtml">D&eacute;finir les propri&eacute;t&eacute;s de la page</a>

  <a href="links.xhtml">Cr&eacute;er des liens dans &brandShortName;</a>

  <a href="customize.xhtml">Personnaliser &brandShortName;</a>
</div>

<h2 id="creating_links_in_composer">Cr&eacute;er des liens avec &brandShortName;</h2>

<h3 id="creating_links_within_the_same_page">Cr&eacute;er des liens vers la m&ecirc;me page</h3>

<p>Pour cr&eacute;er des liens vers la m&ecirc;me page, par exemple un lien que le lecteur peut utiliser pour aller de section en section, vous devez cr&eacute;er une <em>ancre</em> (une cible d'emplacement), puis cr&eacute;er un lien qui pointe vers cette ancre. Les ancres sont &eacute;galement appel&eacute;es <em>ancres nomm&eacute;es</em>.</p>

<ol>
  <li>Cliquez pour placer le curseur au d&eacute;but d'une ligne o&ugrave; vous voulez cr&eacute;er une ancre, ou s&eacute;lectionnez du texte.</li>
  
  <li>Cliquez sur le bouton <q>Ancre</q> <img src="images/anchor.png" width="56"
  height="59" alt="" /> ou ouvrez le menu <span class="menuPath">Insertion</span> puis choisissez <span class="menuPath">Ancre</span>. Vous verrez alors la bo&icirc;te de dialogue <q>Propri&eacute;t&eacute;s de l'ancre</q>.</li>
  
  <li>Tapez un nom unique pour l'ancre dans le champ <q>Nom de l'ancre</q> (jusqu'&agrave; 30 caract&egrave;res). Si vous incluez des espaces, elles seront converties en traits de soulignement ( _ ). Si vous avez s&eacute;lectionn&eacute; du texte lors de l'&eacute;tape 1, cette bo&icirc;te contiendra d&eacute;j&agrave; un nom.</li>
  
  <li>Cliquez sur <q>OK</q>. Une ic&ocirc;ne d'ancre appara&icirc;tra dans votre document pour marquer l'emplacement de l'ancre&nbsp;: <img src="images/anchor-in-doc.gif" width="20" height="17" alt=""  /></li>
</ol>

<p>Pour cr&eacute;er le lien sur lequel les lecteurs pourront cliquer pour rejoindre l'emplacement de l'ancre&nbsp;:</p>

<ol>
  <li>S&eacute;lectionnez le texte ou l'image que vous voulez lier &agrave; l'ancre.</li>

  <li>Cliquez sur le bouton <q>Lien</q> ou ouvrez le menu <span class="menuPath">Insertion</span> et choisissez <span class="menuPath">Lien</span>. Vous verrez alors la bo&icirc;te de dialogue <q>Propri&eacute;t&eacute;s du lien</q>.
  
  <ul>
    <li>Si vous cr&eacute;ez un lien vers une page HTML sur votre ordinateur, cliquez sur <q>Parcourir&hellip;</q> pour le situer.</li>
    
    <li>Si vous cr&eacute;ez un lien vers une ancre (une cible), s&eacute;lectionnez-la dans la liste des ancres disponibles de la page.</li>
    
    <li>Si vous cr&eacute;ez un lien vers un niveau de titre (par exemple, Titre 1 - Titre 6), s&eacute;lectionnez-le dans la liste des titres disponibles de la page.</li>
    
  </ul>
  </li>
  
  <li>Cliquez sur <q>OK</q>.</li> 
</ol>

<p><strong>Note</strong>&nbsp;: Pour tester le lien que vous venez de cr&eacute;er, ouvrez le menu <span class="menuPath">Fichier</span> et choisissez <span class="menuPath">Aper&ccedil;u dans le navigateur</span>, puis cliquez sur le lien.</p>

<p><strong>Conseil</strong>&nbsp;: Si vous n'avez pas cr&eacute;&eacute; d'ancre auparavant, vous pouvez utiliser la bo&icirc;te de dialogue <q>Lien</q> pour cr&eacute;er des liens vers des titres d&eacute;j&agrave; pr&eacute;sents sur la page.</p>

<p class="returnToSection">[&nbsp;<a href="#creating_links_in_composer">Retour au d&eacute;but de la section</a>
]</p>

<h3 id="creating_links_to_other_pages">Cr&eacute;er des liens vers d'autres pages</h3>

<p>Vous pouvez cr&eacute;er des liens de votre page vers des pages de votre ordinateur ou de votre r&eacute;seau d'entreprise, ou vers des pages sur Internet.</p>

<p><strong>Conseil</strong>&nbsp;: Il est pr&eacute;f&eacute;rable d'enregistrer ou de publier vos pages avant d'y ins&eacute;rer des images. Ceci permet &agrave; &brandShortName; d'utiliser automatiquement des r&eacute;f&eacute;rences relatives pour les images lorsque vous les ins&eacute;rer.</p>


<p id="to_create_a_link_to_another_page">Pour cr&eacute;er des liens vers une autre page&nbsp;:</p>

<ol>
  <li>Cliquez pour placer le curseur &agrave; l'endroit o&ugrave; vous voulez cr&eacute;er le lien, ou s&eacute;lectionnez le texte ou l'image que vous voulez lier &agrave; l'ancre.</li>
  
  <li>Cliquez sur le bouton <q>Lien</q>. Vous verrez alors la bo&icirc;te de dialogue <q>Propri&eacute;t&eacute;s du lien</q>.</li>
  
  <li>D&eacute;finissez votre lien&nbsp;:
  
  <ul>
    <li><strong>Lien texte</strong>&nbsp;: Si vous avez s&eacute;lectionn&eacute; une image ou du texte avant de cliquer sur le bouton <q>Lien</q>, le texte s&eacute;lectionn&eacute; ou le nom du fichier image appara&icirc;tra ici. Sinon, vous devrez entrer le texte que vous voulez utiliser pour le lien.</li>

    <li><strong>Emplacement du lien</strong>&nbsp;: Tapez le chemin d'acc&egrave;s et le nom de fichier ou l'URL distante &agrave; lier. Si vous n'&ecirc;tes pas s&ucirc;r du chemin d'acc&egrave;s et du nom de fichier pour un fichier local, cliquez sur <q>Parcourir&hellip;</q> pour le rechercher sur votre disque dur ou le r&eacute;seau. Pour les URL distantes, vous pouvez copier l'URL &agrave; partir du champ adresse de votre navigateur. Vous pouvez aussi s&eacute;lectionner une ancre ou un titre dans la page que vous voulez lier.</li>

    <li><strong>L'URL est relative &agrave; l'adresse de la page</strong>&nbsp;: Si cette option est coch&eacute;e, &brandShortName; convertit l'URL pour qu'elle soit relative &agrave; l'adresse de la page. Ceci est particuli&egrave;rement utile si vous pr&eacute;voyez de publier vos pages sur un serveur Web pour que d'autres personnes puissent les voir. Utiliser des URL relatives vous permet de conserver tous vos fichiers li&eacute;s au m&ecirc;me emplacement relatif les uns par rapport aux autres, sans tenir compte de leur emplacement sur votre disque dur ou sur un serveur Web.
    <p>Si vous d&eacute;cochez cette option, &brandShortName; convertir l'URL en une URL compl&egrave;te (absolue). On utilise g&eacute;n&eacute;ralement des URL absolues pour lier des images pr&eacute;sentes sur d'autres serveurs Web (pas pour des images stock&eacute;es localement sur votre disque dur).</p>
    <p>Si vous n'avez pas encore enregistr&eacute; ou publi&eacute; la page, vous devez d'abord l'enregistrer pour activer cette option.</p></li>
    
  </ul>
  </li>
  <li>Pour appliquer des attributs suppl&eacute;mentaires ou des &eacute;v&eacute;nements JavaScript, cliquez sur <q>&Eacute;dition avanc&eacute;e&hellip;</q> pour afficher l'<a href="#using_the_advanced_property_editor">&Eacute;diteur des propri&eacute;t&eacute;s avanc&eacute;es</a>.</li>
  
  <li>Cliquez sur <q>OK</q>.</li>
  
  <li>Pour tester un lien que vous venez de cr&eacute;er, cliquez sur le bouton <q>Navigateur</q>, puis cliquez sur le lien pour vous assurer qu'il fonctionne comme pr&eacute;vu.</li>
</ol>

<p><strong>Conseil</strong>&nbsp;: Vous pouvez copier un lien rapidement en faisant un glisser-d&eacute;poser de ce lien &agrave; partir d'une autre fen&ecirc;tre et en le d&eacute;posant sur votre page. Par exemple, vous pouvez faire glisser un lien &agrave; partir d'une page Web, d'un marque-page ou d'une fen&ecirc;tre de courrier et le d&eacute;poser sur votre page. Vous pouvez &eacute;galement faire un clic droit (<kbd>Control+click</kbd> sur Mac OS) sur un lien d'une page Web et s&eacute;lectionner <span class="menuPath">Copier l'adresse du lien</span> &agrave; partir du menu. Puis, vous pouvez copier l'adresse du lien dans le champ <q>Emplacement du lien</q> dans la bo&icirc;te de dialogue <q>Propri&eacute;t&eacute;s du lien</q>.</p>

<p class="returnToSection">[&nbsp;<a href="#creating_links_in_composer">Retour au d&eacute;but de la section</a>
]</p>

<h3 id="adding_xfn_information_within_your_links">Ajouter des informations XFN &agrave; vos liens</h3>

<p>Lorsque vous cr&eacute;ez des liens sur votre page Web vers les pages d'autres personnes, &brandShortName; fournit la fonctionnalit&eacute; d'inclure des informations <a target="_blank" href="http://gmpg.org/xfn/">XFN</a> (XHTML Friends Network). XFN est un moyen simple de repr&eacute;senter les relations entre personnes en utilisant des hyperliens. Pour ajouter des informations XFN&nbsp;:</p>
<ol>
  <li>Faites un clic droit sur le lien auquel vous voulez ajouter des informationsXFN.</li>
  <li>S&eacute;lectionnez <span class="menuPath">Propri&eacute;t&eacute;s du lien&hellip;</span>.</li>
  <li>Dans la fen&ecirc;tre <q>Propri&eacute;t&eacute;s du lien</q>, cliquez sur <q>Plus de propri&eacute;t&eacute;s</q>.</li>
  <li>S&eacute;lectionnez les entr&eacute;es correspondantes sous la section <q>Relation</q> &agrave; ajouter en tant qu'informations XFN.</li>
  <li>Cliquez sur <q>OK</q>.</li>
  <li>Cliquez sur le bouton <q>Enregistrer</q> pour enregistrer les changements/ajouts dans le document.</li>
</ol>

<p><strong>Note</strong>&nbsp;: Certaines propri&eacute;t&eacute;s XFN sont de type bouton radio c'est-&agrave;-dire que vous ne pouvez en choisir qu'au plus une (propri&eacute;t&eacute;), les autres sont des cases &agrave; cocher c'est-&agrave;-dire que vous pouvez cocher plusieurs propri&eacute;t&eacute;s.</p>

<p class="returnToSection">[&nbsp;<a href="#creating_links_in_composer">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<h3 id="using_images_as_links">Utiliser des images en tant que liens</h3>

<p>Vous pouvez faire se comporter des fichiers images tels que JPEG, GIF, ou PNG comme des liens dans vos pages. Quand le lecteur clique sur une image li&eacute;e, le navigateur affiche la page vers laquelle l'image est li&eacute;e.</p>

<ol>
  <li>S&eacute;lectionnez une image dans votre page.</li>

  <li>Cliquez sur le bouton <q>Lien</q> <img src="images/link.png" width="59" height="62" alt="" /> de la barre d'outils, ou ouvrez le menu <span class="menuPath">Insertion</span> et choisissez <span class="menuPath">Lien</span>.</li>

  <li>Utilisez la bo&icirc;te de dialogue <q>Propri&eacute;t&eacute;s du lien</q> pour lier une image vers <a
  href="#creating_links_within_the_same_page">une ancre ou un titre</a> de la page en cours, ou vers une <a
  href="#creating_links_to_other_pages">autre page ou une page distante</a>.</li>
</ol>

<p><strong>Conseil</strong>&nbsp;: Faites un glisser-d&eacute;poser d'une image li&eacute;e &agrave; partir de la fen&ecirc;tre de votre navigateur vers une fen&ecirc;tre de &brandShortName; pour y copier &agrave; la fois l'image et le lien.</p>

<p><strong>Note</strong>&nbsp;: Pour supprimer la bordure bleue entourant les images utilis&eacute;es comme liens, ouvrez la bo&icirc;te de dialogue <q>Propri&eacute;t&eacute;s du lien</q>, cliquez sur l'onglet, et d&eacute;cochez l'option <q>Encadrer les images qui portent un lien</q>.</p>

<p class="returnToSection">[&nbsp;<a href="#creating_links_in_composer">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<h3 id="removing_or_discontinuing_links">Supprimer ou rompre les liens</h3>

<p>Pour supprimer un lien&nbsp;:</p>

<ol>
  <li>S&eacute;lectionnez le texte li&eacute; (normalement soulign&eacute; en bleu) ou l'image.</li>

  <li>Ouvrez le menu <span class="menuPath">Format</span> et choisissez <span class="menuPath">Supprimer les liens</span>.</li>
</ol>

<p>Pour rompre un lien, de sorte que le texte que vous tapez apr&egrave;s celui-ci, ne soit pas inclus dans le lien&nbsp;:</p>

<ol>
  <li>Cliquez pour placer le curseur &agrave; l'endroit o&ugrave; vous voulez que le lien s'arr&ecirc;te.</li>

  <li>Ouvrez le menu <span class="menuPath">Format</span> et choisissez <span class="menuPath">Annuler le lien</span>.</li>
</ol>

<p class="returnToSection">[&nbsp;<a href="#creating_links_in_composer">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>[&nbsp;<a href="customize.xhtml">Suivant</a>&nbsp;] [&nbsp;<a href="page_properties.xhtml">Pr&eacute;c&eacute;dent</a>&nbsp;]</p>

  <div class="copyrightBox"><em>20 juin 2005</em></div>

  <p>Copyright &copy; 2004-2005 Contributeurs du Projet &brandShortName; Help Documentation.</p>
    <!--begin frenchmozilla signature-->

    <p><em>Derni&egrave;re traduction&nbsp;: 23 juin 2005</em></p>

    <p>Ce texte a &eacute;t&eacute; traduit et adapt&eacute; par une
    &eacute;quipe internationale de b&eacute;n&eacute;voles francophones.<br />
    Pour plus d'informations, visitez notre site&nbsp;: <a href=
    "http://frenchmozilla.sourceforge.net" hreflang="fr" target=
    "_blank">http://frenchmozilla.sourceforge.net</a>.</p>
    <!--end frenchmozilla signature-->

</body>
</html>
