<?xml version="1.0" encoding="UTF-8"?> <!DOCTYPE html PUBLIC
"-//W3C//DTD XHTML 1.1//EN"
"http://www.w3.org/TR/xhtml11/DTD/xhtml11.dtd"[ <!ENTITY % brandDTD
SYSTEM "chrome://global/locale/brand.dtd" > %brandDTD; ]>

<!--
Original Author:
"KDS Sahambi" <ksahambi@yahoo.com>
Contributor(s):
-->

<html xmlns="http://www.w3.org/1999/xhtml"> <head>
<title>Liste des menus de &brandShortName;</title>
<link rel="stylesheet" type="text/css" href="chrome://help/skin/helpFileLayout.css"/>
</head>

<body>

<script type="text/javascript">
var isDisplayed = true;

function togglePanel() {
  isDisplayed = !isDisplayed;
  var displayValue = isDisplayed ? "display: block" : "display: none";
  var bodyValue = isDisplayed ? "margin-left: 175px" : "margin-left:5px";

  document.getElementById("contentsBox").setAttribute("style", displayValue);
  document.getElementsByTagName("body").item(0).setAttribute("style", bodyValue);
}
</script>

<table width="100%" id="navTable">
<tr>
<td valign="bottom" width="20"><small><a href="#" onclick="togglePanel();" style="margin-top:10px;">Afficher/Masquer</a></small></td>
<td width="72"><img src="chrome://editor/skin/icons/throbber.png" width="32" height="32" alt="&brandShortName;" align="center"/></td><td align="left"><span id="topText">Centre d'aide</span></td>
</tr>
</table>

  <div id="contentsBox">Dans cette section&nbsp;:
  <a href="#file">Fichier</a>
  <a href="#edit">Édition</a>
  <a href="#view">Affichage</a>
  <a href="#insert">Insertion</a>
  <a href="#format">Format</a>
  <a href="#table">Tableau</a>
  <a href="#tools">Outils</a>
  <a href="#help">Aide</a>
  </div>

  <h1 id="menu_reference">Liste des menus de &brandShortName;</h1>
  <div>Cette liste d&eacute;crit tous les menus de la fen&ecirc;tre
   principale de &brandShortName;.
  </div>

  <h2 id="file">Fichier</h2>

  <h3 id="new_window">Nouveau</h3>
  <p>Ouvre une nouvelle fen&ecirc;tre de &brandShortName;.</p>

  <h3 id="open_file">Ouvrir un fichier&hellip;</h3>
  <p>Affiche la bo&icirc;te de dialogue <q>Ouvrir un fichier</q>
  vous permettant de s&eacute;lectionner un fichier depuis votre disque dur ou du r&eacute;seau. 
  Avec &brandShortName; vous pouvez voir les fichiers de type HTML,
  mod&egrave;les HTML, et texte.</p>

  <h3 id="open_web_location">Ouvrir une page Web&hellip;</h3>
  <p>Affiche la bo&icirc;te de dialogue <q>Ouvrir une page Web</q> 
  vous permettant de saisir l'URL du document ou de choisir un fichier local &agrave; ouvrir. 
 </p>

  <h3 id="recent_pages">Pages r&eacute;centes</h3>
  <p>Affiche la liste des fichiers r&eacute;cemment &eacute;dit&eacute;s.</p>
  
  <h3 id="close">Fermer</h3>
  <p>Ferme la fen&ecirc;tre courante.</p>

  <h3 id="close_all">Fermer tout</h3>
  <p>Ferme tous les onglets ouverts dans la fen&ecirc;tre courante.</p>
  
  <h3 id="save">Enregistrer</h3>
  <p>Enregistre le fichier ouvert dans l'onglet actif.</p>
  
  <h3 id="save_as">Enregistrer sous&hellip;</h3>
  <p>Enregistre le fichier que vous &eacute;ditez en vous proposant
  de lui donner un nom de fichier diff&eacute;rent.</p>

  <h3 id="save_as_charset">Enregistrer et modifier l'encodage&hellip;</h3>
  <p>Vous permet de modifier l'encodage de la page 
  avant d'afficher la bo&icirc;te de dialogue <q>Enregistrer sous</q>.</p>

  <h3 id="publish">Publier</h3>
  <p>
  Ouvre la bo&icirc;te de dialogue <q>Publier</q> 
  vous permettant de publier la page en cours d'&eacute;dition.
  </p>

  <h3 id="publish_as">Publier sous&hellip;</h3>
  <p>Ouvre la bo&icirc;te de dialogue <q>Publier</q>
  vous permettant de publier la page en cours d'&eacute;dition. Se comporte comme Publier&nbsp;!</p>

  <h3 id="revert">Restaurer</h3>
  <p>Annule tous les changements effectu&eacute;s sur le document actuel depuis la derni&egrave;re sauvegarde. 
  Revient &agrave; la derni&egrave;re sauvegarde du document.
  </p>

  <h3 id="export_to_text">Exporter au format texte&hellip;</h3>
  <p>Exporte le contenu du document actuel au format texte brut.</p>

  <h3 id="browse_page">Aper&ccedil;u dans le navigateur</h3>
  <p>Affiche la page actuelle dans le navigateur par d&eacute;faut.</p>

  <h3 id="page_setup">Mise en Page&hellip;</h3>
  <p>Ouvre la bo&icirc;te de dialogue de mise en page pour configurer les options d'impression.</p>
  
  <h3 id="print_preview">Aper&ccedil;u avant impression</h3>
  <p>Ouvre une fen&ecirc;tre montrant l'aspect qu'aura votre document quand vous l'imprimerez sur du papier.</p>
  
  <h3 id="print">Imprimer&hellip;</h3>
  <p>Affiche la bo&icirc;te de dialogue <q>Imprimer</q>
  o&ugrave; vous pouvez sp&eacute;cifier le nombre de pages &agrave; imprimer, 
  etc. Cliquez sur <q>OK</q> pour imprimer la page.</p>

  <h3 id="exit">Quitter</h3>
  <p>Ferme toutes les fen&ecirc;tres de &brandShortName; incluant toutes celles avec plus d'un onglet ouvert,
  et quitte &brandShortName; compl&egrave;tement. Si vous avez des documents non enregistr&eacute;s, &brandShortName; 
  vous demandera de confirmer votre choix pour emp&ecirc;cher toute sortie accidentelle.</p>

  <p class="returnToSection">[&nbsp;<a
  href="#menu_reference">Retourner au d&eacute;but de la
  section</a>&nbsp;]</p>

  <h2 id="edit">Édition</h2>

  <h3 id="undo">Annuler</h3>
  <p>Annule la derni&egrave;re action d'&eacute;dition effectu&eacute;e dans le document actuel. 
   Si vous d&eacute;cidez plus tard que vous ne vouliez pas d&eacute;faire une action, 
   employez la commande <q>Refaire</q>.</p>

  <h3 id="redo">Refaire</h3>
  <p>Refait la derni&egrave;re action annul&eacute;e.</p>

  <h3 id="cut">Couper</h3>
  <p>Coupe le texte s&eacute;lectionn&eacute; depuis le document et le stocke dans le presse-papiers. 
  Collez le texte ailleurs en utilisant la commande <q>Coller</q>.</p>

  <h3 id="copy">Copier</h3>
  <p>Copie le texte s&eacute;lectionn&eacute; dans le presse-papiers. 
  Collez le texte ailleurs en utilisant la commande <q>Coller</q>.</p>
  
  <h3 id="paste">Coller</h3>
  <p>Colle le texte issu du presse-papiers par 
  la commande <q>Couper</q> ou <q>Copier</q> &agrave; la position actuelle du curseur.</p>

  <h3 id="paste_without_formatting">Coller sans mise en forme</h3>  
  <p>Colle le texte issu du presse-papiers par 
  la commande <q>Couper</q> ou <q>Copier</q> &agrave; la position actuelle du curseur 
  comme du texte simple c'est-&agrave;-dire que les informations de mise en page du texte du presse-papiers sont ignor&eacute;es.</p>
  
  <h3 id="delete">Effacer</h3>
  <p>Efface le texte s&eacute;lectionn&eacute; dans le document actuel.</p>

  <h3 id="select_all">Tout s&eacute;lectionner</h3>
  <p>S&eacute;lectionne tout le texte dans le document actuel.</p>

  <h3 id="find_and_replace">Rechercher et remplacer&hellip;</h3>
  <p>Affiche la bo&icirc;te de dialogue o&ugrave; vous pouvez saisir une cha&icirc;ne de texte qui sera recherch&eacute;e 
  et remplac&eacute;e par une autre cha&icirc;ne de texte. 
  La recherche est effectu&eacute;e sur la page courante.</p>

  <h3 id="find_again">Rechercher &agrave; nouveau</h3>
  <p>Recherche l'occurrence suivante du texte saisi dans la bo&icirc;te de dialogue <q>Rechercher et remplacer&hellip;</q>. 
  La recherche est effectu&eacute;e sur la page courante.</p>

  <h3 id="find_previous">Rechercher le pr&eacute;c&eacute;dent</h3>
  <p>Recherche l'occurrence pr&eacute;c&eacute;dente du texte saisi dans la bo&icirc;te de dialogue <q>Rechercher et remplacer&hellip;</q>.</p>

  <h3 id="check_spelling">V&eacute;rifier l'orthographe</h3>
  <p>Ouvre le correcteur orthographique et commence la 
  correction orthographique sur le texte de la page courante.</p>

  <h3 id="detach_from_template">Dissocier du mod&egrave;le</h3>
  <p>Dissocie le document actuellement &eacute;dit&eacute; du mod&egrave;le pour l'enregistrer 
  comme une page <em>html</em>.</p>

  <h3 id="publish_site_settings">Param&egrave;tres des sites de publication</h3>
  <p>Ouvre le gestionnaire de sites pour configurer ou changer les param&egrave;tres 
  pour le site de publication.</p>

  <p class="returnToSection">[&nbsp;<a
  href="#menu_reference">Retourner au d&eacute;but de la
  section</a>&nbsp;]</p>

  <h2 id="view">Affichage</h2>

  <h3 id="show_hide">Barre d'outils</h3>

  <h4 id="composition_toolbar">Principale</h4>
  <p>Affiche ou cache la barre d'outils de composition, qui contient habituellement les 
  boutons standard de composition (Ancre, Lien, Image, etc).</p>

  <h4 id="format_toolbar">Mise en forme</h4>
  <p>Affiche ou cache la barre d'outils de mise en forme, 
  qui contient divers boutons de mise en forme.</p>

  <h4 id="edit_mode_toolbar">Modes d'&eacute;dition</h4>
  <p>Affiche ou cache la barre d'outils de mode d'&eacute;dition. Cette barre d'outils se trouve 
  dans la fen&ecirc;tre de &brandShortName; juste au-dessus de la barre d'&eacute;tat.
  Cette barre vous permet de basculer entre les diff&eacute;rentes vues comme <em>Balises HTML</em>, 
  <em>Source HTML</em>, etc.</p>
  
  <h4 id="status_bar">Barre d'&eacute;tat</h4>
  <p>Affiche ou cache la barre d'&eacute;tat 
  situ&eacute;e en bas de la fen&ecirc;tre de &brandShortName;.</p>
  
  <h4 id="rulers">R&egrave;gles</h4>
  <p>Affiche ou cache les r&egrave;gles horizontales et verticales.</p>

  <h4 id="customize_toolbar">Personnalisation des barres d'outils</h4>

  <h5 id="main_toolbar">Barre d'outils principale</h5>
  <p>Ouvre un panneau pour modifier la barre d'outils principale. 
  Vous pouvez glisser et d&eacute;poser des boutons depuis le panneau vers la barre 
  d'outils principale pour ajouter de nouveaux boutons ou inversement pour retirer des boutons.</p>

  <h5 id="format_toolbar">Barre d'outils de mise en forme</h5>
  <p>Ouvre un panneau pour modifier la barre d'outils de mise en forme. Vous pouvez glisser et 
  d&eacute;poser des boutons depuis le panneau vers la barre d'outils de mise en forme pour ajouter 
  des nouveaux boutons ou inversement pour retirer des boutons.</p>

  <h4 id="site_manager">Gestionnaire de sites</h4>
  <p>Escamote le panneau du <em>Gestionnaire de sites</em> dans la fen&ecirc;tre de &brandShortName;.</p>

  <h3 id="normal_edit_mode">Mode d'&eacute;dition normal</h3>
  <p>Bascule vers le mode d'&eacute;dition normal.</p>

  <h3 id="html_tags">Balises HTML</h3>
  <p>Bascule vers le mode affichant les balises HTML.</p>

  <h3 id="html_source">Source HTML</h3>
  <p>Bascule vers le mode affichant le code source HTML.</p>

  <h3 id="preview">Aper&ccedil;u</h3>
  <p>Bascule vers le mode d'aper&ccedil;u.</p>

  <h3 id="carriage_returns">Retour &agrave; la ligne</h3>
  <p>Affiche ou cache les retours &agrave; la ligne.</p>

  <h3 id="block_outline">Mise en &eacute;vidence des blocs</h3>
  <p>Affiche ou cache le contour des &eacute;l&eacute;ments de bloc dans la page.</p>

  <h3 id="text_zoom">Taille du texte</h3>

  <h4 id="text_zoom_smaller">Plus petit</h4>
  <p>Affiche le texte une taille en dessous dans la page Web. Vous pouvez &eacute;galement faire ceci avec la souris 
  (voir <q>Plus grand</q> pour des instructions). 
  Pour restaurer la taille de texte par d&eacute;faut, utilisez <kbd>Ctrl</kbd>+<kbd>0</kbd>.</p>

  <h4 id="text_zoom_larger">Plus grand</h4>
  <p>
  Affiche le texte une taille au-dessus dans la page Web. 
  Vous pouvez &eacute;galement faire ceci avec la souris en maintenant la touche <kbd>Ctrl</kbd> enfonc&eacute;e 
  tout en utilisant la molette ou en pressant <kbd>+</kbd> ou <kbd>-</kbd> pour augmenter ou diminuer la taille du texte. 
  Pour restaurer la taille de texte par d&eacute;faut, utilisez <kbd>Ctrl</kbd>+<kbd>0</kbd>.
  
  </p>

  <h3 id="character_encoding">Encodage des caract&egrave;res</h3>
  <p>
  Vous permet de changer manuellement l'encodage des caract&egrave;res sur une page Web. 
  &brandShortName; fait habituellement ceci automatiquement.
  </p>

  <h2 id="insert">Insertion</h2>

  <p>
  Le menu d'insertion vous permet d'ins&eacute;rer divers &eacute;l&eacute;ments HTML dans le document en cours d'&eacute;dition.
  </p>

  <h3 id="insert_image">Image&hellip;</h3>
  <p>Ouvre la bo&icirc;te de dialogue <q>Propri&eacute;t&eacute;s de l'image</q> pour ins&eacute;rer une image dans le document actuel.</p>

  <h3 id="insert_table">Tableau&hellip;</h3>
  <p>Ouvre la bo&icirc;te de dialogue <q>Ins&eacute;rer un tableau</q> pour ins&eacute;rer un tableau dans le document actuel.</p>

  <h3 id="insert_form">Formulaire</h3>
  <p></p>

  <h3 id="insert_link">Lien&hellip;</h3>
  <p>Ouvre la bo&icirc;te de dialogue <q>Propri&eacute;t&eacute;s du lien</q> pour cr&eacute;er un lien dans le document actuel. Si du texte est s&eacute;lectionn&eacute; lorsque vous utilisez cette commande, le texte s&eacute;lectionn&eacute; sera transform&eacute; en lien. Vous pouvez d&eacute;finir la cible du lien et les informations de relation (XFN) en cliquant sur <q>Plus de propri&eacute;t&eacute;s</q>.</p>

  <h3 id="named_anchor">Ancre&hellip;</h3>
  <p>Ouvre la bo&icirc;te de dialogue <q>Propri&eacute;t&eacute;s de l'ancre</q> pour saisir le nom de l'ancre &agrave; ins&eacute;rer &agrave; la position du curseur.</p>

  <h3 id="horizontal_line">Ligne horizontale</h3>
  <p>Ins&egrave;re une ligne horizontale dans le document.</p>

  <h3 id="html">Code HTML&hellip;</h3>
  <p>Ouvre la bo&icirc;te de dialogue <q>Ins&eacute;rer du code HTML</q> pour ins&eacute;rer manuellement du code HTML. Vous pouvez ainsi ins&eacute;rer des scripts, des balises inconnues de &brandShortName;, etc.</p>

  <h3 id="character_and_symbols">Caract&egrave;res et symboles&hellip;</h3>
  <p>Ouvre la bo&icirc;te de dialogue <q>Ins&eacute;rer un caract&egrave;re</q> pour ins&eacute;rer des lettres accentu&eacute;es ou des symboles usuels dans le document.</p>

  <h3 id="table_of_contents">Table des mati&egrave;res&hellip;</h3>
  <p>Ouvre la bo&icirc;te de dialogue <q>Table des mati&egrave;res</q> pour ins&eacute;rer une table des mati&egrave;res &agrave; l'emplacement du curseur. La table peut &ecirc;tre &eacute;tablie &agrave; partir des titres de niveaux 1 &agrave; 6, des paragraphes ou des balises &lt;div&gt;.</p>

  <h3 id="smart_widgets">Autres insertions</h3>
  <p>Ins&egrave;re un Smart Widgets dans votre document.</p>

  <h4 id="made_with_nvu">Bouton <q>Made With &brandShortName;</q></h4>
  <p>Ins&egrave;re un bouton <q>Made with &brandShortName;</q> dans votre document.</p>

  <h4 id="calendar">Calendrier</h4>
  <p>Ins&egrave;re un calendrier dans votre document.</p>
  
  <h4 id="made_with_nvu">Bouton <q>Fait avec &brandShortName;</q></h4>
  <p>Ins&egrave;re un bouton <q>Fait avec &brandShortName;</q> dans votre document.</p>

  <h3 id="templates">Mod&egrave;les</h3>
  <p>Quand vous travaillez sur un mod&egrave;le, vous pouvez utiliser ce menu pour ins&eacute;rer une zone &eacute;ditable dans votre mod&egrave;le.</p>

  <h3 id="php_code">Code PHP&hellip;</h3>
  <p>Ouvre la bo&icirc;te de dialogue <q>Ins&eacute;rer du code PHP</q> pour ins&eacute;rer du code PHP.</p>

  <h3 id="comment">Commentaires&hellip;</h3>
  <p>Ouvre la bo&icirc;te de dialogue <q>Ins&eacute;rer un commentaire</q> pour ins&eacute;rer un commentaire HTML.</p>

  <h3 id="break_below_images">Saut de lignes sous les images</h3>
  <p>Ins&egrave;re un saut de ligne sous les images pour que le texte saisi &agrave; c&ocirc;t&eacute; de l'image apparaisse en dessous.</p>

  <h2 id="format">Format</h2>

  <p>Ce menu contient diverses options pour mettre en forme le texte du document.</p>

  <h3 id="font">Police</h3>

  <p>Vous pouvez choisir la police &agrave; appliquer sur le texte s&eacute;lectionn&eacute; dans le document en cours. Vous pouvez choisir la police d&eacute;sir&eacute;e dans la liste contenant toutes les polices disponibles de votre syst&egrave;me.</p>

  <h3 id="size">Taille</h3>
  <p>En s&eacute;lectionnant <q>Plus petite</q> ou <q>Plus grande</q>, vous pouvez changer la taille du texte visionn&eacute; dans &brandShortName;.</p>
  <p>S&eacute;lectionner <q>Tr&egrave;s petite, Petite, Moyenne, Grande, Tr&egrave;s grande ou Extra-grande</q> change la taille du texte s&eacute;lectionn&eacute; dans le document en cours.</p>

  <h3 id="text_style">Style du Texte</h3>
  <p>Vous pouvez s&eacute;lectionner le style de texte HTML qui sera appliqu&eacute; au texte s&eacute;lectionn&eacute; dans le document.</p>

  <h4 id="text_style_bold">Gras</h4>

  <p>Affiche le texte s&eacute;lectionn&eacute; en caract&egrave;res gras. Ex.&nbsp;: <b>texte en caract&egrave;res gras</b></p>

  <h4 id="text_style_italic">Italique</h4>

  <p>Affiche le texte s&eacute;lectionn&eacute; en italique. Ex.&nbsp;: <i>texte en italique</i></p>

  <h4 id="text_style_italic">Soulign&eacute;</h4>

  <p>Souligne le texte s&eacute;lectionn&eacute;. Ex.&nbsp;: <u>texte soulign&eacute;</u></p>

  <h4 id="text_style_strikethrough">Barr&eacute;</h4>

  <p>Barre le texte s&eacute;lectionn&eacute;. Ex.&nbsp;: <span style="text-decoration: line-through;">texte barr&eacute;</span></p>

  <h4 id="text_style_superscript">Exposant</h4>

  <p>Met le texte s&eacute;lectionn&eacute; en exposant. Ex.&nbsp;: texte en <sup>exposant</sup>.</p>

  <h4 id="text_style_subscript">Indice</h4>

  <p>Met le texte s&eacute;lectionn&eacute; en indice. Ex.&nbsp;: texte en <sub>indice</sub>.</p>

  <h4 id="text_style_fixed_width">Largeur fixe</h4>

  <p>Affiche le texte s&eacute;lectionn&eacute; en largeur fixe. Ex.&nbsp;: <span style="font-family: monospace;">texte en largeur fixe</span>.</p>

  <h4 id="text_style_non_breaking">Ins&eacute;cable</h4>

  <p>Le code HTML convertit les espaces multiples en une seule. Pour marquer une espace ins&eacute;cable, utilisez cette option apr&egrave;s avoir s&eacute;lectionn&eacute; l'espace dans le document. Ex.&nbsp;: il y a trois espaces ins&eacute;cables&nbsp;&nbsp;&nbsp;ici.</p>

  <h4 id="text_style_emphasis">Mise en &eacute;vidence</h4>

  <p>Met le texte en &eacute;vidence. Ex.&nbsp;: <em>texte mis en &eacute;vidence</em></p>

  <h4 id="text_style_stronger_emphasis">Mise en &eacute;vidence prononc&eacute;e</h4>

  <p>Met le texte en &eacute;vidence de mani&egrave;re prononc&eacute;e. Ex.&nbsp;: <strong>texte mis en tr&egrave;s forte &eacute;vidence</strong>.</p>

  <h4 id="text_style_citation">Citation</h4>

  <p>D&eacute;finit le texte comme une citation. Ex.&nbsp;: <cite>Citation</cite></p>

  <h4 id="text_style_abbreviation">Abr&eacute;viation</h4>

  <p>Indique que le texte est une abr&eacute;viation. Ex.&nbsp;: <abbr title="Mademoiselle">M<sup>lle</sup></abbr></p>

  <h4 id="text_style_acronym">Acronyme</h4>

  <p>Indique que le texte est un acronyme. Ex.&nbsp;: <acronym  title="Organisation des nations unies">ONU</acronym></p>

  <h4 id="text_style_code">Code</h4>

  <p>Indique que le texte s&eacute;lectionn&eacute; repr&eacute;sente du code informatique. Ex.&nbsp;: <code>code informatique</code></p>

  <h4 id="text_style_sample_output">Brouillon</h4>

  <p>Indique que le texte s&eacute;lectionn&eacute; est une sortie de programme informatique. Ex.&nbsp;: <samp>&eacute;chantillon de code</samp></p>

  <h4 id="text_style_variable">Variable</h4>

  <p>Indique que le texte s&eacute;lectionn&eacute; est une variable. Ex.&nbsp;: <var>variable</var></p>

  <h3 id="text_color">Couleur du texte&hellip;</h3>

  <p>Ouvre la fen&ecirc;tre de s&eacute;lection de couleur pour choisir celle du texte s&eacute;lectionn&eacute;.</p>

  <h3 id="writing_direction">Sens d'&eacute;criture</h3>

  <p>Permet de choisir le sens d'&eacute;criture de gauche &agrave; droite ou de droite &agrave; gauche. Le texte s&eacute;lectionn&eacute; doit faire partie d'un bloc et ne peut &ecirc;tre une s&eacute;lection dans un bloc.</p>

  <h3 id="discontinue_text_styles">Annuler le style de texte</h3>

  <p>Annule l'application de tout style de texte utilis&eacute; &agrave; partir de la position courante du curseur.</p>

  <h3 id="discontinue_link">Annuler le lien</h3>

  <p>Indique que le texte n'est plus un lien &agrave; partir de la position courante du curseur.</p>

  <h3 id="remove_named_anchors">Supprimer les ancres</h3>

  <p>Supprime l'ancre s&eacute;lectionn&eacute;e.</p>

  <h3 id="paragraph">Paragraphe</h3>

  <p>Permet de marquer le texte s&eacute;lectionn&eacute; comme &eacute;tant du corps de texte, un paragraphe, un titre de niveau 1 &agrave; 6, une adresse, du texte pr&eacute;format&eacute; ou un conteneur g&eacute;n&eacute;rique (div).</p>

  <h3 id="list">Liste</h3>

  <p>Permet de cr&eacute;er une liste avec une option pour divers types de listes&nbsp;: Aucune, Puces, Num&eacute;rotation, Terme ou D&eacute;finition. Choisir <q>Propri&eacute;t&eacute;s de la liste</q> ouvre une bo&icirc;te de dialogue pour &eacute;diter manuellement les propri&eacute;t&eacute;s de la liste.</p>

  <h3 id="increase_indent">Augmenter le retrait</h3>

  <p>Augmente le retrait du bloc de texte s&eacute;lectionn&eacute;.</p>

  <h3 id="decrease_indent">Diminuer le retrait</h3>

  <p>Diminue le retrait du bloc de texte s&eacute;lectionn&eacute;.</p>

  <h3 id="align">Aligner</h3>

  <p>Vous permet de choisir l'alignement du texte s&eacute;lectionn&eacute;. Vous pouvez centrer le texte, l'aligner &agrave; gauche ou &agrave; droite ou simplement le justifier.</p>

  <h3 id="positioning_grid">Grille magn&eacute;tique&hellip;</h3>

  <p>Ouvre une bo&icirc;te de dialogue pour d&eacute;finir la r&eacute;solution en pixels pour d&eacute;placer une couche.</p>

  <h3 id="advanced_properties">Propri&eacute;t&eacute;s avanc&eacute;es&hellip;</h3>

  <p>Ouvre l'<q>&Eacute;diteur de propri&eacute;t&eacute;s avanc&eacute;es</q> o&ugrave; vous pouvez &eacute;diter/ajouter manuellement des attributs HTML, des styles ou m&ecirc;me des &eacute;v&eacute;nements JavaScript.</p>

  <h3 id="page_colors_and_background">Couleurs et fond de page&hellip;</h3>

  <p>Ouvre une fen&ecirc;tre pour s&eacute;lectionner la couleur et le fond de page. Les utilisateurs peuvent s&eacute;lectionner la couleur pour le texte normal, le texte des liens, le texte des liens actifs et des liens visit&eacute;s. Vous pouvez &eacute;galement choisir la couleur de fond de page et si vous le d&eacute;sirez, vous pouvez aussi ajouter une image de fond pour votre page Web.</p>

  <h3 id="page_title_and_properties">Titre et propri&eacute;t&eacute;s de la page&hellip;</h3>

  <p>Ouvre la fen&ecirc;tre <q>Propri&eacute;t&eacute;s de la page</q> o&ugrave; vous pouvez ajouter le titre, l'auteur et la description pour votre page Web. Vous pouvez &eacute;galement sp&eacute;cifier la langue, le sens d'&eacute;criture et l'encodage que vous utiliserez pour la page en cours. Pour utiliser cette page en tant que mod&egrave;le, cochez la case <q>Cette page est un mod&egrave;le</q>.</p>

  <p class="returnToSection">[&nbsp;<a href="#menu_reference">Retour au d&eacute;but de la section</a>&nbsp;]</p>

  <h2 id="table">Tableau</h2>

  <p>Ce menu vous permet de cr&eacute;er/&eacute;diter des tableaux dans un document HTML.</p>

  <h3 id="table_insert">Ins&eacute;rer</h3>

  <p>Ouvre un sous-menu avec diverses options pour cr&eacute;er/&eacute;diter des tableaux.</p>

  <h4 id="insert_table">Tableau&hellip;</h4>

  <p>Ouvre une bo&icirc;te de dialogue pour choisir diverses propri&eacute;t&eacute;s du tableau qui sera ins&eacute;r&eacute; &agrave; l'endroit de la position courante du curseur. Les utilisateurs peuvent choisir la taille du tableau en cliquant sur la grille de tableau affich&eacute;e ou en choisissant une taille de tableau pr&eacute;cise. D'autres propri&eacute;t&eacute;s de cellule comme cellspacing, cellpadding, etc. peuvent &ecirc;tre aussi d&eacute;finies.</p>

  <h4 id="insert_row_above">Ligne au-dessus</h4>

  <p>Ins&egrave;re une ligne vide <em>au-dessus</em> de la ligne active courante.</p>

  <h4 id="insert_row_below">Ligne en dessous</h4>
  
  <p>Ins&egrave;re une ligne vide <em>en dessous</em> de la ligne active courante.</p>

  <h4 id="insert_column_before">Colonne avant</h4>

  <p>Ins&egrave;re une colonne vide <em>avant</em> la colonne active courante.</p>

  <h4 id="insert_column_after">Colonne apr&egrave;s</h4>

  <p>Ins&egrave;re une colonne vide <em>apr&egrave;s</em> la colonne active courante.</p>

  <h4 id="insert_cell_before">Cellule avant</h4>

  <p>Ins&egrave;re une cellule vide <em>avant</em> la cellule active courante.</p>

  <h4 id="insert_cell_after">Cellule apr&egrave;s</h4>

  <p>Ins&egrave;re une cellule vide <em>apr&egrave;s</em> la cellule active courante.</p>

  <h3 id="table_select">S&eacute;lectionner</h3>
  
  <p>S&eacute;lectionne divers composants du tableau actif courant pour les &eacute;diter.</p>

  <h4 id="select_table">Tableau</h4>

  <p>S&eacute;lectionne le tableau entier.</p>

  <h4 id="select_row">Ligne</h4>

  <p>S&eacute;lectionne la ligne courante active.</p>

  <h4 id="select_column">Colonne</h4>

  <p>S&eacute;lectionne la colonne courante active.</p>

  <h4 id="select_cell">Cellule</h4>

  <p>S&eacute;lectionne la cellule courante active.</p>

  <h4 id="select_all_cells">Toutes les cellules</h4>

  <p>S&eacute;lectionne toutes les cellules. Ceci est diff&eacute;rent de la s&eacute;lection du tableau en entier, car les modifications seront appliqu&eacute;es individuellement &agrave; toutes cellules plut&ocirc;t qu'au tableau.</p>

  <h3 id="table_delete">Supprimer</h3>

  <p>Ouvre un sous-menu pour supprimer divers composants de tableau.</p>

  <h4 id="delete_table">Tableau</h4>

  <p>Supprime le tableau actif courant. &Agrave; utiliser avec pr&eacute;caution&nbsp;: toutes les donn&eacute;es du tableau seront perdues.</p>

  <h4 id="delete_rows">Ligne(s)</h4>

  <p>Supprime la ligne active courante ou toutes les lignes s&eacute;lectionn&eacute;es du tableau.</p>

  <h4 id="delete_columns">Colonne(s)</h4>

  <p>Supprime la colonne active courante ou toutes les colonnes s&eacute;lectionn&eacute;es du tableau.</p>

  <h4 id="delete_cells">Cellule(s)</h4>

  <p>Supprime la cellule active courante ou toutes les cellules s&eacute;lectionn&eacute;es du tableau.</p>

  <h4 id="delete_cell_contents">Contenu de cellules</h4>

  <p>Supprime le contenu de la cellule active.</p>

  <h3 id="join_with_cell_to_the_right">Fusionner avec la cellule suivante</h3>

  <p>Fusionne la cellule courante du tableau avec la cellule qui la suit imm&eacute;diatement.</p>

  <h3 id="split_cell">Scinder la cellule</h3>

  <p>Scinde une cellule qui a une valeur <tt>colspan</tt> sup&eacute;rieure &agrave; 1.</p>

  <h3 id="create_table_from_selection">Cr&eacute;er un tableau &agrave; partir de la s&eacute;lection</h3>

  <p>Cr&eacute;e un tableau &agrave; partir du texte s&eacute;lectionn&eacute;. Une ligne est cr&eacute;&eacute;e pour chaque paragraphe du texte s&eacute;lectionn&eacute;. Les s&eacute;parations de colonnes peuvent &ecirc;tre choisies&nbsp;: une virgule (,), une espace ( ) ou un caract&egrave;re d&eacute;fini par l'utilisateur.</p>

  <h3 id="table_or_cell_background_color">Couleur de fond de tableau ou de cellule&hellip;</h3>

  <p>Ouvre une bo&icirc;te de dialogue pour &eacute;diter la couleur de fond du tableau ou de la cellule.</p>

  <h3 id="table_properties">Propri&eacute;t&eacute;s du tableau&hellip;</h3>

  <p>Ouvre la fen&ecirc;tre d'&eacute;dition des propri&eacute;t&eacute;s de tableau et de cellules. Vous pouvez changer toutes les propri&eacute;t&eacute;s de tableau et de cellule en utilisant cette simple interface graphique. </p>

  <p class="returnToSection">[&nbsp;<a href="#menu_reference">Retour au d&eacute;but de la section</a>&nbsp;]</p>

  <h2 id="tools">Outils</h2>

  <h3 id="markup_cleaner">Nettoyeur de balises&hellip;</h3>

  <p>Ouvre la fen&ecirc;tre <q>Nettoyeur de balises</q>. Le nettoyeur de balises nettoie le code html en supprimant les balises &lt;br&gt; superflues, les blocs vides, etc.</p>

  <h3 id="validate_html">Validateur de code HTML (W3C)&hellip;</h3>

  <p>Ouvre une fen&ecirc;tre pour montrer les r&eacute;sultats de la validation du document courant donn&eacute;s par <a href="http://validator.w3.org">le validateur HTML du W3C</a>.</p>

  <h3 id="css_editor">&Eacute;diteur CSS&hellip;</h3>

  <p>Ouvre CaScadeS, l'&eacute;diteur de feuilles de style int&eacute;gr&eacute; pour &eacute;diter les r&egrave;gles de style des CSS.</p>

  <h3 id="extensions">Extensions</h3>

  <p>Ouvre le gestionnaire d'extensions qui peut &ecirc;tre utilis&eacute; pour installer ou supprimer des extensions. Les extensions ajoutent de nouvelles fonctionnalit&eacute;s &agrave; &brandShortName;.</p>

  <h3 id="themes">Th&egrave;mes</h3>
  
  <p>Ouvre le gestionnaire de th&egrave;mes qui peut-&ecirc;tre utilis&eacute; pour installer ou d&eacute;sinstaller les th&egrave;mes pour &brandShortName;.</p>

  <h3 id="web_development">D&eacute;veloppement Web</h3>

  <p>Ouvre divers outils int&eacute;gr&eacute;s &agrave; &brandShortName; pour les d&eacute;veloppeurs Web.</p>

  <h4 id="javascript_console">Console Javascript</h4>

  <p>Ouvre la fen&ecirc;tre de la console JavaScript.</p>

  <h4 id="java_console">Console Java</h4>

  <p>Ouvre la fen&ecirc;tre de la console Java.</p>

  <h3 id="preferences">Pr&eacute;f&eacute;rences</h3>
  <p>Ouvre la fen&ecirc;tre <q>Pr&eacute;f&eacute;rences</q> pour modifier les pr&eacute;f&eacute;rences personnelles pour &brandShortName;</p>

  <p class="returnToSection">[&nbsp;<a href="#menu_reference">Retour au d&eacute;but de la section</a>&nbsp;]</p>

  <h2 id="help">Aide</h2>

  <h3 id="help_contents">Contenu de l'aide</h3>

  <p>Ouvre la fen&ecirc;tre d'aide.</p>

  <h3 id="nvu_website">Site Web de &brandShortName; (en)</h3>

  <p>Ouvre le site Web de &brandShortName; dans votre navigateur par d&eacute;faut (site en anglais).</p>

  <h3 id="nvu_faq">FAQ (en)</h3>

  <p>Ouvre la page de la FAQ (Foire aux questions) de &brandShortName; dans votre navigateur par d&eacute;faut (site en anglais).</p>

  <h3 id="bug_reports_and_suggestions">Bugs et suggestions (en)</h3>

  <p>Ouvre la page de bugs et suggestions sur &brandShortName; dans votre navigateur par d&eacute;faut (site en anglais).</p>

  <h3 id="developers_community">Communaut&eacute; des d&eacute;veloppeurs (en)</h3>

  <p>Ouvre le site Web des d&eacute;veloppeurs de &brandShortName; dans votre navigateur par d&eacute;faut (site en anglais)</p>

  <h3 id="localizing_nvu">Traduire &brandShortName; (en)</h3>

  <p>Ouvre la page expliquant comment faire une nouvelle traduction de &brandShortName; (site en anglais).</p>

  <h3 id="forums">Forums</h3>

  <p>Ouvre le site Web des forums sur &brandShortName; dans votre navigateur par d&eacute;faut.</p>

  <h3 id="tip_of_day">Astuce du jour</h3>

  <p>Affiche une petite fen&ecirc;tre contenant l'<q>Astuce du jour</q>.</p>

  <h3 id="about_nvu">&Agrave; propos de &brandShortName;</h3>

  <p>Affiche une bo&icirc;te de dialogue contenant des informations sur &brandShortName;, y compris la version courante et une br&egrave;ve liste des cr&eacute;dits.</p>

  <p class="returnToSection">[&nbsp;<a href="#menu_reference">Retour au d&eacute;but de la section</a>&nbsp;]</p>

  <div class="copyrightBox"><em>21 mars 2005</em></div>

  <p>Copyright &copy; 2004-2005 Contributeurs du Projet &brandShortName; Help Documentation.</p>

    <!--begin frenchmozilla signature-->

    <p><em>Derni&egrave;re traduction&nbsp;: 31 mars 2005</em></p>

    <p>Ce texte a &eacute;t&eacute; traduit et adapt&eacute; par une
    &eacute;quipe internationale de b&eacute;n&eacute;voles francophones.<br />
    Pour plus d'informations, visitez notre site&nbsp;: <a href=
    "http://frenchmozilla.sourceforge.net" hreflang="fr" target=
    "_blank">http://frenchmozilla.sourceforge.net</a>.</p>
    <!--end frenchmozilla signature-->

</body>

</html>
