<?xml version="1.0" encoding="UTF-8"?> <!DOCTYPE html PUBLIC
"-//W3C//DTD XHTML 1.1//EN"
"http://www.w3.org/TR/xhtml11/DTD/xhtml11.dtd"[
<!ENTITY % brandDTD SYSTEM "chrome://global/locale/brand.dtd" >
%brandDTD; ] >

<html xmlns="http://www.w3.org/1999/xhtml"> <head>
<title>Cr&eacute;er des pages Web avec &brandShortName;</title>
<link rel="stylesheet" type="text/css" href="help-fr.css" />
</head>

<body>
<script type="text/javascript">
var isDisplayed = true;

function togglePanel() {
  isDisplayed = !isDisplayed;
  var displayValue = isDisplayed ? "display: block" : "display: none";
  var bodyValue = isDisplayed ? "margin-left: 175px" : "margin-left:5px";

  document.getElementById("contentsBox").setAttribute("style", displayValue);
  document.getElementsByTagName("body").item(0).setAttribute("style", bodyValue);
}
</script>

<table width="100%" id="navTable">
<tr>
<td valign="bottom" width="20"><small><a href="#" onclick="togglePanel();" style="margin-top:10px;">Montrer/cacher</a></small></td>
<td width="72"><img src="chrome://editor/skin/icons/throbber-single.png" width="52" height="52" alt="&brandShortName;" align="left"/></td><td align="left"><span id="topText">Centre d'aide</span></td>
</tr>
</table>

<div id="contentsBox">Dans cette section&nbsp;:
  <a href="composer_help.xhtml#starting_a_new_page">Commencer une nouvelle page</a>

  <a href="formatting_webpages.xhtml">Mettre en forme des pages Web</a>

  <a href="css.xhtml">Utiliser des feuilles de style pour vos pages Web</a>

  <a href="tables.xhtml">Ajouter des tableaux &agrave; votre page Web</a>

  <a href="images.xhtml">Ajouter des images &agrave; votre page Web</a>

  <a href="toc.xhtml">Travailler avec une table des mati&egrave;res sur votre page Web</a>

  <a href="templates.xhtml">Travailler avec des mod&egrave;les</a>

  <a href="page_properties.xhtml">D&eacute;finir les propri&eacute;t&eacute;s de la page</a>

  <a href="links.xhtml">Cr&eacute;er des liens dans &brandShortName;</a>

  <a href="customize.xhtml">Personnaliser &brandShortName;</a>
</div>

<h2 id="setting_page_properties">D&eacute;finir les propri&eacute;t&eacute;s d'une page</h2>

<h3 id="setting_page_properties_and_meta_tags">D&eacute;finir les propri&eacute;t&eacute;s d'une page et les balises Meta</h3>

<p>Utilisez la bo&icirc;te de dialogue <q>Propri&eacute;t&eacute;s de la page</q> pour d&eacute;finir des propri&eacute;t&eacute;s tels que le titre, l'auteur et la description du document sur lequel vous &ecirc;tes en train de travailler. Ces informations sont utiles si vous pr&eacute;voyez d'utiliser la page sur un site Web, puisque les moteurs de recherche utilisent ce type d'informations pour indexer votre page. Vous pouvez voir ces informations &agrave; partir de la fen&ecirc;tre de votre navigateur en ouvrant le menu <span class="menuPath">Edition</span> puis <span class="menuPath">Informations sur la page</span>.</p>

<ol> 
  <li>Ouvrez le menu <span class="menuPath">Format</span> et choisissez <span class="menuPath">Titre et propri&eacute;t&eacute;s de la page&hellip;</span>.</li>

  <li>Modifiez l'une des propri&eacute;t&eacute;s suivantes&nbsp;:</li>

  <li style="list-style-type: none; list-style-position: outside;
      list-style-image: none;"> <ul> <li><strong>Titre</strong>&nbsp;: Tapez le texte que vous voulez voir appara&icirc;tre comme titre de la fen&ecirc;tre quand quelqu'un visionne la page avec un navigateur. C'est la fa&ccedil;on dont la plupart des moteurs de recherche localisent les pages Web, aussi, choisissez un titre qui corresponde au contenu de la page.</li>

      <li><strong>Auteur</strong>&nbsp;: Tapez le nom de la personne qui a cr&eacute;&eacute; le document. Cette information est utile pour les lecteurs qui localisent le document en utilisant un outil de recherche sur le Web qui s'appuie sur le nom de l'auteur.

      <blockquote> <p><strong>Conseil</strong>&nbsp;: Si vous avez saisi le nom de l'auteur dans les <a href="preferences.xhtml#preferences_new_page_settings">Pr&eacute;f&eacute;rences</a> de &brandShortName;, vous n'aurez plus alors &agrave; le saisir &agrave; chaque fois que vous cr&eacute;ez une nouvelle page.</p>
      </blockquote> </li>

      <li><strong>Description</strong>&nbsp;: Entrez une br&egrave;ve description sur le contenu du document.</li>
      </ul>
  </li>
</ol>

<p class="returnToSection">[&nbsp;<a href="#setting_page_properties">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<h3 id="setting_page_colors_and_backgrounds">D&eacute;finir les couleurs de page et de fond</h3>

<p>Vous pouvez changer la couleur de fond ou sp&eacute;cifier une image de fond pour la page sur laquelle vous &ecirc;tes en train de travailler. Ces choix affectent la fa&ccedil;on dont le texte et les liens de votre page apparaissent aux personnes qui visionnent votre page &agrave; l'aide d'un navigateur.</p>

<p>Pour d&eacute;finir les couleurs et le fond de page pour la page en cours, dans la fen&ecirc;tre de &brandShortName;&nbsp;:</p>

<ol>
  <li>Ouvrez le menu <span class="menuPath">Format</span> et choisissez <span class="menuPath">Couleurs et fond de page&hellip;</span>.</li>

  <li>&Eacute;ditez l'une des propri&eacute;t&eacute;s suivantes&nbsp;:</li>

  <li style="list-style-type: none; list-style-position: outside;
      list-style-image: none;"> <ul> <li><strong>Couleurs par d&eacute;faut (celles du navigateur)</strong>&nbsp;: S&eacute;lectionnez ceci si vous voulez que votre page utilise les param&egrave;tres de couleur du navigateur du lecteur pour le texte et les liens.</li>

      <li><strong>Couleurs personnalis&eacute;es</strong>&nbsp;: S&eacute;lectionnez ceci si vous voulez sp&eacute;cifier les couleurs pour le texte et les liens. Pour chaque &eacute;l&eacute;ment, s&eacute;lectionnez une couleur &agrave; partir de la liste d&eacute;roulante. Un exemple de rendu pour chaque type de lien appara&icirc;t dans le panneau de droite.</li>

      <li><strong>Image de fond</strong>&nbsp;: S&eacute;lectionnez ceci si vous voulez que le fond de votre page soit une image. Tapez le nom du fichier image ou cliquez sur <q>Parcourir&hellip;</q> pour chercher l'image sur votre disque dur ou sur le r&eacute;seau.

      <p><strong>Note</strong>&nbsp;: Les images de fond sont empil&eacute;es et recouvrent donc les s&eacute;lections pour la couleur de fond.</p> </li>

      <li><strong>L'URL est relative &agrave; l'adresse de la page</strong>&nbsp;: Si cette option est coch&eacute;e, &brandShortName; convertit l'URL pour qu'elle soit relative &agrave; l'adresse de la page. Ceci est particuli&egrave;rement utile si vous pr&eacute;voyez de publier vos pages sur un serveur Web pour que d'autres personnes puissent les voir. Utiliser des URL relatives vous permet de conserver tous vos fichiers li&eacute;s au m&ecirc;me emplacement relatif les uns par rapport aux autres, sans tenir compte de leur emplacement sur votre disque dur ou sur un serveur Web.
    <p>Si vous d&eacute;cochez cette option, &brandShortName; convertir l'URL en une URL compl&egrave;te (absolue). On utilise g&eacute;n&eacute;ralement des URL absolues pour lier des images pr&eacute;sentes sur d'autres serveurs Web (pas pour des images stock&eacute;es localement sur votre disque dur).</p>
    <p>Si vous n'avez pas encore enregistr&eacute; ou publi&eacute; la page, vous devez d'abord l'enregistrer pour activer cette option.</p>
      </li>
      </ul>
  </li>
</ol>

<p><strong>Note</strong>&nbsp;: Pour appliquer des attributs suppl&eacute;mentaires ou des &eacute;v&eacute;nements JavaScript, cliquez sur <q>&Eacute;dition avanc&eacute;e&hellip;</q> pour afficher l'<a
href="#using_the_advanced_property_editor">&Eacute;diteur des propri&eacute;t&eacute;s avanc&eacute;es</a>.</p>

<p>Vous pouvez &eacute;galement d&eacute;finir la <a href="preferences.xhtml#preferences_new_page_settings">page de fond et les couleurs par d&eacute;faut</a> pour chaque nouvelle page que vous cr&eacute;ez avec &brandShortName;.</p>

<p class="returnToSection">[&nbsp;<a href="#setting_page_properties">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>[&nbsp;<a href="links.xhtml">Suivant</a>&nbsp;] [&nbsp;<a href="templates.xhtml">Pr&eacute;c&eacute;dent</a>&nbsp;]</p>

  <div class="copyrightBox"><em>20 juin 2005</em></div>

  <p>Copyright &copy; 2004-2005 Contributeurs du Projet &brandShortName; Help Documentation.</p>
    <!--begin frenchmozilla signature-->

    <p><em>Derni&egrave;re traduction&nbsp;: 23 juin 2005</em></p>

    <p>Ce texte a &eacute;t&eacute; traduit et adapt&eacute; par une
    &eacute;quipe internationale de b&eacute;n&eacute;voles francophones.<br />
    Pour plus d'informations, visitez notre site&nbsp;: <a href=
    "http://frenchmozilla.sourceforge.net" hreflang="fr" target=
    "_blank">http://frenchmozilla.sourceforge.net</a>.</p>
    <!--end frenchmozilla signature-->

</body>
</html>
