<?xml version="1.0" encoding="UTF-8"?> <!DOCTYPE html PUBLIC
"-//W3C//DTD XHTML 1.1//EN"
"http://www.w3.org/TR/xhtml11/DTD/xhtml11.dtd"[
<!ENTITY % brandDTD SYSTEM "chrome://global/locale/brand.dtd" >
%brandDTD; ] >

<html xmlns="http://www.w3.org/1999/xhtml"> <head>
<title>Cr&eacute;er des pages Web avec &brandShortName;</title>
<link rel="stylesheet" type="text/css" href="chrome://help/skin/helpFileLayout.css"/>
</head>

<body>

<script type="text/javascript">
var isDisplayed = true;

function togglePanel() {
  isDisplayed = !isDisplayed;
  var displayValue = isDisplayed ? "display: block" : "display: none";
  var bodyValue = isDisplayed ? "margin-left: 175px" : "margin-left:5px";

  document.getElementById("contentsBox").setAttribute("style", displayValue);
  document.getElementsByTagName("body").item(0).setAttribute("style", bodyValue);
}
</script>

<table width="100%" id="navTable">
<tr>
<td valign="bottom" width="20"><small><a href="#" onclick="togglePanel();" style="margin-top:10px;">Afficher/Masquer</a></small></td>
<td width="72"><img src="chrome://editor/skin/icons/throbber.png" width="32" height="32" alt="&brandShortName;" align="center"/></td><td align="left"><span id="topText">Centre d'aide</span></td>
</tr>
</table>

<div id="contentsBox">Dans cette section&nbsp;:
  <a href="composer_help.xhtml#starting_a_new_page">Commencer une nouvelle page</a>

  <a href="formatting_webpages.xhtml">Mettre en forme des pages Web</a>

  <a href="css.xhtml">Utiliser des feuilles de style pour vos pages Web</a>

  <a href="tables.xhtml">Ajouter des tableaux &agrave; votre page Web</a>

  <a href="images.xhtml">Ajouter des images &agrave; votre page Web</a>

  <a href="toc.xhtml">Travailler avec une table des mati&egrave;res sur votre page Web</a>

  <a href="templates.xhtml">Travailler avec des mod&egrave;les</a>

  <a href="page_properties.xhtml">D&eacute;finir les propri&eacute;t&eacute;s de la page</a>

  <a href="links.xhtml">Cr&eacute;er des liens dans &brandShortName;</a>

  <a href="customize.xhtml">Personnaliser &brandShortName;</a>
</div>

<h2 id="working_with_table_of_contents_on_your_web_page">Travailler avec des tables de mati&egrave;res sur votre page Web</h2>

<h3 id="adding_table_of_contents_to_your_web_page">Ajouter une table des mati&egrave;res &agrave; votre page Web</h3>

<p>Pour un document html ayant diff&eacute;rentes sections, c'est-&agrave;-dire un article avec des sections et des sous-sections, et des titres pour chaque section et sous-section, il devient difficile de naviguer si tout le texte est d'un seul tenant. Pour mettre en &oelig;uvre une navigation facile dans les diff&eacute;rentes sections, une table des mati&egrave;res peut &ecirc;tre g&eacute;n&eacute;r&eacute;e facilement avec &brandShortName;. Pour g&eacute;n&eacute;rer une table des mati&egrave;res pour un document html&nbsp;:</p>

<ol>
  <li>Utilisez les balises de titres html (h1, h2, h3, h4, h5, et h6) pour libeller les diff&eacute;rents niveaux de sections et sous-sections du document. Puis enregistrez le document.</li>

  <li>Cliquez sur <span class="menuPath"> Insertion > Table des mati&egrave;res</span> et choisissez <q>Ins&eacute;rer</q>. La fen&ecirc;tre <q>Table des mati&egrave;res</q> appara&icirc;tra.</li>

  <li>S&eacute;lectionnez les niveaux de titres utilis&eacute;s pour les diff&eacute;rentes sections et sous-sections dans le document.</li>
  
  <li>Cliquez sur <q>OK</q> pour construire la table des mati&egrave;res.</li>
</ol>

<p>La table des mati&egrave;res g&eacute;n&eacute;r&eacute;e par d&eacute;faut montre toutes les entr&eacute;es num&eacute;rot&eacute;es et des liens pointent vers les ancres des sections respectives. En d&eacute;cochant <q>Num&eacute;roter toutes les entr&eacute;es dans la table des mati&egrave;res</q>, l'affichage se fera sous forme de liste &agrave; puces. En cochant <q>Table des mati&egrave;res en lecture seule</q>, les sections seront affich&eacute;es sous forme de texte simple, sans ancres.</p>

<p class="returnToSection">[&nbsp;<a href="#working_with_table_of_contents_on_your_web_page">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<h3 id="updating_or_removing_table_of_contents">Mettre &agrave; jour ou supprimer une table des mati&egrave;res</h3>

<p>Si le document est modifi&eacute; pour y ajouter plus de sections et de sous-sections apr&egrave;s avoir construit la table des mati&egrave;res, elle ne contiendra pas les nouvelles sections et sous-sections. Pour ajouter ces nouvelles entr&eacute;es, cliquez sur <span class="menuPath">Insertion</span> puis <span class="menuPath">Table des mati&egrave;res</span> et choisissez <span class="menuPath">Mettre &agrave; jour</span>. La table des mati&egrave;res sera mise &agrave; jour pour afficher les nouvelles entr&eacute;es.</p>

<p>Pour supprimer toute la table des mati&egrave;res, cliquez sur <span class="menuPath">Insertion</span>, puis <span class="menuPath">Table des mati&egrave;res</span> et choisissez <span class="menuPath">Supprimer</span>. La table sera supprim&eacute;e et le code source html sera automatiquement nettoy&eacute; de tout code relatif &agrave; la table des mati&egrave;res.</p>

<p class="returnToSection">[&nbsp;<a href="#working_with_table_of_contents_on_your_web_page">Retour au d&eacute;but de la section</a>&nbsp;]</p>

<p>[&nbsp;<a href="templates.xhtml">Suivant</a>&nbsp;] [&nbsp;<a href="images.xhtml">Pr&eacute;c&eacute;dent</a>&nbsp;]</p>

  <div class="copyrightBox"><em>20 juin 2005</em></div>

  <p>Copyright &copy; 2004-2005 Contributeurs du Projet &brandShortName; Help Documentation.</p>
    <!--begin frenchmozilla signature-->

    <p><em>Derni&egrave;re traduction&nbsp;: 23 juin 2005</em></p>

    <p>Ce texte a &eacute;t&eacute; traduit et adapt&eacute; par une
    &eacute;quipe internationale de b&eacute;n&eacute;voles francophones.<br />
    Pour plus d'informations, visitez notre site&nbsp;: <a href=
    "http://frenchmozilla.sourceforge.net" hreflang="fr" target=
    "_blank">http://frenchmozilla.sourceforge.net</a>.</p>
    <!--end frenchmozilla signature-->

</body>
</html>
