#
# ***** BEGIN LICENSE BLOCK *****
# Version: MPL 1.1/GPL 2.0/LGPL 2.1
#
# The contents of this file are subject to the Mozilla Public License Version
# 1.1 (the "License"); you may not use this file except in compliance with
# the License. You may obtain a copy of the License at
# http://www.mozilla.org/MPL/
#
# Software distributed under the License is distributed on an "AS IS" basis,
# WITHOUT WARRANTY OF ANY KIND, either express or implied. See the License
# for the specific language governing rights and limitations under the
# License.
#
# The Original Code is mozilla.org code.
#
# The Initial Developer of the Original Code is
# Netscape Communications Corporation.
# Portions created by the Initial Developer are Copyright (C) 1998
# the Initial Developer. All Rights Reserved.
#
# Contributor(s):
#
# Alternatively, the contents of this file may be used under the terms of
# either the GNU General Public License Version 2 or later (the "GPL"), or
# the GNU Lesser General Public License Version 2.1 or later (the "LGPL"),
# in which case the provisions of the GPL or the LGPL are applicable instead
# of those above. If you wish to allow use of your version of this file only
# under the terms of either the GPL or the LGPL, and not to allow others to
# use your version of this file under the terms of the MPL, indicate your
# decision by deleting the provisions above and replace them with the notice
# and other provisions required by the GPL or the LGPL. If you do not delete
# the provisions above, a recipient may use your version of this file under
# the terms of any one of the MPL, the GPL or the LGPL.
#
# ***** END LICENSE BLOCK *****

SignedBy=\u0645\u0648\u0642\u0651\u0639 \u0645\u0646 \u0642\u0628\u0644 %S
CertPassPrompt=\u0627\u0644\u0631\u0651\u062C\u0627\u0621 \u0625\u062F\u062E\u0627\u0644 \u0643\u0644\u0645\u0629 \u0645\u0631\u0648\u0631 \u0627\u0644\u0623\u0645\u0646 \u0627\u0644\u0634\u0651\u062E\u0635\u064A\u0651\u0629 \u0644\u062C\u0647\u0627\u0632 \u0623\u0645\u0646 \u0627\u0644\u0645\u0641\u0627\u062A\u064A\u062D \u0627\u0644\u062E\u0627\u0635\u0651\u0629 PSM.

#These are for dialogs
#Download Cert dialog
newCAMessage1=\u0647\u0644 \u062A\u0631\u064A\u062F \u0627\u0644\u0648\u062B\u0648\u0642 \u0645\u0646 "%S" \u0644\u0644\u0623\u063A\u0631\u0627\u0636 \u0627\u0644\u062A\u0651\u0627\u0644\u064A\u0629\u061F
unnamedCA=\u0633\u0644\u0637\u0629 \u0627\u0644\u0634\u0651\u0647\u0627\u062F\u0627\u062A (\u063A\u064A\u0631 \u0645\u0633\u0645\u0651\u0627\u0629)

#For editing cert trust
editTrustWindowTitle=\u062A\u062D\u0631\u064A\u0631 \u062B\u0642\u0629 \u0627\u0644\u0634\u0651\u0647\u0627\u062F\u0629
editTrustCA=\u062A\u0645\u062B\u0651\u0644 \u0627\u0644\u0634\u0651\u0647\u0627\u062F\u0629 "%S" \u0633\u0644\u0637\u0629 \u0634\u0647\u0627\u062F\u0627\u062A.
editTrustSSL=\u0623\u0635\u062F\u0631\u062A \u0627\u0644\u0634\u0651\u0647\u0627\u062F\u0629 "%S" \u0645\u0646 \u0642\u0628\u0644:
editTrustEmail=\u0623\u0635\u062F\u0631\u062A \u0627\u0644\u0634\u0651\u0647\u0627\u062F\u0629 "%S" \u0645\u0646 \u0642\u0628\u0644:
issuerNotTrusted=\u0644\u0623\u0646\u0651\u0643 \u0644\u0627 \u062A\u062B\u0642 \u0628\u0633\u0644\u0637\u0629 \u0627\u0644\u0634\u0651\u0647\u0627\u062F\u0627\u062A \u0627\u0644\u062A\u064A \u0623\u0635\u062F\u0631\u062A \u0647\u0630\u0647 \u0627\u0644\u0634\u0651\u0647\u0627\u062F\u0629\u060C \u0641\u0623\u0646\u062A \u0644\u0627 \u062A\u062B\u0642 \u0628\u0635\u062D\u0651\u0629 \u0647\u0630\u0647 \u0627\u0644\u0634\u0651\u0647\u0627\u062F\u0629 \u0625\u0644\u0627 \u0625\u0630\u0627 \u0623\u0634\u0631\u062A \u0628\u0639\u0643\u0633 \u0630\u0644\u0643 \u0647\u0646\u0627.
issuerTrusted=\u0644\u0623\u0646\u0651\u0643 \u062A\u062B\u0642 \u0628\u0633\u0644\u0637\u0629 \u0627\u0644\u0634\u0651\u0647\u0627\u062F\u0627\u062A \u0627\u0644\u062A\u064A \u0623\u0635\u062F\u0631\u062A \u0647\u0630\u0647 \u0627\u0644\u0634\u0651\u0647\u0627\u062F\u0629\u060C \u0641\u0623\u0646\u062A \u062A\u062B\u0642 \u0628\u0635\u062D\u0651\u0629 \u0647\u0630\u0647 \u0627\u0644\u0634\u0651\u0647\u0627\u062F\u0629 \u0625\u0644\u0651\u0627 \u0625\u0630\u0627 \u0623\u0634\u0631\u062A \u0628\u0639\u0643\u0633 \u0630\u0644\u0643 \u0647\u0646\u0627.
issuerNotKnown=\u0644\u0623\u0646\u0651\u0643 \u0644\u0627 \u062A\u0639\u0631\u0641 \u0633\u0644\u0637\u0629 \u0627\u0644\u0634\u0651\u0647\u0627\u062F\u0627\u062A \u0627\u0644\u062A\u064A \u0623\u0635\u062F\u0631\u062A \u0647\u0630\u0647 \u0627\u0644\u0634\u0651\u0647\u0627\u062F\u0629\u060C \u0641\u0623\u0646\u062A \u0644\u0627 \u062A\u062B\u0642 \u0628\u0635\u062D\u0651\u0629 \u0647\u0630\u0647 \u0627\u0644\u0634\u0651\u0647\u0627\u062F\u0629 \u0625\u0644\u0651\u0627 \u0625\u0630\u0627 \u0623\u0634\u0631\u062A \u0628\u0639\u0643\u0633 \u0630\u0644\u0643 \u0647\u0646\u0627.
issuerCertNotFound=\u0644\u0645 \u062A\u0648\u062C\u062F \u0627\u0644\u0634\u0651\u0647\u0627\u062F\u0629 \u0644\u0633\u0644\u0637\u0629 \u0627\u0644\u0634\u0651\u0647\u0627\u062F\u0627\u062A \u0647\u0630\u0647

#For Deleting Certificates
deleteSslCertFlag=deleteSslFlag
deleteSslCertConfirm=\u0647\u0644 \u0623\u0646\u062A \u0645\u062A\u0623\u0643\u0651\u062F \u0623\u0646\u0651\u0643 \u062A\u0631\u064A\u062F \u062D\u0630\u0641 \u0634\u0647\u0627\u062F\u0627\u062A \u0645\u0648\u0627\u0642\u0639 \u0631\u064A\u0628 \u0647\u0630\u0647\u061F
deleteSslCertImpact=\u0625\u0630\u0627 \u062D\u0630\u0641\u062A \u0634\u0647\u0627\u062F\u0629 \u0645\u0648\u0642\u0639 \u0648\u064A\u0628\u060C \u0633\u064A\u064F\u0637\u0644\u0628 \u0645\u0646\u0643 \u0642\u0628\u0648\u0644\u0647\u0627 \u0645\u0631\u0651\u0629 \u062B\u0627\u0646\u064A\u0629 \u0639\u0646\u062F \u0632\u064A\u0627\u0631\u0629 \u0645\u0648\u0642\u0639 \u0648\u064A\u0628 \u0644\u0644\u0645\u0631\u0651\u0629 \u0627\u0644\u062A\u0651\u0627\u0644\u064A\u0629.
deleteSslCertTitle=\u062D\u0630\u0641 \u0634\u0647\u0627\u062F\u0627\u062A \u0645\u0648\u0627\u0642\u0639 \u0648\u064A\u0628

deleteUserCertFlag=deleteUserFlag
deleteUserCertConfirm=\u0647\u0644 \u0623\u0646\u062A \u0645\u062A\u0623\u0643\u0651\u062F \u0623\u0646\u0651\u0643 \u062A\u0631\u064A\u062F \u062D\u0630\u0641 \u0647\u0630\u0647 \u0627\u0644\u0634\u0651\u0647\u0627\u062F\u0627\u062A\u061F
deleteUserCertImpact=\u0625\u0630\u0627 \u062D\u0630\u0641\u062A \u0648\u0627\u062D\u062F\u0629 \u0645\u0646 \u0634\u0647\u0627\u062F\u0627\u062A\u0643\u060C \u0644\u0646 \u062A\u0643\u0648\u0646 \u0642\u0627\u062F\u0631\u0627\u064B \u0639\u0644\u0649 \u062A\u0639\u0631\u064A\u0641 \u0646\u0641\u0633\u0643 \u0628\u0639\u062F \u0627\u0644\u0622\u0646.
deleteUserCertTitle=\u062D\u0630\u0641 \u0634\u0647\u0627\u062F\u0627\u062A\u0643

deleteCaCertFlag=deleteCaFlag
deleteCaCertConfirm=\u0647\u0644 \u0623\u0646\u062A \u0645\u062A\u0623\u0643\u0651\u062F \u0623\u0646\u0651\u0643 \u062A\u0631\u064A\u062F \u062D\u0630\u0641 \u0634\u0647\u0627\u062F\u0627\u062A \u0633\u0644\u0637\u0627\u062A \u0627\u0644\u0634\u0651\u0647\u0627\u062F\u0627\u062A \u0647\u0630\u0647\u061F
deleteCaCertImpact=\u0625\u0630\u0627 \u062D\u0630\u0641\u062A \u0634\u0647\u0627\u062F\u0629 \u0633\u0644\u0637\u0629 \u0634\u0647\u0627\u062F\u0627\u062A\u060C \u0644\u0646 \u064A\u062B\u0642 \u0645\u062A\u0635\u0641\u0651\u062D\u0643 \u0628\u0623\u064A\u0651\u0629 \u0634\u0647\u0627\u062F\u0627\u062A \u0645\u0635\u062F\u0631\u0629 \u0645\u0646 \u0642\u0628\u0644 \u0633\u0644\u0637\u0629 \u0627\u0644\u0634\u0651\u0647\u0627\u062F\u0627\u062A \u062A\u0644\u0643 \u0628\u0639\u062F \u0627\u0644\u0622\u0646.
deleteCaCertTitle=\u062D\u0630\u0641 \u0634\u0647\u0627\u062F\u0627\u062A \u0633\u0644\u0637\u0629 \u0627\u0644\u0634\u0651\u0647\u0627\u062F\u0627\u062A

deleteEmailCertFlag=deleteEmailFlag
deleteEmailCertConfirm=\u0647\u0644 \u0623\u0646\u062A \u0645\u062A\u0623\u0643\u0651\u062F \u0623\u0646\u0651\u0643 \u062A\u0631\u064A\u062F \u062D\u0630\u0641 \u0634\u0647\u0627\u062F\u0627\u062A \u0627\u0644\u0628\u0631\u064A\u062F \u0627\u0644\u0625\u0644\u0643\u062A\u0631\u0648\u0646\u064A \u0644\u0647\u0624\u0644\u0627\u0621 \u0627\u0644\u0627\u0634\u062E\u0627\u0635\u061F
deleteEmailCertImpact=\u0625\u0630\u0627 \u062D\u0630\u0641\u062A \u0634\u0647\u0627\u062F\u0629 \u0628\u0631\u064A\u062F \u0625\u0644\u0643\u062A\u0631\u0648\u0646\u064A\u060C \u0644\u0646 \u062A\u0643\u0648\u0646 \u0642\u0627\u062F\u0631\u0627\u064B \u0639\u0644\u0649 \u0625\u0631\u0633\u0627\u0644 \u0628\u0631\u064A\u062F \u0625\u0644\u0643\u062A\u0631\u0648\u0646\u064A \u0645\u0634\u0641\u0651\u0631 \u0644\u0647\u0624\u0644\u0627\u0621 \u0627\u0644\u0623\u0634\u062E\u0627\u0635 \u0628\u0639\u062F \u0627\u0644\u0622\u0646.
deleteEmailCertTitle=\u062D\u0630\u0641 \u0634\u0647\u0627\u062F\u0627\u062A \u0627\u0644\u0628\u0631\u064A\u062F \u0627\u0644\u0625\u0644\u0643\u062A\u0631\u0648\u0646\u064A


#PKCS#12 file dialogs
chooseP12RestoreFileDialog=\u0627\u0633\u0645 \u0627\u0644\u0645\u0644\u0641\u0651 \u0627\u0644\u0645\u0631\u0627\u062F \u0627\u0633\u062A\u0639\u0627\u062F\u062A\u0647
chooseP12BackupFileDialog=\u0627\u0633\u0645 \u0627\u0644\u0645\u0644\u0641\u0651 \u0627\u0644\u0645\u0631\u0627\u062F \u0646\u0633\u062E\u0647 \u0627\u062D\u062A\u064A\u0627\u0637\u064A\u0651\u0627\u064B
file_browse_PKCS12_spec=\u0645\u0644\u0641\u0651\u0627\u062A PKCS12

#Mismatch Domain Dialg
mismatchDomainMsg1=\u062D\u0627\u0648\u0644\u062A \u062A\u0623\u0633\u064A\u0633 \u0627\u062A\u0651\u0635\u0627\u0644 \u0628\u0640 "%S". \u0648\u0644\u0643\u0646\u0651 \u0634\u0647\u0627\u062F\u0629 \u0627\u0644\u0623\u0645\u0646 \u0627\u0644\u0645\u0642\u062F\u0651\u0645\u0629 \u062A\u0639\u0648\u062F \u0644\u0640 "%S".  \u0645\u0646 \u0627\u0644\u0645\u0645\u0643\u0646\u060C \u0639\u0644\u0649 \u0627\u0644\u0631\u0651\u063A\u0645 \u0623\u0646\u0651\u0647 \u063A\u064A\u0631 \u0645\u062D\u062A\u0645\u0644\u060C \u0623\u0646 \u0634\u062E\u0635\u0627\u064B \u064A\u062D\u0627\u0648\u0644 \u0645\u0642\u0627\u0637\u0639\u0629 \u0627\u062A\u0651\u0635\u0627\u0644\u0643 \u0628\u0645\u0648\u0642\u0639 \u0648\u064A\u0628 \u0647\u0630\u0627.
mismatchDomainMsg2=\u0625\u0630\u0627 \u0634\u0643\u0643\u062A \u0623\u0646\u0651 \u0627\u0644\u0634\u0651\u0647\u0627\u062F\u0629 \u0627\u0644\u0645\u0638\u0647\u0631\u0629 \u0644\u0627 \u062A\u0639\u0648\u062F \u0644\u0640 "%S"\u060C \u0627\u0644\u0631\u0651\u062C\u0627\u0621 \u0625\u0644\u063A\u0627\u0621 \u0627\u0644\u0627\u062A\u0651\u0635\u0627\u0644 \u0648 \u062A\u0646\u0628\u064A\u0647 \u0645\u062F\u064A\u0631 \u0627\u0644\u0645\u0648\u0642\u0639.

#Server Cert expired
serverCertExpiredMsg1="%S" \u0647\u0648 \u0645\u0648\u0642\u0639 \u064A\u0633\u062A\u062E\u062F\u0645 \u0634\u0647\u0627\u062F\u0629 \u0623\u0645\u0646 \u0644\u062A\u0634\u0641\u064A\u0631 \u0627\u0644\u0628\u064A\u0627\u0646\u0627\u062A \u062E\u0644\u0627\u0644 \u0627\u0644\u0625\u0631\u0633\u0627\u0644\u060C \u0625\u0644\u0627 \u0623\u0646\u0651 \u0634\u0647\u0627\u062F\u062A\u0647 \u062A\u0646\u062A\u0647\u064A \u0635\u0644\u0627\u062D\u064A\u0651\u062A\u0647\u0627 \u0641\u064A %S.
serverCertExpiredTitle=\u0627\u0646\u062A\u0647\u062A \u0635\u0644\u0627\u062D\u064A\u0651\u0629 \u0634\u0647\u0627\u062F\u0629 \u0627\u0644\u0646\u0651\u0627\u062F\u0644
serverCertNotYetValedMsg1="%S" \u0647\u0648 \u0645\u0648\u0642\u0639 \u064A\u0633\u062A\u062E\u062F\u0645 \u0634\u0647\u0627\u062F\u0629 \u0623\u0645\u0646 \u0644\u062A\u0634\u0641\u064A\u0631 \u0627\u0644\u0628\u064A\u0627\u0646\u0627\u062A \u062E\u0644\u0627\u0644 \u0627\u0644\u0625\u0631\u0633\u0627\u0644\u060C \u0625\u0644\u0627 \u0623\u0646\u0651 \u0634\u0647\u0627\u062F\u062A\u0647 \u0644\u0646 \u062A\u0643\u0648\u0646 \u0635\u0627\u0644\u062D\u0629 \u062D\u062A\u0651\u0649 %S.
serverCertNotYetValidTitle=\u0634\u0647\u0627\u062F\u0629 \u0627\u0644\u0646\u0651\u0627\u062F\u0644 \u063A\u064A\u0631 \u0635\u0627\u0644\u062D\u0629
serverCertExpiredMsg2=\u0639\u0644\u064A\u0643 \u0627\u0644\u062A\u0623\u0643\u0651\u062F \u0623\u0646 \u0648\u0642\u062A \u0627\u0644\u0643\u0645\u0628\u064A\u0648\u062A\u0631 (\u0645\u0636\u0628\u0648\u0637 \u0644\u0640 %S \u062D\u0627\u0644\u064A\u0651\u0627\u064B) \u0635\u062D\u064A\u062D.

#Preferences
resetPreferences=\u0627\u0633\u062A\u062E\u062F\u0645 \u0647\u0630\u0627 \u0627\u0644\u0632\u0651\u0631\u0651 \u0644\u0625\u0639\u0627\u062F\u0629 \u0636\u0628\u0637 \u062A\u0641\u0636\u064A\u0644\u0627\u062A \u0623\u0645\u0646 %S \u0644\u0625\u0639\u062F\u0627\u062F\u0627\u062A \u0627\u0644\u0645\u0635\u0646\u0639.

#Cert verification
certVerified=\u062A\u0645\u0651 \u0627\u0644\u062A\u062D\u0642\u0651\u0642 \u0645\u0646 \u0647\u0630\u0647 \u0627\u0644\u0634\u0651\u0647\u0627\u062F\u0629 \u0644\u0644\u0627\u0633\u062A\u062E\u062F\u0627\u0645\u0627\u062A \u0627\u0644\u062A\u0651\u0627\u0644\u064A\u0629:
certNotVerified_CertRevoked=\u0644\u0645 \u064A\u0645\u0643\u0646 \u0627\u0644\u062A\u062D\u0642\u0651\u0642 \u0645\u0646 \u0647\u0630\u0647 \u0627\u0644\u0634\u0651\u0647\u0627\u062F\u0629 \u0644\u0623\u0646\u0651\u0647 \u0642\u062F \u062A\u0645\u0651 \u0631\u0641\u0636\u0647\u0627.
certNotVerified_CertExpired=\u0644\u0645 \u064A\u0645\u0643\u0646 \u0627\u0644\u062A\u062D\u0642\u0651\u0642 \u0645\u0646 \u0647\u0630\u0647 \u0627\u0644\u0634\u0651\u0647\u0627\u062F\u0629 \u0644\u0623\u0646\u0651 \u0635\u0644\u0627\u062D\u064A\u0651\u062A\u0647\u0627 \u0642\u062F \u0627\u0646\u062A\u0647\u062A.
certNotVerified_CertNotTrusted=\u0644\u0645 \u064A\u0645\u0643\u0646 \u0627\u0644\u062A\u062D\u0642\u0651\u0642 \u0645\u0646 \u0647\u0630\u0647 \u0627\u0644\u0634\u0651\u0647\u0627\u062F\u0629 \u0644\u0623\u0646\u0651\u0647\u0627 \u063A\u064A\u0631 \u0645\u0648\u062B\u0648\u0642\u0629.
certNotVerified_IssuerNotTrusted=\u0644\u0645 \u064A\u0645\u0643\u0646 \u0627\u0644\u062A\u062D\u0642\u0651\u0642 \u0645\u0646 \u0647\u0630\u0647 \u0627\u0644\u0634\u0651\u0647\u0627\u062F\u0629 \u0644\u0623\u0646\u0651 \u0627\u0644\u0645\u0635\u062F\u0631 \u063A\u064A\u0631 \u0645\u0648\u062B\u0648\u0642.
certNotVerified_IssuerUnknown=\u0644\u0645 \u064A\u0645\u0643\u0646 \u0627\u0644\u062A\u062D\u0642\u0651\u0642 \u0645\u0646 \u0647\u0630\u0647 \u0627\u0644\u0634\u0651\u0647\u0627\u062F\u0629 \u0644\u0623\u0646\u0651 \u0627\u0644\u0645\u0635\u062F\u0631 \u063A\u064A\u0631 \u0645\u0639\u0631\u0648\u0641.
certNotVerified_CAInvalid=\u0644\u0645 \u064A\u0645\u0643\u0646 \u0627\u0644\u062A\u062D\u0642\u0651\u0642 \u0645\u0646 \u0647\u0630\u0647 \u0627\u0644\u0634\u0651\u0647\u0627\u062F\u0629 \u0644\u0623\u0646\u0651 \u0634\u0647\u0627\u062F\u0629 \u0633\u0644\u0637\u0629 \u0627\u0644\u0634\u0651\u0647\u0627\u062F\u0627\u062A \u063A\u064A\u0631 \u0635\u0627\u0644\u062D\u0629.
certNotVerified_Unknown=\u0644\u0645 \u064A\u0645\u0643\u0646 \u0627\u0644\u062A\u062D\u0642\u0651\u0642 \u0645\u0646 \u0647\u0630\u0647 \u0627\u0644\u0634\u0651\u0647\u0627\u062F\u0629 \u0644\u0623\u0633\u0628\u0627\u0628 \u063A\u064A\u0631 \u0645\u0639\u0631\u0648\u0641\u0629.

#Client auth
clientAuthMessage1=\u0627\u0644\u0645\u0646\u0638\u0651\u0645\u0629: "%S"
clientAuthMessage2=\u0645\u0635\u062F\u0631\u0629 \u062A\u062D\u062A: "%S"

#Page Info
pageInfo_SiteNotVerified=\u0644\u0645 \u064A\u062A\u0645\u0651 \u0627\u0644\u062A\u0651\u062D\u0642\u0642 \u0645\u0646 \u0647\u0648\u064A\u0651\u0629 \u0645\u0648\u0642\u0639 \u0648\u064A\u0628
pageInfo_WebSiteVerified=\u062A\u0645\u0651 \u0627\u0644\u062A\u0651\u062D\u0642\u0642 \u0645\u0646 \u0647\u0648\u064A\u0651\u0629 \u0645\u0648\u0642\u0639 \u0648\u064A\u0628
pageInfo_Identity_Verified=\u064A\u062F\u0639\u0645 \u0645\u0648\u0642\u0639 \u0648\u064A\u0628 %S \u0627\u0644\u062A\u0648\u062B\u0651\u0642 \u0644\u0635\u0641\u062D\u0629 \u0648\u064A\u0628 \u0627\u0644\u062A\u064A \u062A\u0639\u0631\u0636\u0647\u0627. \u062A\u0645\u0651 \u0627\u0644\u062A\u062D\u0642\u0651\u0642 \u0645\u0646 \u0647\u0648\u064A\u0651\u0629 \u0645\u0648\u0642\u0639 \u0648\u064A\u0628 \u0645\u0646 \u0642\u0628\u0644 %S\u060C \u0648 \u0647\u064A \u0633\u0644\u0637\u0629 \u0634\u0647\u0627\u062F\u0627\u062A \u062A\u062B\u0642 \u0628\u0647\u0627 \u0644\u0647\u0630\u0627 \u0627\u0644\u063A\u0631\u0636.
pageInfo_ViewCertificate=\u0639\u0631\u0636 \u0634\u0647\u0627\u062F\u0629 \u0627\u0644\u0623\u0645\u0646 \u0627\u0644\u062A\u064A \u062A\u062A\u062D\u0642\u0651\u0642 \u0645\u0646 \u0647\u0648\u064A\u0651\u0629 \u0645\u0648\u0642\u0639 \u0648\u064A\u0628 \u0647\u0630\u0627.
pageInfo_NoEncryption=\u0627\u0644\u0627\u062A\u0651\u0635\u0627\u0644 \u063A\u064A\u0631 \u0645\u0634\u0641\u0651\u0631
pageInfo_Privacy_None1=\u0644\u0627 \u064A\u062F\u0639\u0645 \u0645\u0648\u0642\u0639 \u0648\u064A\u0628 %S \u0627\u0644\u062A\u0651\u0634\u0641\u064A\u0631 \u0644\u0644\u0635\u0651\u0641\u062D\u0629 \u0627\u0644\u062A\u064A \u062A\u0639\u0631\u0636\u0647\u0627.
pageInfo_Privacy_None2=\u064A\u0645\u0643\u0646 \u0631\u0624\u064A\u0629 \u0627\u0644\u0645\u0639\u0644\u0648\u0645\u0627\u062A \u0627\u0644\u0645\u0631\u0633\u0644\u0629 \u0639\u0628\u0631 \u0627\u0646\u062A\u0631\u0646\u062A \u062F\u0648\u0646 \u062A\u0634\u0641\u064A\u0631 \u0645\u0646 \u0642\u0628\u0644 \u0627\u0644\u0646\u0651\u0627\u0633 \u0627\u0644\u0622\u062E\u0631\u064A\u0646 \u0623\u062B\u0646\u0627\u0621 \u0625\u0631\u0633\u0627\u0644\u0647\u0627.
pageInfo_Privacy_None3=\u0627\u0644\u0635\u0651\u0641\u062D\u0629 \u0627\u0644\u062A\u064A \u062A\u0639\u0631\u0636\u0647\u0627 \u063A\u064A\u0631 \u0645\u0634\u0641\u0651\u0631\u0629.
pageInfo_StrongEncryption=\u0627\u0644\u0627\u062A\u0651\u0635\u0627\u0644 \u0645\u0634\u0641\u0651\u0631: \u062A\u0634\u0641\u064A\u0631 \u0639\u0627\u0644\u064A \u0627\u0644\u0645\u0633\u062A\u0648\u0649 (%S %S \u0628\u062A)
pageInfo_Privacy_Strong1=\u0634\u064F\u0641\u0651\u0631\u062A \u0627\u0644\u0635\u0651\u0641\u062D\u0629 \u0627\u0644\u062A\u064A \u062A\u0639\u0631\u0636\u0647\u0627 \u0642\u0628\u0644 \u0625\u0631\u0633\u0627\u0644\u0647\u0627 \u0639\u0628\u0631 \u0627\u0644\u0627\u0646\u062A\u0631\u0646\u062A.
pageInfo_Privacy_Strong2=\u064A\u062C\u0639\u0644 \u0627\u0644\u062A\u0651\u0634\u0641\u064A\u0631 \u0639\u0631\u0636 \u0627\u0644\u0645\u0639\u0644\u0648\u0645\u0627\u062A \u0627\u0644\u0645\u0631\u0633\u0644\u0629 \u0628\u064A\u0646 \u0627\u0644\u0643\u0645\u0628\u064A\u0648\u062A\u0631\u0627\u062A \u0645\u0646 \u0642\u0628\u0644 \u0627\u0644\u0623\u0634\u062E\u0627\u0635 \u063A\u064A\u0631 \u0627\u0644\u0645\u062E\u0648\u0651\u0644\u064A\u0646 \u0635\u0639\u0628\u0627\u064B \u062C\u062F\u0651\u0627\u064B. \u0645\u0646 \u063A\u064A\u0631 \u0627\u0644\u0645\u062D\u062A\u0645\u0644 \u0623\u0646\u0651 \u0634\u062E\u0635\u0627\u064B \u0645\u0627 \u064A\u0642\u0631\u0623 \u0647\u0630\u0647 \u0627\u0644\u0635\u0651\u0641\u062D\u0629 \u0628\u064A\u0646\u0645\u0627 \u062A\u0631\u0633\u0644 \u0639\u0628\u0631 \u0627\u0644\u0634\u0651\u0628\u0643\u0629.
pageInfo_WeakEncryption=\u0627\u0644\u0627\u062A\u0651\u0635\u0627\u0644 \u0645\u0634\u0641\u0651\u0631: \u062A\u0634\u0641\u064A\u0631 \u0645\u0646\u062E\u0641\u0636 \u0627\u0644\u0645\u0633\u062A\u0648\u0649 (%S %S \u0628\u062A)
pageInfo_Privacy_Weak1=\u064A\u0633\u062A\u062E\u062F\u0645 \u0645\u0648\u0642\u0639 \u0648\u064A\u0628 %S \u062A\u0634\u0641\u064A\u0631 \u0645\u0646\u062E\u0641\u0636 \u0627\u0644\u0645\u0633\u062A\u0648\u0649 \u0644\u0644\u0635\u0641\u062D\u0629 \u0627\u0644\u062A\u064A \u062A\u0639\u0631\u0636\u0647\u0627.
pageInfo_Privacy_Weak2=\u0642\u062F \u064A\u0633\u0645\u062D \u0627\u0644\u062A\u0651\u0634\u0641\u064A\u0631 \u0645\u0646\u062E\u0641\u0636 \u0627\u0644\u0645\u0633\u062A\u0648\u0649 \u0644\u0628\u0639\u0636 \u0627\u0644\u0623\u0634\u062E\u0627\u0635 \u063A\u064A\u0631 \u0627\u0644\u0645\u062E\u0648\u0651\u0644\u064A\u0646 \u0628\u0639\u0631\u0636 \u0627\u0644\u0645\u0639\u0644\u0648\u0645\u0627\u062A.
pageInfo_MixedContent=\u0627\u0644\u0627\u062A\u0651\u0635\u0627\u0644 \u0645\u0634\u0641\u0651\u0631 \u062C\u0632\u0626\u064A\u0651\u0627
pageInfo_Privacy_Mixed1=\u0623\u062C\u0632\u0627\u0621 \u0645\u0646 \u0627\u0644\u0635\u0651\u0641\u062D\u0629 \u0627\u0644\u062A\u064A \u062A\u0639\u0631\u0636\u0647\u0627 \u0644\u0645 \u062A\u0634\u0641\u0651\u0631 \u0642\u0628\u0644 \u0625\u0631\u0633\u0627\u0644\u0647\u0627 \u0639\u0628\u0631 \u0627\u0644\u0627\u0646\u062A\u0631\u0646\u062A.

#Cert Viewer
certDetails=\u0639\u0627\u0631\u0636 \u0627\u0644\u0634\u0651\u0647\u0627\u062F\u0629:
notPresent=<\u0644\u064A\u0633 \u062C\u0632\u0621\u0627\u064B \u0645\u0646 \u0627\u0644\u0634\u0651\u0647\u0627\u062F\u0629>
unknownIssuer=<\u0645\u0635\u062F\u0631 \u063A\u064A\u0631 \u0645\u0639\u0631\u0648\u0641>

escrowFinalMessage=\u0639\u0644\u064A\u0643 \u0636\u063A\u0637 \u0645\u0648\u0627\u0641\u0642 \u0641\u0642\u0637 \u0625\u0630\u0627 \u0643\u0646\u062A \u062A\u062B\u0642 \u0628\u0640 "%S" \u0644\u062D\u0645\u0627\u064A\u0629 \u0645\u0641\u062A\u0627\u062D \u062A\u0634\u0641\u064A\u0631\u0643 \u0627\u0644\u062E\u0627\u0635\u0651.

#Token Manager
password_not_set=(\u063A\u064A\u0631 \u0645\u0636\u0628\u0648\u0637)
failed_pw_change=\u0644\u0627 \u064A\u0645\u0643\u0646 \u062A\u063A\u064A\u064A\u0631 \u0643\u0644\u0645\u0629 \u0627\u0644\u0645\u0631\u0648\u0631 \u0627\u0644\u0631\u0651\u0626\u064A\u0633\u064A\u0651\u0629.
incorrect_pw=\u0644\u0645 \u062A\u062F\u062E\u0644 \u0643\u0644\u0645\u0629 \u0627\u0644\u0645\u0631\u0648\u0631 \u0627\u0644\u0631\u0651\u0626\u064A\u0633\u064A\u0651\u0629 \u0627\u0644\u0635\u0651\u062D\u064A\u062D\u0629. \u0627\u0644\u0631\u0651\u062C\u0627\u0621 \u0627\u0644\u0645\u062D\u0627\u0648\u0644\u0629 \u0645\u0631\u0651\u0629 \u062B\u0627\u0646\u064A\u0629.
pw_change_ok=\u063A\u064F\u064A\u0651\u0631\u062A \u0643\u0644\u0645\u0629 \u0627\u0644\u0645\u0631\u0648\u0631 \u0627\u0644\u0631\u0651\u0626\u064A\u0633\u064A\u0651\u0629 \u0628\u0646\u062C\u0627\u062D.
pw_erased_ok=\u062A\u062D\u0630\u064A\u0631! \u062D\u0630\u0641\u062A \u0643\u0644\u0645\u0629 \u0645\u0631\u0648\u0631\u0643 \u0627\u0644\u0631\u0651\u0626\u064A\u0633\u064A\u0651\u0629.
pw_not_wanted=\u062A\u062D\u0630\u064A\u0631! \u0642\u0631\u0651\u0631\u062A \u0639\u062F\u0645 \u0627\u0633\u062A\u062E\u062F\u0627\u0645 \u0643\u0644\u0645\u0629 \u0645\u0631\u0648\u0631 \u0631\u0626\u064A\u0633\u064A\u0651\u0629.
pw_empty_warning=\u0644\u0646 \u062A\u0643\u0648\u0646 \u0643\u0644\u0645\u0627\u062A \u0645\u0631\u0648\u0631 \u0648\u064A\u0628 \u0648 \u0627\u0644\u0628\u0631\u064A\u062F \u0627\u0644\u0625\u0644\u0643\u062A\u0631\u0648\u0646\u064A\u060C \u0628\u064A\u0627\u0646\u0627\u062A \u0627\u0644\u0627\u0633\u062A\u0645\u0627\u0631\u0627\u062A\u060C \u0648 \u0627\u0644\u0645\u0641\u0627\u062A\u064A\u062D \u0627\u0644\u0639\u0627\u0645\u0651\u0629 \u0627\u0644\u0645\u062E\u0632\u0651\u0646\u0629 \u0645\u062D\u0645\u064A\u0651\u0629.
pw_change2empty_in_fips_mode=\u0623\u0646\u062A \u062D\u0627\u0644\u064A\u0651\u0627\u064B \u0641\u064A \u0648\u0636\u0639 FIPS. \u064A\u062A\u0637\u0644\u0651\u0628 FIPS \u0643\u0644\u0645\u0629 \u0645\u0631\u0648\u0631 \u063A\u064A\u0631 \u0641\u0627\u0631\u063A\u0629.
login_failed=\u0641\u0634\u0644 \u062A\u0633\u062C\u064A\u0644 \u0627\u0644\u062F\u0651\u062E\u0648\u0644
loadPK11TokenDialog=\u0627\u0646\u062A\u0642\u064D \u062C\u0647\u0627\u0632 PKCS#11 \u0644\u064A\u062D\u0645\u0651\u0644
devinfo_modname=\u0627\u0644\u0648\u062D\u062F\u0629
devinfo_modpath=\u0627\u0644\u0645\u0633\u0627\u0631
devinfo_label=\u0639\u0644\u0627\u0645\u0629
devinfo_manID=\u0627\u0644\u0645\u0635\u0646\u0651\u0639
devinfo_serialnum=\u0627\u0644\u0631\u0651\u0642\u0645 \u0627\u0644\u062A\u0651\u0633\u0644\u0633\u0644\u064A
devinfo_hwversion=\u0625\u0635\u062F\u0627\u0631 HW
devinfo_fwversion=\u0625\u0635\u062F\u0627\u0631 FW
devinfo_status=\u0627\u0644\u062D\u0627\u0644\u0629
devinfo_desc=\u0627\u0644\u0648\u0635\u0641
devinfo_stat_disabled=\u0645\u0639\u0637\u0651\u0644
devinfo_stat_notpresent=\u063A\u064A\u0631 \u062D\u0627\u0636\u0631
devinfo_stat_uninitialized=\u063A\u064A\u0631 \u0645\u0647\u064A\u0651\u0623
devinfo_stat_notloggedin=\u063A\u064A\u0631 \u0645\u0633\u062C\u0651\u0644 \u062F\u062E\u0648\u0644
devinfo_stat_loggedin=\u0645\u0633\u062C\u0651\u0644 \u062F\u062E\u0648\u0644
devinfo_stat_ready=\u062C\u0627\u0647\u0632
enable_fips=\u062A\u0645\u0643\u064A\u0646 FIPS
disable_fips=\u062A\u0639\u0637\u064A\u0644 FIPS
fips_nonempty_password_required=\u064A\u062A\u0637\u0644\u0651\u0628 \u0648\u0636\u0639 FIPS \u0648\u062C\u0648\u062F \u0643\u0644\u0645\u0629 \u0645\u0631\u0648\u0631 \u0631\u0626\u064A\u0633\u064A\u0651\u0629 \u0644\u0643\u0644\u0651 \u062C\u0647\u0627\u0632 \u0623\u0645\u0646. \u0627\u0644\u0631\u0651\u062C\u0627\u0621 \u0636\u0628\u0637 \u0643\u0644\u0645\u0629 \u0627\u0644\u0645\u0631\u0648\u0631 \u0642\u0628\u0644 \u062A\u0645\u0643\u064A\u0646 \u0648\u0636\u0639 FIPS.

# CRL next update.
crlNextUpdateMsg1=\u0644\u0627 \u064A\u0633\u062A\u0637\u064A\u0639 %S \u062A\u0623\u0633\u064A\u0633 \u0627\u062A\u0651\u0635\u0627\u0644 \u0645\u0634\u0641\u0651\u0631 \u0645\u0639 "%S".
crlNextUpdateMsg2=\u062A\u062D\u062A\u0627\u062C CRL \u0645\u0646 "%S" \u0644\u0644\u062A\u0651\u062D\u062F\u064A\u062B.
NoUpdateFailure=\u0644\u0627 \u0634\u064A\u0621
lastFetchUrlLabel=\u062C\u064F\u0644\u0628 \u0627\u0644\u0639\u0646\u0648\u0627\u0646 \u0628\u0627\u0644\u0623\u0635\u0644 \u0645\u0646
advertisedUrlLabel=\u0627\u0644\u0639\u0646\u0648\u0627\u0646 \u0627\u0644\u0645\u0639\u0644\u0646 \u0639\u0646\u0647 \u0645\u0646 \u0633\u0644\u0637\u0629 \u0627\u0644\u0634\u0651\u0647\u0627\u062F\u0627\u062A
CrlUpdatePrefsSetConfirmation=\u0633\u062A\u0623\u062E\u0630 \u062A\u0641\u0636\u064A\u0644\u0627\u062A \u0627\u0644\u062A\u0651\u062D\u062F\u064A\u062B \u0627\u0644\u0622\u0644\u064A \u062A\u0623\u062B\u064A\u0631\u0647\u0627 \u0639\u0646\u062F \u0625\u0639\u0627\u062F\u0629 \u0628\u062F\u0621 \u0627\u0644\u0645\u0633\u062A\u0639\u0631\u0636.
crlAutoUpdateDayCntError=\u064A\u062C\u0628 \u0623\u0646 \u064A\u0643\u0648\u0646 \u0639\u062F\u062F \u0627\u0644\u0623\u064A\u0627\u0645 \u0642\u0628\u0644 \u0627\u0644\u062A\u0651\u062D\u062F\u064A\u062B \u0627\u0644\u062A\u0651\u0627\u0644\u064A \u0631\u0642\u0645\u0627\u064B \u0623\u0643\u0628\u0631 \u0645\u0646 \u0627\u0644\u0635\u0651\u0641\u0631.
crlAutoUpdtaeFreqCntError=\u064A\u062C\u0628 \u0623\u0646 \u064A\u0643\u0648\u0646 \u062A\u0631\u062F\u0651\u062F \u0627\u0644\u062A\u0651\u062D\u062F\u064A\u062B \u0631\u0642\u0645\u0627\u064B \u0623\u0643\u0628\u0631 \u0645\u0646 \u0627\u0644\u0635\u0651\u0641\u0631.
disabledStatement=\u0627\u0644\u062A\u0651\u062D\u062F\u064A\u062B \u0627\u0644\u0622\u0644\u064A \u063A\u064A\u0631 \u0645\u0645\u0643\u0651\u0646 \u0644\u0640 CRL \u0647\u0630\u0627.
enabledStatement=\u0627\u0644\u062A\u0651\u062D\u062F\u064A\u062B \u0627\u0644\u0622\u0644\u064A \u0645\u0645\u0643\u0651\u0646 \u0644\u0640 CRL \u0647\u0630\u0627.
crlAutoupdateQuestion1=\u0647\u0644 \u062A\u0631\u064A\u062F \u062A\u0645\u0643\u064A\u0646 \u0627\u0644\u062A\u0651\u062D\u062F\u064A\u062B \u0627\u0644\u0622\u0644\u064A\u061F
crlAutoupdateQuestion2=\u0647\u0644 \u062A\u0631\u064A\u062F \u0639\u0631\u0636 \u0625\u0639\u062F\u0627\u062F\u0627\u062A \u0627\u0644\u062A\u0651\u062D\u062F\u064A\u062B \u0627\u0644\u0622\u0644\u064A\u061F
undefinedValStr=<\u063A\u064A\u0631 \u0645\u0639\u0631\u0651\u0641>
undefinedURL=\u0639\u0646\u0648\u0627\u0646 \u0627\u0644\u062A\u0651\u062D\u062F\u064A\u062B \u0627\u0644\u0622\u0644\u064A \u063A\u064A\u0631 \u0645\u0639\u0631\u0651\u0641.
yesButton=\u0646\u0639\u0645
noButton=\u0644\u0627
resetPasswordConfirmationTitle=\u0625\u0639\u0627\u062F\u0629 \u0636\u0628\u0637 \u0643\u0644\u0645\u0629 \u0627\u0644\u0645\u0631\u0648\u0631 \u0627\u0644\u0631\u0651\u0626\u064A\u0633\u064A\u0629
resetPasswordConfirmationMessage=\u062A\u0645\u0651 \u0625\u0639\u0627\u062F\u0629 \u0636\u0628\u0637 \u0643\u0644\u0645\u0629 \u0645\u0631\u0648\u0631\u0643.
crlAutoupdateEnabled=\u0645\u0645\u0643\u0651\u0646
crlAutoupdateNotEnabled=\u063A\u064A\u0631 \u0645\u0645\u0643\u0651\u0646
crlAutoupdateOk=\u0645\u0648\u0627\u0641\u0642
crlAutoupdateFailed=\u0641\u0634\u0644
crlImportNewCRLTitle=\u0627\u0633\u062A\u064A\u0631\u0627\u062F CRL
crlImportNewCRLLabel=\u0627\u0633\u062A\u064A\u0631\u0627\u062F CRL \u0645\u0646:

#Import certificate(s) file dialog
importEmailCertPrompt=\u0627\u0646\u062A\u0642\u064D \u0627\u0644\u0645\u0644\u0641\u0651 \u0627\u0644\u0630\u064A \u064A\u062D\u062A\u0648\u064A \u0639\u0644\u0649 \u0634\u0647\u0627\u062F\u0629 \u0627\u0644\u0628\u0631\u064A\u062F \u0627\u0644\u0625\u0644\u0643\u062A\u0631\u0648\u0646\u064A \u0644\u0634\u062E\u0635 \u0645\u0627 \u0644\u064A\u062A\u0645\u0651 \u0627\u0633\u062A\u064A\u0631\u0627\u062F\u0647
importCACertsPrompt=\u0627\u0646\u062A\u0642\u064D \u0627\u0644\u0645\u0644\u0641\u0651 \u0627\u0644\u0630\u064A \u064A\u062D\u062A\u0648\u064A \u0639\u0644\u0649 \u0634\u0647\u0627\u062F\u0629 \u0633\u0644\u0637\u0629 \u0627\u0644\u0634\u0651\u0647\u0627\u062F\u0627\u062A \u0644\u064A\u062A\u0645\u0651 \u0627\u0633\u062A\u064A\u0631\u0627\u062F\u0647
importWebSiteCertPrompt=\u0627\u0646\u062A\u0642\u064D \u0627\u0644\u0645\u0644\u0641\u0651 \u0627\u0644\u0630\u064A \u064A\u062D\u062A\u0648\u064A \u0639\u0644\u0649 \u0634\u0647\u0627\u062F\u0629 \u0645\u0648\u0642\u0639 \u0648\u064A\u0628 \u0644\u064A\u062A\u0645\u0651 \u0627\u0633\u062A\u064A\u0631\u0627\u062F\u0647
file_browse_Certificate_spec=\u0645\u0644\u0641\u0651\u0627\u062A \u0627\u0644\u0634\u0651\u0647\u0627\u062F\u0629

# Form Signing confirmation prompt
formSigningIntro=\u0637\u0644\u0628 \u0627\u0644\u0645\u0648\u0642\u0639 '%S' \u0623\u0646 \u062A\u0648\u0642\u0651\u0639 \u0627\u0644\u0631\u0651\u0633\u0627\u0644\u0629 \u0627\u0644\u0646\u0651\u0635\u0651\u064A\u0651\u0629 \u0627\u0644\u062A\u0651\u0627\u0644\u064A\u0629:
