# ***** BEGIN LICENSE BLOCK *****
# Version: MPL 1.1/GPL 2.0/LGPL 2.1
#
# The contents of this file are subject to the Mozilla Public License Version
# 1.1 (the "License"); you may not use this file except in compliance with
# the License. You may obtain a copy of the License at
# http://www.mozilla.org/MPL/
#
# Software distributed under the License is distributed on an "AS IS" basis,
# WITHOUT WARRANTY OF ANY KIND, either express or implied. See the License
# for the specific language governing rights and limitations under the
# License.
#
# The Original Code is mozilla.org code.
#
# The Initial Developer of the Original Code is
# Netscape Communications Corporation.
# Portions created by the Initial Developer are Copyright (C) 1998
# the Initial Developer. All Rights Reserved.
#
# Contributor(s):
#	Zbigniew Braniecki <gandalf@aviary.pl>
#	Marek Stepien <marcoos@aviary.pl>
#
# Alternatively, the contents of this file may be used under the terms of
# either of the GNU General Public License Version 2 or later (the "GPL"),
# or the GNU Lesser General Public License Version 2.1 or later (the "LGPL"),
# in which case the provisions of the GPL or the LGPL are applicable instead
# of those above. If you wish to allow use of your version of this file only
# under the terms of either the GPL or the LGPL, and not to allow others to
# use your version of this file under the terms of the MPL, indicate your
# decision by deleting the provisions above and replace them with the notice
# and other provisions required by the GPL or the LGPL. If you do not delete
# the provisions above, a recipient may use your version of this file under
# the terms of any one of the MPL, the GPL or the LGPL.
#
# ***** END LICENSE BLOCK *****

malformedURI=\u0639\u0646\u0648\u0627\u0646 URL \u0647\u0630\u0627 \u063A\u064A\u0631 \u0635\u062D\u064A\u062D \u0648\u0644\u0627 \u064A\u0645\u0643\u0646 \u062A\u062D\u0645\u064A\u0644\u0647.
fileNotFound=\u0644\u0627 \u064A\u0645\u0643\u0646 \u0627\u0644\u0639\u062B\u0648\u0631 \u0639\u0644\u0649 \u0627\u0644\u0645\u0644\u0641\u0651 %S. \u0627\u0644\u0631\u0651\u062C\u0627\u0621 \u0627\u0644\u062A\u0651\u062D\u0642\u0651\u0642 \u0645\u0646 \u0627\u0644\u0645\u0648\u0642\u0639 \u0648 \u0627\u0644\u0645\u062D\u0627\u0648\u0644\u0629 \u0645\u062C\u062F\u0651\u062F\u0627\u064B.
dnsNotFound=\u0644\u0645 \u064A\u0645\u0643\u0646 \u0627\u0644\u0639\u062B\u0648\u0631 \u0639\u0644\u0649 %S. \u0627\u0644\u0631\u0651\u062C\u0627\u0621 \u0627\u0644\u062A\u0651\u062D\u0642\u0651\u0642 \u0645\u0646 \u0627\u0644\u0627\u0633\u0645 \u0648 \u0627\u0644\u0645\u062D\u0627\u0648\u0644\u0629 \u0645\u062C\u062F\u0651\u062F\u0627\u064B.
protocolNotFound=%S \u0644\u064A\u0633 \u0628\u0631\u0648\u062A\u0648\u0643\u0648\u0644\u0627\u064B \u0645\u0633\u062C\u0651\u0644\u0627\u064B.
connectionFailure=\u0631\u0641\u0636 \u0627\u0644\u0627\u062A\u0651\u0635\u0627\u0644 \u0623\u062B\u0646\u0627\u0621 \u0645\u062D\u0627\u0648\u0644\u0629 \u0627\u0644\u0627\u062A\u0651\u0635\u0627\u0644 \u0645\u0639 %S.
netInterrupt=\u0642\u0637\u0639 \u0627\u0644\u0627\u062A\u0651\u0635\u0627\u0644 \u0645\u0639 %S \u0641\u062C\u0623\u0629\u064B. \u0642\u062F \u062A\u0643\u0648\u0646 \u0628\u0639\u0636 \u0627\u0644\u0628\u064A\u0627\u0646\u0627\u062A \u0642\u062F \u0646\u0642\u0644\u062A.
netTimeout=\u0627\u0646\u062A\u0647\u062A \u0645\u0647\u0644\u0629 \u0627\u0644\u0639\u0645\u0644\u064A\u0651\u0629 \u0623\u062B\u0646\u0627\u0621 \u0645\u062D\u0627\u0648\u0644\u0629 \u0627\u0644\u0627\u062A\u0651\u0635\u0627\u0644 \u0628\u0640 %S.
redirectLoop=\u062A\u062C\u0627\u0648\u0632\u062A \u062D\u062F\u0651 \u0625\u0639\u0627\u062F\u0629 \u0627\u0644\u062A\u0651\u0648\u062C\u064A\u0647 \u0644\u0639\u0646\u0648\u0627\u0646 URL \u0647\u0630\u0627. \u0644\u0627 \u064A\u0645\u0643\u0646 \u062A\u062D\u0645\u064A\u0644 \u0627\u0644\u0635\u0651\u0641\u062D\u0629 \u0627\u0644\u0645\u0637\u0644\u0648\u0628\u0629. \u0642\u062F \u062A\u0643\u0648\u0646 \u0627\u0644\u0643\u0648\u0643\u064A\u0632 \u0627\u0644\u0645\u062D\u062C\u0648\u0628\u0629 \u0633\u0628\u0628 \u0647\u0630\u0627.
repost=\u062A\u062D\u062A\u0648\u064A \u0627\u0644\u0635\u0651\u0641\u062D\u0629 \u0627\u0644\u062A\u064A \u062A\u062D\u0627\u0648\u0644 \u0627\u0633\u062A\u0639\u0631\u0627\u0636\u0647\u0627 \u0639\u0644\u0649 \u0628\u064A\u0627\u0646\u0627\u062A POSTDATA \u0627\u0646\u062A\u0647\u062A \u0635\u0627\u0644\u062D\u064A\u0651\u062A\u0647\u0627 \u0645\u0646 \u0627\u0644\u0630\u0651\u0627\u0643\u0631\u0629 \u0627\u0644\u0645\u0624\u0642\u0651\u062A\u0629. \u0625\u0630\u0627 \u0645\u0627 \u0623\u0639\u062F\u062A \u0625\u0631\u0633\u0627\u0644 \u0627\u0644\u0628\u064A\u0627\u0646\u0627\u062A \u0641\u0633\u064A\u062A\u0645 \u062A\u0643\u0631\u0627\u0631 \u0623\u064A \u0625\u062C\u0631\u0627\u0621\u064D \u062A\u0645 \u0627\u062A\u0651\u062E\u0627\u0630\u0647 (\u0643\u0627\u0644\u0628\u062D\u062B \u0623\u0648 \u0627\u0644\u0634\u0651\u0631\u0627\u0621). \u0644\u0625\u0639\u0627\u062F\u0629 \u0625\u0631\u0633\u0627\u0644 \u0627\u0644\u0628\u064A\u0627\u0646\u0627\u062A \u0625\u0646\u0642\u0631 \u0645\u0648\u0627\u0641\u0642. \u0641\u064A\u0645\u0627 \u0639\u062F\u0627 \u0630\u0644\u0643 \u0641\u0625\u0646\u0642\u0631 \u0625\u0644\u063A\u0627\u0621.
repostConfirm=\u062A\u062D\u062A\u0648\u064A \u0627\u0644\u0635\u0651\u0641\u062D\u0629 \u0627\u0644\u062A\u064A \u062A\u062D\u0627\u0648\u0644 \u0627\u0633\u062A\u0639\u0631\u0627\u0636\u0647\u0627 \u0639\u0644\u0649 \u0628\u064A\u0627\u0646\u0627\u062A POSTDATA. \u0625\u0630\u0627 \u0645\u0627 \u0623\u0639\u062F\u062A \u0625\u0631\u0633\u0627\u0644 \u0627\u0644\u0628\u064A\u0627\u0646\u0627\u062A \u0641\u0633\u064A\u062A\u0645 \u062A\u0643\u0631\u0627\u0631 \u0623\u064A \u0625\u062C\u0631\u0627\u0621\u064D \u062A\u0645 \u0627\u062A\u0651\u062E\u0627\u0630\u0647 (\u0643\u0627\u0644\u0628\u062D\u062B \u0623\u0648 \u0627\u0644\u0634\u0651\u0631\u0627\u0621). \u0644\u0625\u0639\u0627\u062F\u0629 \u0625\u0631\u0633\u0627\u0644 \u0627\u0644\u0628\u064A\u0627\u0646\u0627\u062A \u0625\u0646\u0642\u0631 \u0645\u0648\u0627\u0641\u0642. \u0641\u064A\u0645\u0627 \u0639\u062F\u0627 \u0630\u0644\u0643 \u0641\u0625\u0646\u0642\u0631 \u0625\u0644\u063A\u0627\u0621.
unknownSocketType=\u0644\u0627 \u064A\u0645\u0643\u0646 \u0639\u0631\u0636 \u0647\u0630\u0627 \u0627\u0644\u0645\u0633\u062A\u0646\u062F \u0625\u0644\u0651\u0627 \u0625\u0630\u0627 \u062B\u0628\u0651\u062A\u0651 \u0645\u062F\u064A\u0631 \u0627\u0644\u0623\u0645\u0646 \u0627\u0644\u0634\u0651\u062E\u0635\u064A (PSM). \u0642\u0645 \u0628\u062A\u0646\u0632\u064A\u0644 \u0648\u062A\u062B\u0628\u064A\u062A PSM \u0648\u062D\u0627\u0648\u0644 \u0645\u062C\u062F\u0651\u062F\u0627\u064B\u060C \u0623\u0648 \u0631\u0627\u062C\u0639 \u0645\u062F\u064A\u0631 \u0646\u0638\u0627\u0645\u0643.
netReset=\u0644\u0627 \u064A\u062D\u062A\u0648\u064A \u0627\u0644\u0645\u0633\u062A\u0646\u062F \u0639\u0644\u0649 \u0623\u064A\u0651\u0629 \u0628\u064A\u0627\u0646\u0627\u062A.
netOffline=\u0644\u0627 \u064A\u0645\u0643\u0646 \u0639\u0631\u0636 \u0647\u0630\u0627 \u0627\u0644\u0645\u0633\u062A\u0646\u062F \u062F\u0648\u0646 \u0627\u062A\u0651\u0635\u0627\u0644. \u0644\u062A\u0635\u0628\u062D \u0645\u062A\u0651\u0635\u0644\u0627\u064B \u0642\u0645 \u0628\u0625\u0632\u0627\u0644\u0629 \u0627\u062E\u062A\u064A\u0627\u0631 "\u0627\u0644\u0639\u0645\u0644 \u062F\u0648\u0646 \u0627\u062A\u0651\u0635\u0627\u0644" \u0645\u0646 \u0642\u0627\u0626\u0645\u0629 \u0645\u0644\u0641\u0651.
isprinting=\u0644\u0627 \u064A\u0645\u0643\u0646 \u062A\u063A\u064A\u064A\u0631 \u0627\u0644\u0645\u0633\u062A\u0646\u062F \u0623\u062B\u0646\u0627\u0621 \u0627\u0644\u0637\u0651\u0628\u0627\u0639\u0629 \u0623\u0648 \u0645\u0639\u0627\u064A\u0646\u0629 \u0627\u0644\u0637\u0651\u0628\u0627\u0639\u0629.
deniedPortAccess=\u062A\u0645 \u062A\u0639\u0637\u064A\u0644 \u0627\u0644\u0648\u0635\u0648\u0644 \u0625\u0644\u0649 \u0631\u0642\u0645 \u0627\u0644\u0645\u0646\u0641\u0630 \u0627\u0644\u0645\u0639\u0637\u0649 \u0644\u0623\u0633\u0628\u0627\u0628\u064D \u0623\u0645\u0646\u064A\u0651\u0629.
proxyResolveFailure=\u0644\u0645 \u064A\u0645\u0643\u0646 \u0627\u0644\u0639\u062B\u0648\u0631 \u0639\u0644\u0649 \u0646\u0627\u062F\u0644 \u0627\u0644\u0628\u0631\u0648\u0643\u0633\u064A \u0627\u0644\u0630\u064A \u0642\u0645\u062A \u0628\u0625\u0639\u062F\u0627\u062F\u0647. \u0627\u0644\u0631\u0651\u062C\u0627\u0621 \u0627\u0644\u062A\u0651\u062D\u0642\u0651\u0642 \u0645\u0646 \u062A\u0639\u064A\u064A\u0646\u0627\u062A \u0627\u0644\u0628\u0631\u0648\u0643\u0633\u064A \u0644\u062F\u064A\u0643 \u0648 \u0627\u0644\u0645\u062D\u0627\u0648\u0644\u0629 \u062B\u0627\u0646\u064A\u0629\u064B.
proxyConnectFailure=\u0631\u0641\u0636 \u0627\u0644\u0627\u062A\u0651\u0635\u0627\u0644 \u0623\u062B\u0646\u0627\u0621 \u0645\u062D\u0627\u0648\u0644\u0629 \u0627\u0644\u0627\u062A\u0651\u0635\u0627\u0644 \u0628\u0646\u0627\u062F\u0644 \u0627\u0644\u0628\u0631\u0648\u0643\u0633\u064A \u0627\u0644\u0630\u064A \u0642\u0645\u062A \u0628\u0625\u0639\u062F\u0627\u062F\u0647. \u0627\u0644\u0631\u0651\u062C\u0627\u0621 \u0627\u0644\u062A\u0651\u062D\u0642\u0651\u0642 \u0645\u0646 \u062A\u0639\u064A\u064A\u0646\u0627\u062A \u0627\u0644\u0628\u0631\u0648\u0643\u0633\u064A \u0644\u062F\u064A\u0643 \u0648 \u0627\u0644\u0645\u062D\u0627\u0648\u0644\u0629 \u062B\u0627\u0646\u064A\u0629\u064B.

externalProtocolTitle=\u0637\u0644\u0628 \u0628\u0631\u0648\u062A\u0648\u0643\u0648\u0644 \u062E\u0627\u0631\u062C\u064A
externalProtocolPrompt=\u064A\u062C\u0628 \u062A\u0634\u063A\u064A\u0644 \u062A\u0637\u0628\u064A\u0642 \u062E\u0627\u0631\u062C\u064A \u0644\u0645\u0639\u0627\u0644\u062C\u0629 \u0648\u0635\u0644\u0627\u062A %1$S:. \u0627\u0644\u0648\u0635\u0644\u0629 \u0627\u0644\u0645\u0637\u0644\u0648\u0628\u0629:\n\n\n%2$S\n\u0627\u0644\u062A\u0651\u0637\u0628\u064A\u0642: %3$S\n\n\n\u0625\u0630\u0627 \u0644\u0645 \u062A\u062A\u0648\u0642\u0651\u0639 \u0647\u0630\u0627 \u0627\u0644\u0637\u0651\u0644\u0628\u060C \u0642\u062F \u062A\u0643\u0648\u0646 \u0647\u0630\u0647 \u0645\u062D\u0627\u0648\u0644\u0629 \u0644\u0627\u0633\u062A\u063A\u0644\u0627\u0644 \u0636\u0639\u0641 \u0641\u064A \u0627\u0644\u0628\u0631\u0646\u0627\u0645\u062C \u0627\u0644\u0622\u062E\u0631. \u0623\u0644\u063A\u0650 \u0627\u0644\u0637\u0651\u0644\u0628 \u0625\u0644\u0627 \u0625\u0630\u0627 \u0643\u0646\u062A \u0645\u062A\u0623\u0643\u0651\u062F\u0627 \u0623\u0646\u0647 \u063A\u064A\u0631 \u062E\u0628\u064A\u062B.
#LOCALIZATION NOTE (externalProtocolUnknown): The following string is shown if the application name can't be determined
externalProtocolUnknown=<\u0645\u062C\u0647\u0648\u0644>
externalProtocolChkMsg=\u062A\u0630\u0643\u0651\u0631 \u0627\u062E\u062A\u064A\u0627\u0631\u064A \u0644\u0643\u0644 \u0627\u0644\u0648\u0635\u0644\u0627\u062A \u0645\u0646 \u0647\u0630\u0647 \u0627\u0644\u0641\u0626\u0629.
externalProtocolLaunchBtn=\u062A\u0634\u063A\u064A\u0644 \u0627\u0644\u062A\u0651\u0637\u0628\u064A\u0642
