# ***** BEGIN LICENSE BLOCK *****
# Version: MPL 1.1/GPL 2.0/LGPL 2.1
#
# The contents of this file are subject to the Mozilla Public License Version
# 1.1 (the "License"); you may not use this file except in compliance with
# the License. You may obtain a copy of the License at
# http://www.mozilla.org/MPL/
#
# Software distributed under the License is distributed on an "AS IS" basis,
# WITHOUT WARRANTY OF ANY KIND, either express or implied. See the License
# for the specific language governing rights and limitations under the
# License.
#
# The Original Code is Mozilla Progress Dialog.
#
# The Initial Developer of the Original Code is
# Netscape Communications Corp.
# Portions created by the Initial Developer are Copyright (C) 2002
# the Initial Developer. All Rights Reserved.
#
# Contributor(s):
#   Bill Law  <law@netscape.com>
#   Zbigniew Braniecki <gandalf@aviary.pl> (Polish translation) 
#   Marek Stepien <marcoos@aviary.pl> (Polish translation)
#
# Alternatively, the contents of this file may be used under the terms of
# either the GNU General Public License Version 2 or later (the "GPL"), or
# the GNU Lesser General Public License Version 2.1 or later (the "LGPL"),
# in which case the provisions of the GPL or the LGPL are applicable instead
# of those above. If you wish to allow use of your version of this file only
# under the terms of either the GPL or the LGPL, and not to allow others to
# use your version of this file under the terms of the MPL, indicate your
# decision by deleting the provisions above and replace them with the notice
# and other provisions required by the GPL or the LGPL. If you do not delete
# the provisions above, a recipient may use your version of this file under
# the terms of any one of the MPL, the GPL or the LGPL.
#
# ***** END LICENSE BLOCK *****

readError=\u0644\u0645 \u064A\u0645\u0643\u0646 \u062D\u0641\u0638 %S\u060C \u0625\u0630 \u0644\u0645 \u064A\u0645\u0643\u0646 \u0642\u0631\u0627\u0621\u0629 \u0627\u0644\u0645\u0644\u0641\u0651 \u0627\u0644\u0645\u0635\u062F\u0631.\n\n\u062D\u0627\u0648\u0644 \u0645\u0631\u0629 \u062B\u0627\u0646\u064A\u0629 \u0644\u0627\u062D\u0642\u0627\u060C \u0623\u0648 \u0627\u062A\u0651\u0635\u0644 \u0628\u0645\u062F\u064A\u0631 \u0627\u0644\u0646\u0651\u0627\u062F\u0644.
writeError=\u0644\u0645 \u064A\u0645\u0643\u0646 \u062D\u0641\u0638 %S\u060C \u0628\u0633\u0628\u0628 \u0648\u0642\u0648\u0639 \u062E\u0637\u0623 \u0645\u062C\u0647\u0648\u0644.\n\n\u062D\u0627\u0648\u0644 \u0627\u0644\u062D\u0641\u0638 \u0644\u0645\u0643\u0627\u0646 \u0622\u062E\u0631.
launchError=\u0644\u0645 \u064A\u0645\u0643\u0646 \u0641\u062A\u062D %S\u060C \u0628\u0633\u0628\u0628 \u0648\u0642\u0648\u0639 \u062E\u0637\u0623 \u0645\u062C\u0647\u0648\u0644.\n\n\u062D\u0627\u0648\u0644 \u0627\u0644\u062D\u0641\u0638 \u0644\u0644\u0642\u0631\u0635 \u0623\u0648\u0644\u0627 \u062B\u0645 \u0641\u062A\u062D \u0627\u0644\u0645\u0644\u0641\u0651.
diskFull=\u0644\u0627 \u062A\u0648\u062C\u062F \u0645\u0633\u0627\u062D\u0629 \u0643\u0627\u0641\u064A\u0629 \u0639\u0644\u0649 \u0627\u0644\u0642\u0631\u0635 \u0644\u062D\u0641\u0638%S.\n\n\u0623\u0632\u0644 \u0627\u0644\u0645\u0644\u0641\u0651\u0627\u062A \u063A\u064A\u0631 \u0627\u0644\u0636\u0651\u0631\u0648\u0631\u064A\u0629 \u0645\u0646 \u0627\u0644\u0642\u0631\u0635 \u0648 \u062D\u0627\u0648\u0644 \u0645\u0631\u0629 \u062B\u0627\u0646\u064A\u0629\u060C \u0623\u0648 \u062D\u0627\u0648\u0644 \u0627\u0644\u062D\u0641\u0638 \u0641\u064A \u0645\u0643\u0627\u0646 \u0622\u062E\u0631.
readOnly=\u0644\u0645 \u064A\u0645\u0643\u0646 \u062D\u0641\u0638 %S\u060C \u0644\u0623\u0646\u0651 \u0627\u0644\u0642\u0631\u0635\u060C \u0627\u0644\u0645\u062C\u0644\u0651\u062F\u060C \u0623\u0648 \u0627\u0644\u0645\u0644\u0641\u0651 \u0645\u062D\u0645\u064A \u0636\u062F\u0651 \u0627\u0644\u0643\u062A\u0627\u0628\u0629.\n\n\u0623\u0639\u062F \u062A\u0645\u0643\u064A\u0646 \u0627\u0644\u0643\u062A\u0627\u0628\u0629 \u0639\u0644\u0649 \u0627\u0644\u0642\u0631\u0635 \u0648 \u062D\u0627\u0648\u0644 \u0645\u0631\u0651\u0629 \u062B\u0627\u0646\u064A\u0629\u060C \u0623\u0648 \u062D\u0627\u0648\u0644 \u0627\u0644\u062D\u0641\u0638 \u0641\u064A \u0645\u0643\u0627\u0646 \u0622\u062E\u0631.
accessError=\u0644\u0645 \u064A\u0645\u0643\u0646 \u062D\u0641\u0638 %S\u060C \u0644\u0623\u0646\u0651\u0643 \u0644\u0627 \u062A\u0633\u062A\u0637\u064A\u0639 \u062A\u063A\u064A\u064A\u0631 \u0645\u062D\u062A\u0648\u064A\u0627\u062A \u0627\u0644\u0645\u062C\u0644\u0651\u062F.\n\n\u063A\u064A\u0651\u0631 \u062E\u0635\u0627\u0626\u0635 \u0627\u0644\u0645\u062C\u0644\u0651\u062F \u0648 \u062D\u0627\u0648\u0644 \u0645\u0631\u0629 \u0623\u062E\u0631\u0649\u060C \u0623\u0648 \u062D\u0627\u0648\u0644 \u0627\u0644\u062D\u0641\u0638 \u0641\u064A \u0645\u0643\u0627\u0646 \u0622\u062E\u0631.
helperAppNotFound=\u0644\u0645 \u064A\u0645\u0643\u0646 \u0641\u062A\u062D %S\u060C \u0644\u0623\u0646 \u0627\u0644\u062A\u0651\u0637\u0628\u064A\u0642 \u0627\u0644\u0645\u0633\u0627\u0639\u062F \u0627\u0644\u0645\u0631\u062A\u0628\u0637 \u063A\u064A\u0631 \u0645\u0648\u062C\u0648\u062F. \u063A\u064A\u0651\u0631 \u0627\u0644\u0627\u0631\u062A\u0628\u0627\u0637 \u0641\u064A \u062A\u0641\u0636\u064A\u0644\u0627\u062A\u0643.
noMemory=\u0644\u0627 \u062A\u0648\u062C\u062F \u0630\u0627\u0643\u0631\u0629 \u0643\u0627\u0641\u064A\u0629 \u0644\u0625\u0643\u0645\u0627\u0644 \u0627\u0644\u0641\u0639\u0644 \u0627\u0644\u0630\u064A \u0637\u0644\u0628\u062A\u0647.\n\n\u0639\u0644\u064A\u0643 \u0627\u0644\u062E\u0631\u0648\u062C \u0645\u0646 \u0628\u0639\u0636 \u0627\u0644\u062A\u0651\u0637\u0628\u064A\u0642\u0627\u062A \u0648 \u0627\u0644\u0645\u062D\u0627\u0648\u0644\u0629 \u0645\u0631\u0651\u0629 \u0623\u062E\u0631\u0649.
title=\u062C\u0627\u0631\u064A \u062A\u0646\u0632\u064A\u0644 %S
fileAlreadyExistsError=\u0644\u0645 \u064A\u0645\u0643\u0646 \u062D\u0641\u0638 %S\u060C \u0644\u0623\u0646\u0651 \u0645\u0644\u0641\u0651\u0627 \u0645\u0648\u062C\u0648\u062F \u0645\u0633\u0628\u0642\u0627 \u0628\u0627\u0644\u0627\u0633\u0645 \u0646\u0641\u0633\u0647 \u0643\u062F\u0644\u064A\u0644 \u0627\u0644\u0645\u0644\u0641\u0651.\n\n\u062D\u0627\u0648\u0644 \u0627\u0644\u062D\u0641\u0638 \u0625\u0644\u0649 \u0645\u0643\u0627\u0646 \u0622\u062E\u0631.
fileNameTooLongError=\u0644\u0645 \u064A\u0645\u0643\u0646 \u062D\u0641\u0638 %S\u060C \u0644\u0623\u0646 \u0627\u0633\u0645 \u0627\u0644\u0645\u0644\u0641\u0651 \u0637\u0648\u064A\u0644 \u062C\u062F\u0627.\n\n\u062D\u0627\u0648\u0644 \u0627\u0644\u062D\u0641\u0638 \u0628\u0627\u0633\u0645 \u0623\u0642\u0635\u0631.

