<?xml version="1.0" encoding="UTF-8"?> <!DOCTYPE html PUBLIC
"-//W3C//DTD XHTML 1.1//EN"
"http://www.w3.org/TR/xhtml11/DTD/xhtml11.dtd"[
<!ENTITY % brandDTD SYSTEM "chrome://global/locale/brand.dtd" >
%brandDTD; ] >

<html xmlns="http://www.w3.org/1999/xhtml"> <head>
  <title>A&ntilde;adir gr&aacute;ficos (im&aacute;genes) a la p&aacute;gina web</title>
  <link rel="stylesheet" type="text/css" href="chrome://help/skin/helpFileLayout.css" />
</head>

<body>
<script type="text/javascript">
var isDisplayed = true;

function togglePanel() {
  isDisplayed = !isDisplayed;
  var displayValue = isDisplayed ? "display: block" : "display: none";
  var bodyValue = isDisplayed ? "margin-left: 175px" : "margin-left:5px";

  document.getElementById("contentsBox").setAttribute("style", displayValue);
  document.getElementsByTagName("body").item(0).setAttribute("style", bodyValue);
}
</script>

<table width="100%" id="navTable">
  <tr>
    <td valign="bottom" width="20"><small><a href="#" onclick="togglePanel();" style="margin-top:10px;">Mostrar/Ocultar</a></small></td>
    <td width="72">
      <img src="chrome://editor/skin/icons/throbber-single.png" width="52" height="52"
           alt="&brandShortName;" align="center"/>
    </td>
    <td align="left">
      <span id="topText">Centro de ayuda</span>
    </td>
  </tr>
</table>

<div id="contentsBox">En esta secci&oacute;n:
  <a href="composer_help.xhtml#starting_a_new_page">Comenzar una nueva p&aacute;gina</a>
  <a href="formatting_webpages.xhtml">Dar formato a las p&aacute;ginas web</a>
  <a href="css.xhtml">Usar hojas de estilo para proporcionar dise&ntilde;o a las p&aacute;ginas web</a>
  <a href="tables.xhtml">A&ntilde;adir tablas a la p&aacute;gina web</a>
  <a href="images.xhtml">A&ntilde;adir gr&aacute;ficos (im&aacute;genes) a la p&aacute;gina web</a>
  <a href="toc.xhtml">Trabajar con una tabla de contenidos en su p&aacute;gina web</a>
  <a href="templates.xhtml">Trabajar con plantillas</a>
  <a href="page_properties.xhtml">Establecer las propiedades de la p&aacute;gina</a>
  <a href="links.xhtml">Crear enlaces con &brandShortName;</a>
  <a href="customize.xhtml">Personalizar &brandShortName;</a>
</div>

<h2 id="adding_pictures_to_your_web_page">A&ntilde;adir gr&aacute;ficos
(im&aacute;genes) a la p&aacute;gina web</h2>

<h3 id="inserting_an_image_into_your_page">Insertar una imagen en la
p&aacute;gina web</h3>

<p>Se pueden insertar im&aacute;genes GIF, JPEG, BMP y PNG en una
p&aacute;gina web. Tambi&eacute;n se pueden utilizar para <a
href="#using_images_as_links">crear enlaces</a>. Cuando se inserta una
imagen, &brandShortName; guarda la referencia a la imagen en la
p&aacute;gina.</p>

<p><strong>Nota</strong>: si planea publicar sus p&aacute;ginas en la web,
es mejor no usar im&aacute;genes BMP en ellas.</p>

<p><strong>Consejo</strong>: es mejor guardar o publicar primero su
p&aacute;gina antes de insertar im&aacute;genes en ella. Esto permite a
&brandShortName; utilizar autom&aacute;ticamente referencias relativas a los
archivos de las im&aacute;genes cuando las inserta.</p>

<p>Para insertar una imagen:</p>

<ol>
  <li>Haga clic para emplazar el punto de inserci&oacute;n donde desee que
  aparezca la imagen.</li>
  <li>Haga clic en el bot&oacute;n Imagen <img src="images/image.png"
  width="26" height="26" alt="" /> de la barra de herramientas o abra el
  men&uacute; Insertar y seleccione Imagen. Aparecer&aacute; el cuadro de
  di&aacute;logo Propiedades de la imagen.</li>
  <li>Escriba la ubicaci&oacute;n y nombre del archivo de la imagen o haga
  clic en Elegir archivo… para buscar un archivo de imagen en el disco
  duro o en red local.</li>

  <li>Escriba el texto alternativo que aparecer&aacute; en los navegadores de
  s&oacute;lo texto y que aparecer&aacute; en los otros navegadores mientras
  se carga la imagen o cuando la carga de im&aacute;genes est&aacute;
  deshabilitada.
  <p>Alternativamente, puede elegir no incluir texto alternativo.</p></li>

  <li>En caso necesario, haga clic en Edici&oacute;n avanzada… para ajustar
  los valores (por ejemplo, alineaci&oacute;n) en el cuadro de di&aacute;logo
  <a href="#editing_image_properties">Propiedades de la imagen</a>.</li>
</ol>

<p><strong>Consejo</strong>: mientras escribe un p&aacute;rrafo que contiene
una o m&aacute;s im&aacute;genes, si desea insertar una l&iacute;nea de corte
tras todas las im&aacute;genes del p&aacute;rrafo, seleccione Ruptura tras
im&aacute;genes (&lt;br clear="all"&gt;) en el men&uacute; Insertar.</p>

<p class="returnToSection">[ <a
href="#adding_pictures_to_your_web_page">Volver
al principio de la secci&oacute;n</a> ]</p>

<h3 id="editing_image_properties">Editar las propiedades de la imagen</h3>

<p>Una vez que haya insertado una imagen en la p&aacute;gina, se pueden
editar sus propiedades y personalizar su dise&ntilde;o, como la altura,
anchura, espaciado y alineaci&oacute;n del texto. Si no se est&aacute;
visualizando el cuadro de di&aacute;logo Propiedades de la imagen,
lleve a cabo los
siguientes pasos:</p>

<p>Para editar las propiedades de una imagen seleccionada:</p>

<ol>

  <li>Haga doble clic en la imagen o selecci&oacute;nela y haga clic en el
  bot&oacute;n Imagen <img src="images/image.png" width="26" height="26"
  alt="" /> de la barra de herramientas para visualizar el cuadro de
  di&aacute;logo Propiedades de la imagen.</li>

  <li>Pulse la pesta&ntilde;a Ubicaci&oacute;n para editar estas propiedades:

    <ul>
      <li><strong>Ubicaci&oacute;n de la imagen</strong>: escriba el nombre y
      ubicaci&oacute;n del archivo de la imagen. Haga clic en Elegir
      archivo… para buscar un archivo de imagen en el disco duro o red
      local.</li>

      <li><strong>La URL es relativa a la ruta de la p&aacute;gina</strong>:
      si est&aacute; seleccionado &brandShortName; convertir&aacute; la URL
      a una direcci&oacute;n relativa a la ubicaci&oacute;n de la
      p&aacute;gina. Esto es especialmente &uacute;til si se planea copiar
      las p&aacute;ginas a un servidor web para que otra gente pueda
      verlas. El uso de URLs relativas permite mantener todos los archivos
      vinculados en el mismo sitio relativo al resto independientemente de
      la ruta en el disco duro o servidor web.

      <p>Al desmarcar esta opci&oacute;n &brandShortName; convierte la URL a
      una URL completa o absoluta. Normalmente se utilizan URLs absolutas
      cuando se vinculan im&aacute;genes en otros servidores web (cuando no
      est&aacute;n almacenadas localmente en el disco duro).</p>

      <p>Si no ha guardado o publicado nunca la p&aacute;gina, se debe
      guardar primero para habilitar esta opci&oacute;n (esta casilla no
      est&aacute; disponible si abre el cuadro de di&aacute;logo de
      propiedades de la imagen mientras redacta un mensaje).</p></li>

      <li><strong>Texto alternativo</strong>: introduzca el texto que se
      visualizar&aacute; en lugar de la imagen original, por ejemplo, un
      t&iacute;tulo o una breve descripci&oacute;n de la imagen. Especificar
      un texto alternativo es una buena pr&aacute;ctica para los lectores que
      utilizan navegadores de s&oacute;lo texto o para quien tiene
      deshabilitada la descarga de im&aacute;genes.</li>

      <li><strong>No usar texto alternativo</strong>: seleccione esta
      opci&oacute;n si la imagen no requiere un texto alternativo o no
      quiere especificar uno.</li>

    </ul>
  </li>

  <li>Pulse en la pesta&ntilde;a Dimensiones para editar estas propiedades:
    <ul>
      <li><strong>Tama&ntilde;o real</strong>: seleccione esta opci&oacute;n
      para deshacer cualquier cambio que haya hecho a las dimensiones de la
      imagen y devolver &eacute;sta a su tama&ntilde;o real.</li>

      <li><strong>Tama&ntilde;o personalizado</strong>: seleccione esta
      opci&oacute;n y especifique una nueva altura y anchura, en
      p&iacute;xeles o como porcentaje. Esta configuraci&oacute;n no afecta
      al archivo original de la imagen, s&oacute;lo a la imagen insertada en
      la p&aacute;gina.</li>

      <li><strong>Mantener aspecto</strong>: es una buena idea marcarlo si se
      ha modificado el tama&ntilde;o de la imagen para mantener la
      proporci&oacute;n de la imagen (para que no aparezca deformada). Si se
      selecciona esta opci&oacute;n s&oacute;lo se necesitar&aacute; cambiar
      la altura o la anchura, pero no ambas.</li>
    </ul>
  </li>

  <li>Pulse en la pesta&ntilde;a Apariencia para editar estas propiedades:
    <ul>
      <li><strong>Espaciado</strong>: especifique la cantidad de espacio del
      contorno de la imagen; el espacio entre la imagen y el texto cercano.
      Tambi&eacute;n se puede colocar un borde negro s&oacute;lido en el
      contorno de la imagen, especificando la anchura en p&iacute;xeles.
      Especifique cero si no quiere borde.</li>

      <li><strong>Alinear el texto con la imagen</strong>: si se coloca la
      imagen al lado de un texto, seleccione un icono de alineaci&oacute;n
      para indicar c&oacute;mo se desea que se posicione el texto en
      relaci&oacute;n con la imagen.</li>

      <li><strong>Mapa de imagen</strong>: haga clic en Eliminar para borrar
      cualquier configuraci&oacute;n de mapa de imagen.</li>
    </ul>
  </li>

  <li>Pulse la pesta&ntilde;a Enlace para editar estas propiedades:
    <ul>
      <li><strong>Introduzca una ubicaci&oacute;n de p&aacute;gina
      web</strong>: si quiere definir un enlace para esta imagen, introduzca
      la URL de una p&aacute;gina remota o local, o seleccione un enlace
      interno o encabezado de la lista desplegable. Pulse Elegir archivo para
      buscar un archivo de imagen en su disco duro o red local.</li>

      <li><strong>La URL es relativa a la ubicaci&oacute;n de la
      p&aacute;gina</strong>: si se marca, &brandShortName; convierte la URL
      a una relativa a la ubicaci&oacute;n de la p&aacute;gina. Esto es
      especialmente &uacute;til si planea publicar sus p&aacute;ginas en un
      servidor web para que otros puedan verlas. Usar URLs relativas le
      permite mantener todos sus archivos enlazados en el mismo lugar
      relativo entre ellos, sin importar su ubicaci&oacute;n en su disco
      duro o servidor web.

      <p>Desmarcar esta casilla provoca que &brandShortName; convierta la URL
      a una direcci&oacute;n completa (absoluta). Normalmente se usan URLs
      absolutas cuando se enlaza a p&aacute;ginas en otros servidores web
      (no almacenadas localmente en su disco duro).</p>

      <p>Si tiene cambios no guardados, se debe guardar primero la
      p&aacute;gina para habilitar esta opci&oacute;n (esta casilla no
      est&aacute; disponible si abre el cuadro de di&aacute;logo de
      propiedades de la imagen mientras redacta un mensaje).</p></li>

      <li><strong>Mostrar borde alrededor de la imagen</strong>: si se marca,
      aparecer&aacute; un borde del color elegido para los enlaces en torno a
      la imagen.</li>

    </ul>
  </li>

  <li>Para aplicar atributos adicionales o eventos JavaScript, haga clic en
  Edici&oacute;n avanzada… para visualizar el <a href=
  "#using_the_advanced_property_editor">editor avanzado de
  propiedades</a>.</li>

  <li>Haga clic en Aceptar para confirmar los cambios.</li>
</ol>

<p class="returnToSection">[ <a
href="#adding_pictures_to_your_web_page">Volver
al principio de la secci&oacute;n</a> ]</p>

<p>[<a href="toc.xhtml">Siguiente</a>] [<a href="tables.xhtml">Anterior</a>]</p>

  <div class="copyrightBox"><em>5 de diciembre de 2009</em></div>

<p>&helpCopyrightNotice;</p>

</body>
</html>
