# ***** BEGIN LICENSE BLOCK *****
# Version: MPL 1.1/GPL 2.0/LGPL 2.1
#
# The contents of this file are subject to the Mozilla Public License Version
# 1.1 (the "License"); you may not use this file except in compliance with
# the License. You may obtain a copy of the License at
# http://www.mozilla.org/MPL/
#
# Software distributed under the License is distributed on an "AS IS" basis,
# WITHOUT WARRANTY OF ANY KIND, either express or implied. See the License
# for the specific language governing rights and limitations under the
# License.
#
# The Original Code is mozilla.org code.
#
# The Initial Developer of the Original Code is
# Netscape Communications Corporation.
# Portions created by the Initial Developer are Copyright (C) 1998
# the Initial Developer. All Rights Reserved.
#
# Contributor(s):
#
# Alternatively, the contents of this file may be used under the terms of
# either of the GNU General Public License Version 2 or later (the "GPL"),
# or the GNU Lesser General Public License Version 2.1 or later (the "LGPL"),
# in which case the provisions of the GPL or the LGPL are applicable instead
# of those above. If you wish to allow use of your version of this file only
# under the terms of either the GPL or the LGPL, and not to allow others to
# use your version of this file under the terms of the MPL, indicate your
# decision by deleting the provisions above and replace them with the notice
# and other provisions required by the GPL or the LGPL. If you do not delete
# the provisions above, a recipient may use your version of this file under
# the terms of any one of the MPL, the GPL or the LGPL.
#
# ***** END LICENSE BLOCK *****

malformedURI=Spletni naslov ni veljaven, zato ga ni mogoče naložiti.
fileNotFound=Datoteke %S ni mogo\u010De najti. Preverite lokacijo in poskusite znova.
dnsNotFound=Strani %S ni mogo\u010De najti. Preverite ime in poskusite znova.
protocolNotFound=%S ni registriran protokol.
connectionFailure=Pri vzpostavljanju povezave s stranjo %S je bila zahteva zavrnjena.
netInterrupt=Povezava s stranjo %S se je nepri\u010Dakovano uni\u010Dila. Nekaj podatkov pa se je morda vendarle preneslo.
netTimeout=\u010Casovna omejitev za vzpostavitev povezave s stranjo %S je potekla.
redirectLoop=Omejitev za preusmeritev za ta naslov je bila prekora\u010Dena. Ni mogo\u010De nalo\u017Eiti zahtevane strani.
repost=Stran, ki jo \u017Eelite videti, vsebuje podatke o oddaji, ki so zastarali v predpomnilniku. \u010Ce jih po\u0161ljete znova, se bo ponovno izvr\u0161ilo dejanje na obrazcu (npr. iskanje ali nakup preko spleta). \u010Ce \u017Eelite podatke vseeno poslati, kliknite V redu, druga\u010De pa kliknite Prekli\u010Di.
repostConfirm=Stran, ki jo \u017Eelite videti, vsebuje podatke o oddaji. \u010Ce jih po\u0161ljete znova, se bo ponovno izvr\u0161ilo dejanje na obrazcu (npr. iskanje ali nakup preko spleta). \u010Ce \u017Eelite podatke vseeno poslati, kliknite V redu, druga\u010De pa kliknite Prekli\u010Di.
unknownSocketType=Tega dokumenta ni mogo\u010De prikazati, \u010De nimate name\u0161\u010Denega upravitelja osebne varnosti (PSM). Prenesite in namestite PSM, ali pa se obrnite na skrbnika sistema.
netReset=Dokument ne vsebuje podatkov.
netOffline=Tega dokumenta ne morem prikazati v brezpovezavnem na\u010Dinu
isprinting=Dokumenta ne morete spremeniti, ko se tiska ali pa ste v predogledu tiskanja.
deniedPortAccess=Dostop do teh vrat je onemogo\u010Den zaradi varnostnih razlogov.
proxyResolveFailure=Stre\u017Enika proxy, ki ste ga navedli, ni mogo\u010De najti. Prosim, preglejte nastavitve za proxy in poskusite ponovno.
proxyConnectFailure=Povezava do stre\u017Enika proxy, ki ste ga nastavili, je bila zavrnjena. Prosim, preglejte nastavitve za proxy in poskusite ponovno.
externalProtocolTitle=Zahteva zunanjega protokola
externalProtocolPrompt=Za poganjanje povezav %1$S: moram pognati zunanji program.\n\n\nZahtevana povezava:\n\n%2$S\n\nProgram: %3$S\n\n\nV primeru, da te zahteve niste pričakovali, bi to lahko bil napad na pomanjkljivost tega zunanjega programa. V kolikor niste prepričani o nenevarnosti te operacije, prekličite odpiranje.\n
#LOCALIZATION NOTE (externalProtocolUnknown): The following string is shown if the application name can't be determined
externalProtocolUnknown=<Neznan>
externalProtocolChkMsg=Mojo odlo\u010Ditev si zapomni za vse povezave tega tipa.
externalProtocolLaunchBtn=Po\u017Eeni program