<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.1//EN" "http://www.w3.org/TR/xhtml11/DTD/xhtml11.dtd"[
    <!ENTITY % brandDTD SYSTEM "chrome://branding/locale/brand.dtd" >
    %brandDTD;
]
>
<!--
Contributors:
  R.J. Keller <rlk@trfenv.com> (original author)
  Jeff Walden <jwalden+code@mit.edu>
  Steffen Wilberg <steffen.wilberg@web.de>

 Proyecto NAVE (http://nave.escomposlinux.org/)
-->

<html xmlns="http://www.w3.org/1999/xhtml">
<head>
  <title>Usar la ventana de ayuda</title>
  <link rel="stylesheet" type="text/css" href="chrome://help/skin/helpFileLayout.css"/>
</head>

<body>

<h1 id="help_window_top">Usar la ventana de ayuda</h1>

<div class="contentsBox">En esta secci&oacute;n:
  <ul>
    <li><a href="#finding_the_topic_you_want">Encontrar el tema deseado</a></li>
    <li><a href="#search_tips">Consejos para buscar</a></li>
  </ul>
</div>

<h2 id="finding_the_topic_you_want">Encontrar el tema deseado</h2>

<p>Para mostrar informaci&oacute;n de la ayuda en esta ventana, pulse en un tema
  en el panel lateral <em>Contenidos</em>. Pulse el <span class="noMac">icono con el signo +</span>
  <span class="mac">tri&aacute;ngulo</span> junto a un tema para ver los subtemas.</p>

<p>Para buscar por un tema de ayuda, escriba una palabra o frase en la barra de <em>b&uacute;squeda</em>
  para ver los temas relacionados. Pulse en un tema para leer acerca del mismo. Si su b&uacute;squeda
  no devuelve ning&uacute;n tema, intente escribir menos palabras o una combinaci&oacute;n de palabras distinta.
  Los resultados se mostrar&aacute;n en el panel lateral <em>Buscar</em> mientras escribe.
  Para volver a mostrar los contenidos del panel lateral, pulse el bot&oacute;n Cerrar en el panel
  lateral <em>Buscar</em>, vacie la barra <em>Buscar</em> o pulse <kbd>Esc</kbd>.</p>

<p>Para ver informaci&oacute;n relacionada con el tema de ayuda que est&aacute; leyendo, pulse los enlaces en
  la ventana de ayuda igual que si fuera una p&aacute;gina web normal. Tambi&eacute;n se puede mover
  hacia atr&aacute;s y hacia adelente entre las p&aacute;ginas que ya ha visitado usando los botones
  Adelante y Atr&aacute;s.</p>

<h2 id="search_tips">Consejos para buscar</h2>

<p>Si no encuentra lo que busca, a continuaci&oacute;n hay algunos consejos &uacute;tiles:</p>

<ul>
  <li>Aseg&uacute;rese de que busca algo relacionado con &brandShortName;; &eacute;sta no es una b&uacute;squeda
    general por Internet.</li>
  <li>Intente ampliar la b&uacute;squeda - no sea demasiado espec&iacute;fico, ya que los t&eacute;rminos pueden estar
    escritos de forma distinta a la utilizada en la b&uacute;squeda.</li>
  <li>Evite ser demasido amplio al buscar. Por ejemplo, una palabra de uso com&uacute;n como
    &quot;p&aacute;gina&quot; devolver&aacute;n m&aacute;s temas de los deseados.</li>
</ul>

<div class="contentsBox"><p><em>09 Julio 2005</em></p>
<p><em>Traducido el 13 de mayo de 2006</em></p></div>
<p>Copyright &copy; 2003-2006 Colaboradores del proyecto del visor de ayuda para Mozilla.</p>

</body>
</html>
